{
  "data": {
    "CAPA": {
      "tactics": [
        {
          "id": "TA0005",
          "name": "Defense Evasion",
          "link": "https://attack.mitre.org/tactics/TA0005/",
          "description": "The adversary is trying to avoid being detected.\n\nDefense Evasion consists of techniques that adversaries use to avoid detection throughout their compromise. Techniques used for defense evasion include uninstalling/disabling security software or obfuscating/encrypting data and scripts. Adversaries also leverage and abuse trusted processes to hide and masquerade their malware. Other tactics’ techniques are cross-listed here when those techniques include the added benefit of subverting defenses. ",
          "techniques": [
            {
              "id": "T1027",
              "name": "Obfuscated Files or Information",
              "link": "https://attack.mitre.org/techniques/T1027/",
              "description": "Adversaries may attempt to make an executable or file difficult to discover or analyze by encrypting, encoding, or otherwise obfuscating its contents on the system or in transit. This is common behavior that can be used across different platforms and the network to evade defenses. \nPayloads may be compressed, archived, or encrypted in order to avoid detection. These payloads may be used during Initial Access or later to mitigate detection. Sometimes a user's action may be required to open and Deobfuscate/Decode Files or Information for User Execution. The user may also be required to input a password to open a password protected compressed/encrypted file that was provided by the adversary.  Adversaries may also use compressed or archived scripts, such as JavaScript. \nPortions of files can also be encoded to hide the plain-text strings that would otherwise help defenders with discovery.  Payloads may also be split into separate, seemingly benign files that only reveal malicious functionality when reassembled. \nAdversaries may also abuse Command Obfuscation to obscure commands executed from payloads or directly via Command and Scripting Interpreter. Environment variables, aliases, characters, and other platform/language specific semantics can be used to evade signature based detections and application control mechanisms.   ",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "encode data using Base64",
                  "match_data": [
                    "api: System.Convert::ToBase64String"
                  ]
                }
              ]
            },
            {
              "id": "T1222",
              "name": "File and Directory Permissions Modification",
              "link": "https://attack.mitre.org/techniques/T1222/",
              "description": "Adversaries may modify file or directory permissions/attributes to evade access control lists (ACLs) and access protected files. File and directory permissions are commonly managed by ACLs configured by the file or directory owner, or users with the appropriate permissions. File and directory ACL implementations vary by platform, but generally explicitly designate which users or groups can perform which actions (read, write, execute, etc.).\nModifications may include changing specific access rights, which may require taking ownership of a file or directory and/or elevated permissions depending on the file or directory’s existing permissions. This may enable malicious activity such as modifying, replacing, or deleting specific files or directories. Specific file and directory modifications may be a required step for many techniques, such as establishing Persistence via Accessibility Features, Boot or Logon Initialization Scripts, Unix Shell Configuration Modification, or tainting/hijacking other instrumental binary/configuration files via Hijack Execution Flow.\nAdversaries may also change permissions of symbolic links. For example, malware (particularly ransomware) may modify symbolic links and associated settings to enable access to files from local shortcuts with remote paths. ",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "set file attributes",
                  "match_data": [
                    "api: utime"
                  ]
                }
              ]
            },
            {
              "id": "T1620",
              "name": "Reflective Code Loading",
              "link": "https://attack.mitre.org/techniques/T1620/",
              "description": "Adversaries may reflectively load code into a process in order to conceal the execution of malicious payloads. Reflective loading involves allocating then executing payloads directly within the memory of the process, vice creating a thread or process backed by a file path on disk (e.g., Shared Modules).\nReflectively loaded payloads may be compiled binaries, anonymous files (only present in RAM), or just snubs of fileless executable code (ex: position-independent shellcode). For example, the Assembly.Load() method executed by PowerShell may be abused to load raw code into the running process.\nReflective code injection is very similar to Process Injection except that the “injection” loads code into the processes’ own memory instead of that of a separate process. Reflective loading may evade process-based detections since the execution of the arbitrary code may be masked within a legitimate or otherwise benign process. Reflectively loading payloads directly into memory may also avoid creating files or other artifacts on disk, while also enabling malware to keep these payloads encrypted (or otherwise obfuscated) until execution.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "invoke .NET assembly method",
                  "match_data": [
                    "api: System.Type::GetMethod",
                    "api: System.Type::InvokeMember",
                    "api: System.Reflection.MethodBase::Invoke"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "load .NET assembly",
                  "match_data": [
                    "api: System.AppDomain::Load",
                    "api: System.Reflection.Assembly::Load"
                  ]
                }
              ]
            },
            {
              "id": "T1140",
              "name": "Deobfuscate/Decode Files or Information",
              "link": "https://attack.mitre.org/techniques/T1140/",
              "description": "Adversaries may use Obfuscated Files or Information to hide artifacts of an intrusion from analysis. They may require separate mechanisms to decode or deobfuscate that information depending on how they intend to use it. Methods for doing that include built-in functionality of malware or by using utilities present on the system.\nOne such example is the use of certutil to decode a remote access tool portable executable file that has been hidden inside a certificate file. Another example is using the Windows copy /b or type command to reassemble binary fragments into a malicious payload.\nSometimes a user's action may be required to open it for deobfuscation or decryption as part of User Execution. The user may also be required to input a password to open a password protected compressed/encrypted file that was provided by the adversary.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "decode data using Base64 in .NET",
                  "match_data": [
                    "api: System.Convert::FromBase64String"
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0007",
          "name": "Discovery",
          "link": "https://attack.mitre.org/tactics/TA0007/",
          "description": "The adversary is trying to figure out your environment.\n\nDiscovery consists of techniques an adversary may use to gain knowledge about the system and internal network. These techniques help adversaries observe the environment and orient themselves before deciding how to act. They also allow adversaries to explore what they can control and what’s around their entry point in order to discover how it could benefit their current objective. Native operating system tools are often used toward this post-compromise information-gathering objective. ",
          "techniques": [
            {
              "id": "T1082",
              "name": "System Information Discovery",
              "link": "https://attack.mitre.org/techniques/T1082/",
              "description": "An adversary may attempt to get detailed information about the operating system and hardware, including version, patches, hotfixes, service packs, and architecture. Adversaries may use the information from System Information Discovery during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\nTools such as Systeminfo can be used to gather detailed system information. If running with privileged access, a breakdown of system data can be gathered through the systemsetup configuration tool on macOS. As an example, adversaries with user-level access can execute the df -aH command to obtain currently mounted disks and associated freely available space. Adversaries may also leverage a Network Device CLI on network devices to gather detailed system information (e.g. show version). On ESXi servers, threat actors may gather system information from various esxcli utilities, such as system hostname get, system version get, and storage filesystem list (to list storage volumes).\nInfrastructure as a Service (IaaS) cloud providers such as AWS, GCP, and Azure allow access to instance and virtual machine information via APIs. Successful authenticated API calls can return data such as the operating system platform and status of a particular instance or the model view of a virtual machine.\nSystem Information Discovery combined with information gathered from other forms of discovery and reconnaissance can drive payload development and concealment. ",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "get OS version in .NET",
                  "match_data": [
                    "property: System.OperatingSystem::Version",
                    "property: System.Environment::OSVersion"
                  ]
                }
              ]
            },
            {
              "id": "T1083",
              "name": "File and Directory Discovery",
              "link": "https://attack.mitre.org/techniques/T1083/",
              "description": "Adversaries may enumerate files and directories or may search in specific locations of a host or network share for certain information within a file system. Adversaries may use the information from File and Directory Discovery during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\nMany command shell utilities can be used to obtain this information. Examples include dir, tree, ls, find, and locate. Custom tools may also be used to gather file and directory information and interact with the Native API. Adversaries may also leverage a Network Device CLI on network devices to gather file and directory information (e.g. dir, show flash, and/or nvram).\nSome files and directories may require elevated or specific user permissions to access.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "enumerate files in .NET",
                  "match_data": [
                    "api: System.IO.Directory::GetFiles"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "check if file exists",
                  "match_data": [
                    "api: System.IO.File::Exists"
                  ]
                }
              ]
            },
            {
              "id": "T1012",
              "name": "Query Registry",
              "link": "https://attack.mitre.org/techniques/T1012/",
              "description": "Adversaries may interact with the Windows Registry to gather information about the system, configuration, and installed software.\nThe Registry contains a significant amount of information about the operating system, configuration, software, and security. Information can easily be queried using the Reg utility, though other means to access the Registry exist. Some of the information may help adversaries to further their operation within a network. Adversaries may use the information from Query Registry during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "query or enumerate registry value",
                  "match_data": [
                    "api: RegQueryValueEx"
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0002",
          "name": "Execution",
          "link": "https://attack.mitre.org/tactics/TA0002/",
          "description": "The adversary is trying to run malicious code.\n\nExecution consists of techniques that result in adversary-controlled code running on a local or remote system. Techniques that run malicious code are often paired with techniques from all other tactics to achieve broader goals, like exploring a network or stealing data. For example, an adversary might use a remote access tool to run a PowerShell script that does Remote System Discovery. ",
          "techniques": [
            {
              "id": "T1129",
              "name": "Shared Modules",
              "link": "https://attack.mitre.org/techniques/T1129/",
              "description": "Adversaries may execute malicious payloads via loading shared modules. Shared modules are executable files that are loaded into processes to provide access to reusable code, such as specific custom functions or invoking OS API functions (i.e., Native API).\nAdversaries may use this functionality as a way to execute arbitrary payloads on a victim system. For example, adversaries can modularize functionality of their malware into shared objects that perform various functions such as managing C2 network communications or execution of specific actions on objective.\nThe Linux & macOS module loader can load and execute shared objects from arbitrary local paths. This functionality resides in dlfcn.h in functions such as dlopen and dlsym. Although macOS can execute .so files, common practice uses .dylib files.\nThe Windows module loader can be instructed to load DLLs from arbitrary local paths and arbitrary Universal Naming Convention (UNC) network paths. This functionality resides in NTDLL.dll and is part of the Windows Native API which is called from functions like LoadLibrary at run time.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "link function at runtime on Linux",
                  "match_data": [
                    "api: dlsym"
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    "CAPE Sandbox": {
      "tactics": [
        {
          "id": "TA0007",
          "name": "Discovery",
          "link": "https://attack.mitre.org/tactics/TA0007/",
          "description": "The adversary is trying to figure out your environment.\n\nDiscovery consists of techniques an adversary may use to gain knowledge about the system and internal network. These techniques help adversaries observe the environment and orient themselves before deciding how to act. They also allow adversaries to explore what they can control and what’s around their entry point in order to discover how it could benefit their current objective. Native operating system tools are often used toward this post-compromise information-gathering objective. ",
          "techniques": [
            {
              "id": "T1082",
              "name": "System Information Discovery",
              "link": "https://attack.mitre.org/techniques/T1082/",
              "description": "An adversary may attempt to get detailed information about the operating system and hardware, including version, patches, hotfixes, service packs, and architecture. Adversaries may use the information from System Information Discovery during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\nTools such as Systeminfo can be used to gather detailed system information. If running with privileged access, a breakdown of system data can be gathered through the systemsetup configuration tool on macOS. As an example, adversaries with user-level access can execute the df -aH command to obtain currently mounted disks and associated freely available space. Adversaries may also leverage a Network Device CLI on network devices to gather detailed system information (e.g. show version). On ESXi servers, threat actors may gather system information from various esxcli utilities, such as system hostname get, system version get, and storage filesystem list (to list storage volumes).\nInfrastructure as a Service (IaaS) cloud providers such as AWS, GCP, and Azure allow access to instance and virtual machine information via APIs. Successful authenticated API calls can return data such as the operating system platform and status of a particular instance or the model view of a virtual machine.\nSystem Information Discovery combined with information gathered from other forms of discovery and reconnaissance can drive payload development and concealment. ",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Checks available memory",
                  "match_data": [
                    "Process JlsGsa8.exe"
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0011",
          "name": "Command and Control",
          "link": "https://attack.mitre.org/tactics/TA0011/",
          "description": "The adversary is trying to communicate with compromised systems to control them.\n\nCommand and Control consists of techniques that adversaries may use to communicate with systems under their control within a victim network. Adversaries commonly attempt to mimic normal, expected traffic to avoid detection. There are many ways an adversary can establish command and control with various levels of stealth depending on the victim’s network structure and defenses.",
          "techniques": [
            {
              "id": "T1071",
              "name": "Application Layer Protocol",
              "link": "https://attack.mitre.org/techniques/T1071/",
              "description": "Adversaries may communicate using OSI application layer protocols to avoid detection/network filtering by blending in with existing traffic. Commands to the remote system, and often the results of those commands, will be embedded within the protocol traffic between the client and server. \nAdversaries may utilize many different protocols, including those used for web browsing, transferring files, electronic mail, DNS, or publishing/subscribing. For connections that occur internally within an enclave (such as those between a proxy or pivot node and other nodes), commonly used protocols are SMB, SSH, or RDP. ",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "The PE file contains an overlay",
                  "match_data": [
                    "Contains overlay at offset 0x00915e00 with size: 11608 bytes"
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0002",
          "name": "Execution",
          "link": "https://attack.mitre.org/tactics/TA0002/",
          "description": "The adversary is trying to run malicious code.\n\nExecution consists of techniques that result in adversary-controlled code running on a local or remote system. Techniques that run malicious code are often paired with techniques from all other tactics to achieve broader goals, like exploring a network or stealing data. For example, an adversary might use a remote access tool to run a PowerShell script that does Remote System Discovery. ",
          "techniques": [
            {
              "id": "T1106",
              "name": "Native API",
              "link": "https://attack.mitre.org/techniques/T1106/",
              "description": "Adversaries may interact with the native OS application programming interface (API) to execute behaviors. Native APIs provide a controlled means of calling low-level OS services within the kernel, such as those involving hardware/devices, memory, and processes. These native APIs are leveraged by the OS during system boot (when other system components are not yet initialized) as well as carrying out tasks and requests during routine operations.\nAdversaries may abuse these OS API functions as a means of executing behaviors. Similar to Command and Scripting Interpreter, the native API and its hierarchy of interfaces provide mechanisms to interact with and utilize various components of a victimized system.\nNative API functions (such as NtCreateProcess) may be directed invoked via system calls / syscalls, but these features are also often exposed to user-mode applications via interfaces and libraries. For example, functions such as the Windows API CreateProcess() or GNU fork() will allow programs and scripts to start other processes. This may allow API callers to execute a binary, run a CLI command, load modules, etc. as thousands of similar API functions exist for various system operations.\nHigher level software frameworks, such as Microsoft .NET and macOS Cocoa, are also available to interact with native APIs. These frameworks typically provide language wrappers/abstractions to API functionalities and are designed for ease-of-use/portability of code.\nAdversaries may use assembly to directly or in-directly invoke syscalls in an attempt to subvert defensive sensors and detection signatures such as user mode API-hooks. Adversaries may also attempt to tamper with sensors and defensive tools associated with API monitoring, such as unhooking monitored functions via Disable or Modify Tools.",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Guard pages use detected - possible anti-debugging.",
                  "match_data": [
                    "Process JlsGsa8.exe"
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0005",
          "name": "Defense Evasion",
          "link": "https://attack.mitre.org/tactics/TA0005/",
          "description": "The adversary is trying to avoid being detected.\n\nDefense Evasion consists of techniques that adversaries use to avoid detection throughout their compromise. Techniques used for defense evasion include uninstalling/disabling security software or obfuscating/encrypting data and scripts. Adversaries also leverage and abuse trusted processes to hide and masquerade their malware. Other tactics’ techniques are cross-listed here when those techniques include the added benefit of subverting defenses. ",
          "techniques": [
            {
              "id": "T1027",
              "name": "Obfuscated Files or Information",
              "link": "https://attack.mitre.org/techniques/T1027/",
              "description": "Adversaries may attempt to make an executable or file difficult to discover or analyze by encrypting, encoding, or otherwise obfuscating its contents on the system or in transit. This is common behavior that can be used across different platforms and the network to evade defenses. \nPayloads may be compressed, archived, or encrypted in order to avoid detection. These payloads may be used during Initial Access or later to mitigate detection. Sometimes a user's action may be required to open and Deobfuscate/Decode Files or Information for User Execution. The user may also be required to input a password to open a password protected compressed/encrypted file that was provided by the adversary.  Adversaries may also use compressed or archived scripts, such as JavaScript. \nPortions of files can also be encoded to hide the plain-text strings that would otherwise help defenders with discovery.  Payloads may also be split into separate, seemingly benign files that only reveal malicious functionality when reassembled. \nAdversaries may also abuse Command Obfuscation to obscure commands executed from payloads or directly via Command and Scripting Interpreter. Environment variables, aliases, characters, and other platform/language specific semantics can be used to evade signature based detections and application control mechanisms.   ",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "The binary likely contains encrypted or compressed data",
                  "match_data": [
                    ".text"
                  ]
                }
              ]
            },
            {
              "id": "T1027.002",
              "name": "Software Packing",
              "link": "https://attack.mitre.org/techniques/T1027/002/",
              "description": "Adversaries may perform software packing or virtual machine software protection to conceal their code. Software packing is a method of compressing or encrypting an executable. Packing an executable changes the file signature in an attempt to avoid signature-based detection. Most decompression techniques decompress the executable code in memory. Virtual machine software protection translates an executable's original code into a special format that only a special virtual machine can run. A virtual machine is then called to run this code. \nUtilities used to perform software packing are called packers. Example packers are MPRESS and UPX. A more comprehensive list of known packers is available, but adversaries may create their own packing techniques that do not leave the same artifacts as well-known packers to evade defenses.  ",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "The binary likely contains encrypted or compressed data",
                  "match_data": [
                    ".text"
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    "VMRay": {
      "tactics": [
        {
          "id": "TA0009",
          "name": "Collection",
          "link": "https://attack.mitre.org/tactics/TA0009/",
          "description": "The adversary is trying to gather data of interest to their goal.\n\nCollection consists of techniques adversaries may use to gather information and the sources information is collected from that are relevant to following through on the adversary's objectives. Frequently, the next goal after collecting data is to either steal (exfiltrate) the data or to use the data to gain more information about the target environment. Common target sources include various drive types, browsers, audio, video, and email. Common collection methods include capturing screenshots and keyboard input.",
          "techniques": [
            {
              "id": "T1005",
              "name": "Data from Local System",
              "link": "https://attack.mitre.org/techniques/T1005/",
              "description": "Adversaries may search local system sources, such as file systems, configuration files, local databases, or virtual machine files, to find files of interest and sensitive data prior to Exfiltration.\nAdversaries may do this using a Command and Scripting Interpreter, such as cmd as well as a Network Device CLI, which have functionality to interact with the file system to gather information. Adversaries may also use Automated Collection on the local system.",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Searches for sensitive browser data",
                  "match_data": [
                    "test.exe searches for sensitive data of web browser \"Opera\" by file.",
                    "test.exe searches for sensitive data of web browser \"Chrome Canary\" by file.",
                    "test.exe searches for sensitive data of web browser \"Maple Studio\" by file.",
                    "test.exe searches for sensitive data of web browser \"Amigo\" by file.",
                    "test.exe searches for sensitive data of web browser \"Torch\" by file.",
                    "test.exe searches for sensitive data of web browser \"Orbitum\" by file.",
                    "test.exe searches for sensitive data of web browser \"Chromium\" by file.",
                    "test.exe searches for sensitive data of web browser \"Uran\" by file.",
                    "test.exe searches for sensitive data of web browser \"Sputnik\" by file.",
                    "test.exe searches for sensitive data of web browser \"Internet Explorer / Edge\" by file."
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "Reads sensitive browser data",
                  "match_data": [
                    "test.exe tries to read sensitive data of web browser \"Internet Explorer / Edge\" by file."
                  ]
                }
              ]
            },
            {
              "id": "T1113",
              "name": "Screen Capture",
              "link": "https://attack.mitre.org/techniques/T1113/",
              "description": "Adversaries may attempt to take screen captures of the desktop to gather information over the course of an operation. Screen capturing functionality may be included as a feature of a remote access tool used in post-compromise operations. Taking a screenshot is also typically possible through native utilities or API calls, such as CopyFromScreen, xwd, or screencapture.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Takes screenshot",
                  "match_data": [
                    "test.exe takes a screenshot using BitBlt API."
                  ]
                }
              ]
            },
            {
              "id": "T1119",
              "name": "Automated Collection",
              "link": "https://attack.mitre.org/techniques/T1119/",
              "description": "Once established within a system or network, an adversary may use automated techniques for collecting internal data. Methods for performing this technique could include use of a Command and Scripting Interpreter to search for and copy information fitting set criteria such as file type, location, or name at specific time intervals. \nIn cloud-based environments, adversaries may also use cloud APIs, data pipelines, command line interfaces, or extract, transform, and load (ETL) services to automatically collect data. \nThis functionality could also be built into remote access tools. \nThis technique may incorporate use of other techniques such as File and Directory Discovery and Lateral Tool Transfer to identify and move files, as well as Cloud Service Dashboard and Cloud Storage Object Discovery to identify resources in cloud environments.",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Searches for sensitive browser data",
                  "match_data": [
                    "test.exe searches for sensitive data of web browser \"Opera\" by file.",
                    "test.exe searches for sensitive data of web browser \"Chrome Canary\" by file.",
                    "test.exe searches for sensitive data of web browser \"Maple Studio\" by file.",
                    "test.exe searches for sensitive data of web browser \"Amigo\" by file.",
                    "test.exe searches for sensitive data of web browser \"Torch\" by file.",
                    "test.exe searches for sensitive data of web browser \"Orbitum\" by file.",
                    "test.exe searches for sensitive data of web browser \"Chromium\" by file.",
                    "test.exe searches for sensitive data of web browser \"Uran\" by file.",
                    "test.exe searches for sensitive data of web browser \"Sputnik\" by file.",
                    "test.exe searches for sensitive data of web browser \"Internet Explorer / Edge\" by file."
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "Reads sensitive browser data",
                  "match_data": [
                    "test.exe tries to read sensitive data of web browser \"Internet Explorer / Edge\" by file."
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0007",
          "name": "Discovery",
          "link": "https://attack.mitre.org/tactics/TA0007/",
          "description": "The adversary is trying to figure out your environment.\n\nDiscovery consists of techniques an adversary may use to gain knowledge about the system and internal network. These techniques help adversaries observe the environment and orient themselves before deciding how to act. They also allow adversaries to explore what they can control and what’s around their entry point in order to discover how it could benefit their current objective. Native operating system tools are often used toward this post-compromise information-gathering objective. ",
          "techniques": [
            {
              "id": "T1012",
              "name": "Query Registry",
              "link": "https://attack.mitre.org/techniques/T1012/",
              "description": "Adversaries may interact with the Windows Registry to gather information about the system, configuration, and installed software.\nThe Registry contains a significant amount of information about the operating system, configuration, software, and security. Information can easily be queried using the Reg utility, though other means to access the Registry exist. Some of the information may help adversaries to further their operation within a network. Adversaries may use the information from Query Registry during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Reads system data",
                  "match_data": [
                    "test.exe reads the cryptographic machine GUID from registry."
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "Possibly does reconnaissance",
                  "match_data": [
                    "test.exe tries to gather information about application \"Steam\" by registry."
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "Query OS Information",
                  "match_data": [
                    "mscontainer.exe reads installation type from registry.",
                    "mscontainer.exe reads product name from registry."
                  ]
                }
              ]
            },
            {
              "id": "T1016",
              "name": "System Network Configuration Discovery",
              "link": "https://attack.mitre.org/techniques/T1016/",
              "description": "Adversaries may look for details about the network configuration and settings, such as IP and/or MAC addresses, of systems they access or through information discovery of remote systems. Several operating system administration utilities exist that can be used to gather this information. Examples include Arp, ipconfig/ifconfig, nbtstat, and route.\nAdversaries may also leverage a Network Device CLI on network devices to gather information about configurations and settings, such as IP addresses of configured interfaces and static/dynamic routes (e.g. show ip route, show ip interface). On ESXi, adversaries may leverage esxcli to gather network configuration information. For example, the command esxcli network nic list will retrieve the MAC address, while esxcli network ip interface ipv4 get will retrieve the local IPv4 address.\nAdversaries may use the information from System Network Configuration Discovery during automated discovery to shape follow-on behaviors, including determining certain access within the target network and what actions to do next. ",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Queries a host's domain name",
                  "match_data": [
                    "test.exe queries the host's domain name."
                  ]
                }
              ]
            },
            {
              "id": "T1057",
              "name": "Process Discovery",
              "link": "https://attack.mitre.org/techniques/T1057/",
              "description": "Adversaries may attempt to get information about running processes on a system. Information obtained could be used to gain an understanding of common software/applications running on systems within the network. Administrator or otherwise elevated access may provide better process details. Adversaries may use the information from Process Discovery during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\nIn Windows environments, adversaries could obtain details on running processes using the Tasklist utility via cmd or Get-Process via PowerShell. Information about processes can also be extracted from the output of Native API calls such as CreateToolhelp32Snapshot. In Mac and Linux, this is accomplished with the ps command. Adversaries may also opt to enumerate processes via /proc. ESXi also supports use of the ps command, as well as esxcli system process list.\nOn network devices, Network Device CLI commands such as show processes can be used to display current running processes.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Enumerates running processes",
                  "match_data": [
                    "test.exe enumerates running processes."
                  ]
                }
              ]
            },
            {
              "id": "T1082",
              "name": "System Information Discovery",
              "link": "https://attack.mitre.org/techniques/T1082/",
              "description": "An adversary may attempt to get detailed information about the operating system and hardware, including version, patches, hotfixes, service packs, and architecture. Adversaries may use the information from System Information Discovery during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\nTools such as Systeminfo can be used to gather detailed system information. If running with privileged access, a breakdown of system data can be gathered through the systemsetup configuration tool on macOS. As an example, adversaries with user-level access can execute the df -aH command to obtain currently mounted disks and associated freely available space. Adversaries may also leverage a Network Device CLI on network devices to gather detailed system information (e.g. show version). On ESXi servers, threat actors may gather system information from various esxcli utilities, such as system hostname get, system version get, and storage filesystem list (to list storage volumes).\nInfrastructure as a Service (IaaS) cloud providers such as AWS, GCP, and Azure allow access to instance and virtual machine information via APIs. Successful authenticated API calls can return data such as the operating system platform and status of a particular instance or the model view of a virtual machine.\nSystem Information Discovery combined with information gathered from other forms of discovery and reconnaissance can drive payload development and concealment. ",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Reads system data",
                  "match_data": [
                    "test.exe reads the cryptographic machine GUID from registry."
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "Collects hardware properties",
                  "match_data": [
                    "test.exe queries hardware properties via WMI: Select Name from Win32_VideoController.",
                    "test.exe queries hardware properties via WMI: select Name from Win32_Processor.",
                    "test.exe queries hardware properties via WMI: select TotalPhysicalMemory from Win32_ComputerSystem."
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "Queries OS version via WMI",
                  "match_data": [
                    "test.exe queries OS version via WMI query: select * from Win32_OperatingSystem."
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "Query OS Information",
                  "match_data": [
                    "mscontainer.exe reads installation type from registry.",
                    "mscontainer.exe reads product name from registry."
                  ]
                }
              ]
            },
            {
              "id": "T1083",
              "name": "File and Directory Discovery",
              "link": "https://attack.mitre.org/techniques/T1083/",
              "description": "Adversaries may enumerate files and directories or may search in specific locations of a host or network share for certain information within a file system. Adversaries may use the information from File and Directory Discovery during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\nMany command shell utilities can be used to obtain this information. Examples include dir, tree, ls, find, and locate. Custom tools may also be used to gather file and directory information and interact with the Native API. Adversaries may also leverage a Network Device CLI on network devices to gather file and directory information (e.g. dir, show flash, and/or nvram).\nSome files and directories may require elevated or specific user permissions to access.",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Searches for sensitive browser data",
                  "match_data": [
                    "test.exe searches for sensitive data of web browser \"Opera\" by file.",
                    "test.exe searches for sensitive data of web browser \"Chrome Canary\" by file.",
                    "test.exe searches for sensitive data of web browser \"Maple Studio\" by file.",
                    "test.exe searches for sensitive data of web browser \"Amigo\" by file.",
                    "test.exe searches for sensitive data of web browser \"Torch\" by file.",
                    "test.exe searches for sensitive data of web browser \"Orbitum\" by file.",
                    "test.exe searches for sensitive data of web browser \"Chromium\" by file.",
                    "test.exe searches for sensitive data of web browser \"Uran\" by file.",
                    "test.exe searches for sensitive data of web browser \"Sputnik\" by file.",
                    "test.exe searches for sensitive data of web browser \"Internet Explorer / Edge\" by file."
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "Reads sensitive browser data",
                  "match_data": [
                    "test.exe tries to read sensitive data of web browser \"Internet Explorer / Edge\" by file."
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "Possibly does reconnaissance",
                  "match_data": [
                    "test.exe tries to gather information about application \"Mozilla Firefox\" by file.",
                    "test.exe tries to gather information about application \"SeaMonkey\" by file.",
                    "test.exe tries to gather information about application \"Comodo IceDragon\" by file.",
                    "test.exe tries to gather information about application \"k-Meleon\" by file.",
                    "test.exe tries to gather information about application \"Cyberfox\" by file."
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0005",
          "name": "Defense Evasion",
          "link": "https://attack.mitre.org/tactics/TA0005/",
          "description": "The adversary is trying to avoid being detected.\n\nDefense Evasion consists of techniques that adversaries use to avoid detection throughout their compromise. Techniques used for defense evasion include uninstalling/disabling security software or obfuscating/encrypting data and scripts. Adversaries also leverage and abuse trusted processes to hide and masquerade their malware. Other tactics’ techniques are cross-listed here when those techniques include the added benefit of subverting defenses. ",
          "techniques": [
            {
              "id": "T1027",
              "name": "Obfuscated Files or Information",
              "link": "https://attack.mitre.org/techniques/T1027/",
              "description": "Adversaries may attempt to make an executable or file difficult to discover or analyze by encrypting, encoding, or otherwise obfuscating its contents on the system or in transit. This is common behavior that can be used across different platforms and the network to evade defenses. \nPayloads may be compressed, archived, or encrypted in order to avoid detection. These payloads may be used during Initial Access or later to mitigate detection. Sometimes a user's action may be required to open and Deobfuscate/Decode Files or Information for User Execution. The user may also be required to input a password to open a password protected compressed/encrypted file that was provided by the adversary.  Adversaries may also use compressed or archived scripts, such as JavaScript. \nPortions of files can also be encoded to hide the plain-text strings that would otherwise help defenders with discovery.  Payloads may also be split into separate, seemingly benign files that only reveal malicious functionality when reassembled. \nAdversaries may also abuse Command Obfuscation to obscure commands executed from payloads or directly via Command and Scripting Interpreter. Environment variables, aliases, characters, and other platform/language specific semantics can be used to evade signature based detections and application control mechanisms.   "
            },
            {
              "id": "T1027.002",
              "name": "Software Packing",
              "link": "https://attack.mitre.org/techniques/T1027/002/",
              "description": "Adversaries may perform software packing or virtual machine software protection to conceal their code. Software packing is a method of compressing or encrypting an executable. Packing an executable changes the file signature in an attempt to avoid signature-based detection. Most decompression techniques decompress the executable code in memory. Virtual machine software protection translates an executable's original code into a special format that only a special virtual machine can run. A virtual machine is then called to run this code. \nUtilities used to perform software packing are called packers. Example packers are MPRESS and UPX. A more comprehensive list of known packers is available, but adversaries may create their own packing techniques that do not leave the same artifacts as well-known packers to evade defenses.  ",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Creates a page with write and execute permissions",
                  "match_data": [
                    "jlsgsa8.exe allocates a page in a foreign process with \"PAGE_EXECUTE_READWRITE\" permissions, often used to dynamically unpack code."
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "Resolves API functions dynamically",
                  "match_data": [
                    "test.exe resolves 149 API functions by name.",
                    "123.exe resolves 50 API functions by name."
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "Overwrites code",
                  "match_data": [
                    "mscontainer.exe overwrites code to possibly hide behavior."
                  ]
                }
              ]
            },
            {
              "id": "T1036",
              "name": "Masquerading",
              "link": "https://attack.mitre.org/techniques/T1036/",
              "description": "Adversaries may attempt to manipulate features of their artifacts to make them appear legitimate or benign to users and/or security tools. Masquerading occurs when the name or location of an object, legitimate or malicious, is manipulated or abused for the sake of evading defenses and observation. This may include manipulating file metadata, tricking users into misidentifying the file type, and giving legitimate task or service names.\nRenaming abusable system utilities to evade security monitoring is also a form of Masquerading."
            },
            {
              "id": "T1036.001",
              "name": "Invalid Code Signature",
              "link": "https://attack.mitre.org/techniques/T1036/001/",
              "description": "Adversaries may attempt to mimic features of valid code signatures to increase the chance of deceiving a user, analyst, or tool. Code signing provides a level of authenticity on a binary from the developer and a guarantee that the binary has not been tampered with. Adversaries can copy the metadata and signature information from a signed program, then use it as a template for an unsigned program. Files with invalid code signatures will fail digital signature validation checks, but they may appear more legitimate to users and security tools may improperly handle these files.\nUnlike Code Signing, this activity will not result in a valid signature.",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Signed executable failed signature validation",
                  "match_data": [
                    "c:\\users\\oqxzraykm\\appdata\\roaming\\gxsetup.exe is signed, but signature validation failed.",
                    "C:\\Users\\OqXZRaykm\\Desktop\\JlsGsa8.exe is signed, but signature validation failed."
                  ]
                }
              ]
            },
            {
              "id": "T1055",
              "name": "Process Injection",
              "link": "https://attack.mitre.org/techniques/T1055/",
              "description": "Adversaries may inject code into processes in order to evade process-based defenses as well as possibly elevate privileges. Process injection is a method of executing arbitrary code in the address space of a separate live process. Running code in the context of another process may allow access to the process's memory, system/network resources, and possibly elevated privileges. Execution via process injection may also evade detection from security products since the execution is masked under a legitimate process. \nThere are many different ways to inject code into a process, many of which abuse legitimate functionalities. These implementations exist for every major OS but are typically platform specific. \nMore sophisticated samples may perform multiple process injections to segment modules and further evade detection, utilizing named pipes or other inter-process communication (IPC) mechanisms as a communication channel. ",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Modifies control flow of a process started from a created or modified executable",
                  "match_data": [
                    "jlsgsa8.exe alters context of (process #10) jlsgsa8.exe."
                  ]
                }
              ]
            },
            {
              "id": "T1134",
              "name": "Access Token Manipulation",
              "link": "https://attack.mitre.org/techniques/T1134/",
              "description": "Adversaries may modify access tokens to operate under a different user or system security context to perform actions and bypass access controls. Windows uses access tokens to determine the ownership of a running process. A user can manipulate access tokens to make a running process appear as though it is the child of a different process or belongs to someone other than the user that started the process. When this occurs, the process also takes on the security context associated with the new token.\nAn adversary can use built-in Windows API functions to copy access tokens from existing processes; this is known as token stealing. These token can then be applied to an existing process (i.e. Token Impersonation/Theft) or used to spawn a new process (i.e. Create Process with Token). An adversary must already be in a privileged user context (i.e. administrator) to steal a token. However, adversaries commonly use token stealing to elevate their security context from the administrator level to the SYSTEM level. An adversary can then use a token to authenticate to a remote system as the account for that token if the account has appropriate permissions on the remote system.\nAny standard user can use the runas command, and the Windows API functions, to create impersonation tokens; it does not require access to an administrator account. There are also other mechanisms, such as Active Directory fields, that can be used to modify access tokens.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Enables process privileges",
                  "match_data": [
                    "jlsgsa8.exe enables process privilege \"SeDebugPrivilege\".",
                    "mscontainer.exe enables process privilege \"SeDebugPrivilege\"."
                  ]
                }
              ]
            },
            {
              "id": "T1564",
              "name": "Hide Artifacts",
              "link": "https://attack.mitre.org/techniques/T1564/",
              "description": "Adversaries may attempt to hide artifacts associated with their behaviors to evade detection. Operating systems may have features to hide various artifacts, such as important system files and administrative task execution, to avoid disrupting user work environments and prevent users from changing files or features on the system. Adversaries may abuse these features to hide artifacts such as files, directories, user accounts, or other system activity to evade detection.\nAdversaries may also attempt to hide artifacts associated with malicious behavior by creating computing regions that are isolated from common security instrumentation, such as through the use of virtualization technology."
            },
            {
              "id": "T1564.003",
              "name": "Hidden Window",
              "link": "https://attack.mitre.org/techniques/T1564/003/",
              "description": "Adversaries may use hidden windows to conceal malicious activity from the plain sight of users. In some cases, windows that would typically be displayed when an application carries out an operation can be hidden. This may be utilized by system administrators to avoid disrupting user work environments when carrying out administrative tasks. \nAdversaries may abuse these functionalities to hide otherwise visible windows from users so as not to alert the user to adversary activity on the system.\nOn macOS, the configurations for how applications run are listed in property list (plist) files. One of the tags in these files can be apple.awt.UIElement, which allows for Java applications to prevent the application's icon from appearing in the Dock. A common use for this is when applications run in the system tray, but don't also want to show up in the Dock.\nSimilarly, on Windows there are a variety of features in scripting languages, such as PowerShell, Jscript, and Visual Basic to make windows hidden. One example of this is powershell.exe -WindowStyle Hidden.\nThe Windows Registry can also be edited to hide application windows from the current user. For example, by setting the WindowPosition subkey in the HKEY_CURRENT_USER\\Console\\%SystemRoot%_System32_WindowsPowerShell_v1.0_PowerShell.exe Registry key to a maximum value, PowerShell windows will open off screen and be hidden.\nIn addition, Windows supports the CreateDesktop() API that can create a hidden desktop window with its own corresponding explorer.exe process.  All applications running on the hidden desktop window, such as a hidden VNC (hVNC) session, will be invisible to other desktops windows.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Creates process with hidden window",
                  "match_data": [
                    "jlsgsa8.exe starts (process #5) schtasks.exe with a hidden window.",
                    "wscript.exe starts (process #13) cmd.exe with a hidden window."
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0002",
          "name": "Execution",
          "link": "https://attack.mitre.org/tactics/TA0002/",
          "description": "The adversary is trying to run malicious code.\n\nExecution consists of techniques that result in adversary-controlled code running on a local or remote system. Techniques that run malicious code are often paired with techniques from all other tactics to achieve broader goals, like exploring a network or stealing data. For example, an adversary might use a remote access tool to run a PowerShell script that does Remote System Discovery. ",
          "techniques": [
            {
              "id": "T1047",
              "name": "Windows Management Instrumentation",
              "link": "https://attack.mitre.org/techniques/T1047/",
              "description": "Adversaries may abuse Windows Management Instrumentation (WMI) to execute malicious commands and payloads. WMI is designed for programmers and is the infrastructure for management data and operations on Windows systems. WMI is an administration feature that provides a uniform environment to access Windows system components.\nThe WMI service enables both local and remote access, though the latter is facilitated by Remote Services such as Distributed Component Object Model and Windows Remote Management. Remote WMI over DCOM operates using port 135, whereas WMI over WinRM operates over port 5985 when using HTTP and 5986 for HTTPS. \nAn adversary can use WMI to interact with local and remote systems and use it as a means to execute various behaviors, such as gathering information for Discovery as well as Execution of commands and payloads. For example, wmic.exe can be abused by an adversary to delete shadow copies with the command wmic.exe Shadowcopy Delete (i.e., Inhibit System Recovery).\nNote: wmic.exe is deprecated as of January of 2024, with the WMIC feature being “disabled by default” on Windows 11+. WMIC will be removed from subsequent Windows releases and replaced by PowerShell as the primary WMI interface. In addition to PowerShell and tools like wbemtool.exe, COM APIs can also be used to programmatically interact with WMI via C++, .NET, VBScript, etc.",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Collects hardware properties",
                  "match_data": [
                    "test.exe queries hardware properties via WMI: Select Name from Win32_VideoController.",
                    "test.exe queries hardware properties via WMI: select Name from Win32_Processor.",
                    "test.exe queries hardware properties via WMI: select TotalPhysicalMemory from Win32_ComputerSystem."
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "Queries OS version via WMI",
                  "match_data": [
                    "test.exe queries OS version via WMI query: select * from Win32_OperatingSystem."
                  ]
                }
              ]
            },
            {
              "id": "T1129",
              "name": "Shared Modules",
              "link": "https://attack.mitre.org/techniques/T1129/",
              "description": "Adversaries may execute malicious payloads via loading shared modules. Shared modules are executable files that are loaded into processes to provide access to reusable code, such as specific custom functions or invoking OS API functions (i.e., Native API).\nAdversaries may use this functionality as a way to execute arbitrary payloads on a victim system. For example, adversaries can modularize functionality of their malware into shared objects that perform various functions such as managing C2 network communications or execution of specific actions on objective.\nThe Linux & macOS module loader can load and execute shared objects from arbitrary local paths. This functionality resides in dlfcn.h in functions such as dlopen and dlsym. Although macOS can execute .so files, common practice uses .dylib files.\nThe Windows module loader can be instructed to load DLLs from arbitrary local paths and arbitrary Universal Naming Convention (UNC) network paths. This functionality resides in NTDLL.dll and is part of the Windows Native API which is called from functions like LoadLibrary at run time.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Loads a dropped DLL",
                  "match_data": [
                    "mscontainer.exe loads dropped DLL mipmyoap.log."
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0004",
          "name": "Privilege Escalation",
          "link": "https://attack.mitre.org/tactics/TA0004/",
          "description": "The adversary is trying to gain higher-level permissions.\n\nPrivilege Escalation consists of techniques that adversaries use to gain higher-level permissions on a system or network. Adversaries can often enter and explore a network with unprivileged access but require elevated permissions to follow through on their objectives. Common approaches are to take advantage of system weaknesses, misconfigurations, and vulnerabilities. Examples of elevated access include: \n\n* SYSTEM/root level\n* local administrator\n* user account with admin-like access \n* user accounts with access to specific system or perform specific function\n\nThese techniques often overlap with Persistence techniques, as OS features that let an adversary persist can execute in an elevated context.  ",
          "techniques": [
            {
              "id": "T1055",
              "name": "Process Injection",
              "link": "https://attack.mitre.org/techniques/T1055/",
              "description": "Adversaries may inject code into processes in order to evade process-based defenses as well as possibly elevate privileges. Process injection is a method of executing arbitrary code in the address space of a separate live process. Running code in the context of another process may allow access to the process's memory, system/network resources, and possibly elevated privileges. Execution via process injection may also evade detection from security products since the execution is masked under a legitimate process. \nThere are many different ways to inject code into a process, many of which abuse legitimate functionalities. These implementations exist for every major OS but are typically platform specific. \nMore sophisticated samples may perform multiple process injections to segment modules and further evade detection, utilizing named pipes or other inter-process communication (IPC) mechanisms as a communication channel. ",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Modifies control flow of a process started from a created or modified executable",
                  "match_data": [
                    "jlsgsa8.exe alters context of (process #10) jlsgsa8.exe."
                  ]
                }
              ]
            },
            {
              "id": "T1134",
              "name": "Access Token Manipulation",
              "link": "https://attack.mitre.org/techniques/T1134/",
              "description": "Adversaries may modify access tokens to operate under a different user or system security context to perform actions and bypass access controls. Windows uses access tokens to determine the ownership of a running process. A user can manipulate access tokens to make a running process appear as though it is the child of a different process or belongs to someone other than the user that started the process. When this occurs, the process also takes on the security context associated with the new token.\nAn adversary can use built-in Windows API functions to copy access tokens from existing processes; this is known as token stealing. These token can then be applied to an existing process (i.e. Token Impersonation/Theft) or used to spawn a new process (i.e. Create Process with Token). An adversary must already be in a privileged user context (i.e. administrator) to steal a token. However, adversaries commonly use token stealing to elevate their security context from the administrator level to the SYSTEM level. An adversary can then use a token to authenticate to a remote system as the account for that token if the account has appropriate permissions on the remote system.\nAny standard user can use the runas command, and the Windows API functions, to create impersonation tokens; it does not require access to an administrator account. There are also other mechanisms, such as Active Directory fields, that can be used to modify access tokens.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Enables process privileges",
                  "match_data": [
                    "jlsgsa8.exe enables process privilege \"SeDebugPrivilege\".",
                    "mscontainer.exe enables process privilege \"SeDebugPrivilege\"."
                  ]
                }
              ]
            },
            {
              "id": "T1547",
              "name": "Boot or Logon Autostart Execution",
              "link": "https://attack.mitre.org/techniques/T1547/",
              "description": "Adversaries may configure system settings to automatically execute a program during system boot or logon to maintain persistence or gain higher-level privileges on compromised systems. Operating systems may have mechanisms for automatically running a program on system boot or account logon. These mechanisms may include automatically executing programs that are placed in specially designated directories or are referenced by repositories that store configuration information, such as the Windows Registry. An adversary may achieve the same goal by modifying or extending features of the kernel.\nSince some boot or logon autostart programs run with higher privileges, an adversary may leverage these to elevate privileges."
            },
            {
              "id": "T1547.001",
              "name": "Registry Run Keys / Startup Folder",
              "link": "https://attack.mitre.org/techniques/T1547/001/",
              "description": "Adversaries may achieve persistence by adding a program to a startup folder or referencing it with a Registry run key. Adding an entry to the \"run keys\" in the Registry or startup folder will cause the program referenced to be executed when a user logs in. These programs will be executed under the context of the user and will have the account's associated permissions level.\nThe following run keys are created by default on Windows systems:\n\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnce\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnce\n\nRun keys may exist under multiple hives. The HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnceEx is also available but is not created by default on Windows Vista and newer. Registry run key entries can reference programs directly or list them as a dependency. For example, it is possible to load a DLL at logon using a \"Depend\" key with RunOnceEx: reg add HKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\RunOnceEx\\0001\\Depend /v 1 /d \"C:\\temp\\evil[.]dll\" \nPlacing a program within a startup folder will also cause that program to execute when a user logs in. There is a startup folder location for individual user accounts as well as a system-wide startup folder that will be checked regardless of which user account logs in. The startup folder path for the current user is C:\\Users\\[Username]\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup. The startup folder path for all users is C:\\ProgramData\\Microsoft\\Windows\\Start Menu\\Programs\\StartUp.\nThe following Registry keys can be used to set startup folder items for persistence:\n\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell Folders\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Shell Folders\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Shell Folders\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell Folders\n\nThe following Registry keys can control automatic startup of services during boot:\n\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServicesOnce\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServicesOnce\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServices\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServices\n\nUsing policy settings to specify startup programs creates corresponding values in either of two Registry keys:\n\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer\\Run\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer\\Run\n\nPrograms listed in the load value of the registry key HKEY_CURRENT_USER\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Windows run automatically for the currently logged-on user.\nBy default, the multistring BootExecute value of the registry key HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\Session Manager is set to autocheck autochk *. This value causes Windows, at startup, to check the file-system integrity of the hard disks if the system has been shut down abnormally. Adversaries can add other programs or processes to this registry value which will automatically launch at boot.\nAdversaries can use these configuration locations to execute malware, such as remote access tools, to maintain persistence through system reboots. Adversaries may also use Masquerading to make the Registry entries look as if they are associated with legitimate programs.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Installs system startup script or application",
                  "match_data": [
                    "jlsgsa8.exe adds \"C:\\Users\\OqXZRaykm\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup\\gxsetup.vbs\" to Windows startup folder."
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0011",
          "name": "Command and Control",
          "link": "https://attack.mitre.org/tactics/TA0011/",
          "description": "The adversary is trying to communicate with compromised systems to control them.\n\nCommand and Control consists of techniques that adversaries may use to communicate with systems under their control within a victim network. Adversaries commonly attempt to mimic normal, expected traffic to avoid detection. There are many ways an adversary can establish command and control with various levels of stealth depending on the victim’s network structure and defenses.",
          "techniques": [
            {
              "id": "T1071",
              "name": "Application Layer Protocol",
              "link": "https://attack.mitre.org/techniques/T1071/",
              "description": "Adversaries may communicate using OSI application layer protocols to avoid detection/network filtering by blending in with existing traffic. Commands to the remote system, and often the results of those commands, will be embedded within the protocol traffic between the client and server. \nAdversaries may utilize many different protocols, including those used for web browsing, transferring files, electronic mail, DNS, or publishing/subscribing. For connections that occur internally within an enclave (such as those between a proxy or pivot node and other nodes), commonly used protocols are SMB, SSH, or RDP. "
            },
            {
              "id": "T1071.004",
              "name": "DNS",
              "link": "https://attack.mitre.org/techniques/T1071/004/",
              "description": "Adversaries may communicate using the Domain Name System (DNS) application layer protocol to avoid detection/network filtering by blending in with existing traffic. Commands to the remote system, and often the results of those commands, will be embedded within the protocol traffic between the client and server. \nThe DNS protocol serves an administrative function in computer networking and thus may be very common in environments. DNS traffic may also be allowed even before network authentication is completed. DNS packets contain many fields and headers in which data can be concealed. Often known as DNS tunneling, adversaries may abuse DNS to communicate with systems under their control within a victim network while also mimicking normal, expected traffic. ",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Performs DNS request",
                  "match_data": [
                    "test.exe resolves hostname \"dns.google\" to IP \"8.8.4.4\"."
                  ]
                }
              ]
            },
            {
              "id": "T1095",
              "name": "Non-Application Layer Protocol",
              "link": "https://attack.mitre.org/techniques/T1095/",
              "description": "Adversaries may use an OSI non-application layer protocol for communication between host and C2 server or among infected hosts within a network. The list of possible protocols is extensive. Specific examples include use of network layer protocols, such as the Internet Control Message Protocol (ICMP), transport layer protocols, such as the User Datagram Protocol (UDP), session layer protocols, such as Socket Secure (SOCKS), as well as redirected/tunneled protocols, such as Serial over LAN (SOL).\nICMP communication between hosts is one example. Because ICMP is part of the Internet Protocol Suite, it is required to be implemented by all IP-compatible hosts. However, it is not as commonly monitored as other Internet Protocols such as TCP or UDP and may be used by adversaries to hide communications.\nIn ESXi environments, adversaries may leverage the Virtual Machine Communication Interface (VMCI) for communication between guest virtual machines and the ESXi host. This traffic is similar to client-server communications on traditional network sockets but is localized to the physical machine running the ESXi host, meaning it does not traverse external networks (routers, switches). This results in communications that are invisible to external monitoring and standard networking tools like tcpdump, netstat, nmap, and Wireshark. By adding a VMCI backdoor to a compromised ESXi host, adversaries may persistently regain access from any guest VM to the compromised ESXi host’s backdoor, regardless of network segmentation or firewall rules in place.",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Sets up server that accepts incoming connections",
                  "match_data": [
                    "test.exe starts a TCP server listening on port 49719.",
                    "test.exe starts a TCP server listening on localhost port 49718.",
                    "test.exe starts a UDP server listening on port \"56366\".",
                    "test.exe starts a UDP server listening on port \"56365\".",
                    "test.exe starts a UDP server listening on port \"56364\".",
                    "test.exe starts a UDP server listening on port \"63418\"."
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0003",
          "name": "Persistence",
          "link": "https://attack.mitre.org/tactics/TA0003/",
          "description": "The adversary is trying to maintain their foothold.\n\nPersistence consists of techniques that adversaries use to keep access to systems across restarts, changed credentials, and other interruptions that could cut off their access. Techniques used for persistence include any access, action, or configuration changes that let them maintain their foothold on systems, such as replacing or hijacking legitimate code or adding startup code. ",
          "techniques": [
            {
              "id": "T1547",
              "name": "Boot or Logon Autostart Execution",
              "link": "https://attack.mitre.org/techniques/T1547/",
              "description": "Adversaries may configure system settings to automatically execute a program during system boot or logon to maintain persistence or gain higher-level privileges on compromised systems. Operating systems may have mechanisms for automatically running a program on system boot or account logon. These mechanisms may include automatically executing programs that are placed in specially designated directories or are referenced by repositories that store configuration information, such as the Windows Registry. An adversary may achieve the same goal by modifying or extending features of the kernel.\nSince some boot or logon autostart programs run with higher privileges, an adversary may leverage these to elevate privileges."
            },
            {
              "id": "T1547.001",
              "name": "Registry Run Keys / Startup Folder",
              "link": "https://attack.mitre.org/techniques/T1547/001/",
              "description": "Adversaries may achieve persistence by adding a program to a startup folder or referencing it with a Registry run key. Adding an entry to the \"run keys\" in the Registry or startup folder will cause the program referenced to be executed when a user logs in. These programs will be executed under the context of the user and will have the account's associated permissions level.\nThe following run keys are created by default on Windows systems:\n\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnce\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnce\n\nRun keys may exist under multiple hives. The HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnceEx is also available but is not created by default on Windows Vista and newer. Registry run key entries can reference programs directly or list them as a dependency. For example, it is possible to load a DLL at logon using a \"Depend\" key with RunOnceEx: reg add HKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\RunOnceEx\\0001\\Depend /v 1 /d \"C:\\temp\\evil[.]dll\" \nPlacing a program within a startup folder will also cause that program to execute when a user logs in. There is a startup folder location for individual user accounts as well as a system-wide startup folder that will be checked regardless of which user account logs in. The startup folder path for the current user is C:\\Users\\[Username]\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup. The startup folder path for all users is C:\\ProgramData\\Microsoft\\Windows\\Start Menu\\Programs\\StartUp.\nThe following Registry keys can be used to set startup folder items for persistence:\n\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell Folders\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Shell Folders\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Shell Folders\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell Folders\n\nThe following Registry keys can control automatic startup of services during boot:\n\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServicesOnce\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServicesOnce\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServices\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServices\n\nUsing policy settings to specify startup programs creates corresponding values in either of two Registry keys:\n\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer\\Run\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer\\Run\n\nPrograms listed in the load value of the registry key HKEY_CURRENT_USER\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Windows run automatically for the currently logged-on user.\nBy default, the multistring BootExecute value of the registry key HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\Session Manager is set to autocheck autochk *. This value causes Windows, at startup, to check the file-system integrity of the hard disks if the system has been shut down abnormally. Adversaries can add other programs or processes to this registry value which will automatically launch at boot.\nAdversaries can use these configuration locations to execute malware, such as remote access tools, to maintain persistence through system reboots. Adversaries may also use Masquerading to make the Registry entries look as if they are associated with legitimate programs.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Installs system startup script or application",
                  "match_data": [
                    "jlsgsa8.exe adds \"C:\\Users\\OqXZRaykm\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup\\gxsetup.vbs\" to Windows startup folder."
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0006",
          "name": "Credential Access",
          "link": "https://attack.mitre.org/tactics/TA0006/",
          "description": "The adversary is trying to steal account names and passwords.\n\nCredential Access consists of techniques for stealing credentials like account names and passwords. Techniques used to get credentials include keylogging or credential dumping. Using legitimate credentials can give adversaries access to systems, make them harder to detect, and provide the opportunity to create more accounts to help achieve their goals.",
          "techniques": [
            {
              "id": "T1552",
              "name": "Unsecured Credentials",
              "link": "https://attack.mitre.org/techniques/T1552/",
              "description": "Adversaries may search compromised systems to find and obtain insecurely stored credentials. These credentials can be stored and/or misplaced in many locations on a system, including plaintext files (e.g. Bash History), operating system or application-specific repositories (e.g. Credentials in Registry),  or other specialized files/artifacts (e.g. Private Keys)."
            },
            {
              "id": "T1552.001",
              "name": "Credentials In Files",
              "link": "https://attack.mitre.org/techniques/T1552/001/",
              "description": "Adversaries may search local file systems and remote file shares for files containing insecurely stored credentials. These can be files created by users to store their own credentials, shared credential stores for a group of individuals, configuration files containing passwords for a system or service, or source code/binary files containing embedded passwords.\nIt is possible to extract passwords from backups or saved virtual machines through OS Credential Dumping. Passwords may also be obtained from Group Policy Preferences stored on the Windows Domain Controller.\nIn cloud and/or containerized environments, authenticated user and service account credentials are often stored in local configuration and credential files. They may also be found as parameters to deployment commands in container logs. In some cases, these files can be copied and reused on another machine or the contents can be read and then used to authenticate without needing to copy any files.",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Searches for sensitive browser data",
                  "match_data": [
                    "test.exe searches for sensitive data of web browser \"Opera\" by file.",
                    "test.exe searches for sensitive data of web browser \"Chrome Canary\" by file.",
                    "test.exe searches for sensitive data of web browser \"Maple Studio\" by file.",
                    "test.exe searches for sensitive data of web browser \"Amigo\" by file.",
                    "test.exe searches for sensitive data of web browser \"Torch\" by file.",
                    "test.exe searches for sensitive data of web browser \"Orbitum\" by file.",
                    "test.exe searches for sensitive data of web browser \"Chromium\" by file.",
                    "test.exe searches for sensitive data of web browser \"Uran\" by file.",
                    "test.exe searches for sensitive data of web browser \"Sputnik\" by file.",
                    "test.exe searches for sensitive data of web browser \"Internet Explorer / Edge\" by file."
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "Reads sensitive browser data",
                  "match_data": [
                    "test.exe tries to read sensitive data of web browser \"Internet Explorer / Edge\" by file."
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    "Yomi Hunter": {
      "tactics": [
        {
          "id": "TA0002",
          "name": "Execution",
          "link": "https://attack.mitre.org/tactics/TA0002/",
          "description": "The adversary is trying to run malicious code.\n\nExecution consists of techniques that result in adversary-controlled code running on a local or remote system. Techniques that run malicious code are often paired with techniques from all other tactics to achieve broader goals, like exploring a network or stealing data. For example, an adversary might use a remote access tool to run a PowerShell script that does Remote System Discovery. ",
          "techniques": [
            {
              "id": "T1059",
              "name": "Command and Scripting Interpreter",
              "link": "https://attack.mitre.org/techniques/T1059/",
              "description": "Adversaries may abuse command and script interpreters to execute commands, scripts, or binaries. These interfaces and languages provide ways of interacting with computer systems and are a common feature across many different platforms. Most systems come with some built-in command-line interface and scripting capabilities, for example, macOS and Linux distributions include some flavor of Unix Shell while Windows installations include the Windows Command Shell and PowerShell.\nThere are also cross-platform interpreters such as Python, as well as those commonly associated with client applications such as JavaScript and Visual Basic.\nAdversaries may abuse these technologies in various ways as a means of executing arbitrary commands. Commands and scripts can be embedded in Initial Access payloads delivered to victims as lure documents or as secondary payloads downloaded from an existing C2. Adversaries may also execute commands through interactive terminals/shells, as well as utilize various Remote Services in order to achieve remote Execution.",
              "signatures": [
                {
                  "severity": "UNKNOWN",
                  "description": "Detected command line output monitoring"
                }
              ]
            },
            {
              "id": "T1129",
              "name": "Shared Modules",
              "link": "https://attack.mitre.org/techniques/T1129/",
              "description": "Adversaries may execute malicious payloads via loading shared modules. Shared modules are executable files that are loaded into processes to provide access to reusable code, such as specific custom functions or invoking OS API functions (i.e., Native API).\nAdversaries may use this functionality as a way to execute arbitrary payloads on a victim system. For example, adversaries can modularize functionality of their malware into shared objects that perform various functions such as managing C2 network communications or execution of specific actions on objective.\nThe Linux & macOS module loader can load and execute shared objects from arbitrary local paths. This functionality resides in dlfcn.h in functions such as dlopen and dlsym. Although macOS can execute .so files, common practice uses .dylib files.\nThe Windows module loader can be instructed to load DLLs from arbitrary local paths and arbitrary Universal Naming Convention (UNC) network paths. This functionality resides in NTDLL.dll and is part of the Windows Native API which is called from functions like LoadLibrary at run time.",
              "signatures": [
                {
                  "severity": "UNKNOWN",
                  "description": "The process attempted to dynamically load a malicious function"
                },
                {
                  "severity": "UNKNOWN",
                  "description": "The process tried to load dynamically one or more functions."
                },
                {
                  "severity": "UNKNOWN",
                  "description": "link function at runtime on Linux"
                }
              ]
            },
            {
              "id": "T1569",
              "name": "System Services",
              "link": "https://attack.mitre.org/techniques/T1569/",
              "description": "Adversaries may abuse system services or daemons to execute commands or programs. Adversaries can execute malicious content by interacting with or creating services either locally or remotely. Many services are set to run at boot, which can aid in achieving persistence (Create or Modify System Process), but adversaries can also abuse services for one-time or temporary execution."
            },
            {
              "id": "T1569.002",
              "name": "Service Execution",
              "link": "https://attack.mitre.org/techniques/T1569/002/",
              "description": "Adversaries may abuse the Windows service control manager to execute malicious commands or payloads. The Windows service control manager (services.exe) is an interface to manage and manipulate services. The service control manager is accessible to users via GUI components as well as system utilities such as sc.exe and Net.\nPsExec can also be used to execute commands or payloads via a temporary Windows service created through the service control manager API. Tools such as PsExec and sc.exe can accept remote servers as arguments and may be used to conduct remote execution.\nAdversaries may leverage these mechanisms to execute malicious content. This can be done by either executing a new or modified service. This technique is the execution used in conjunction with Windows Service during service persistence or privilege escalation.",
              "signatures": [
                {
                  "severity": "UNKNOWN",
                  "description": "interact with driver via control codes"
                }
              ]
            },
            {
              "id": "T1053",
              "name": "Scheduled Task/Job",
              "link": "https://attack.mitre.org/techniques/T1053/",
              "description": "Adversaries may abuse task scheduling functionality to facilitate initial or recurring execution of malicious code. Utilities exist within all major operating systems to schedule programs or scripts to be executed at a specified date and time. A task can also be scheduled on a remote system, provided the proper authentication is met (ex: RPC and file and printer sharing in Windows environments). Scheduling a task on a remote system typically may require being a member of an admin or otherwise privileged group on the remote system.\nAdversaries may use task scheduling to execute programs at system startup or on a scheduled basis for persistence. These mechanisms can also be abused to run a process under the context of a specified account (such as one with elevated permissions/privileges). Similar to System Binary Proxy Execution, adversaries have also abused task scheduling to potentially mask one-time execution under a trusted system process.",
              "signatures": [
                {
                  "severity": "UNKNOWN",
                  "description": "It creates a system task"
                }
              ]
            }
          ]
        },
        {
          "id": "TA0003",
          "name": "Persistence",
          "link": "https://attack.mitre.org/tactics/TA0003/",
          "description": "The adversary is trying to maintain their foothold.\n\nPersistence consists of techniques that adversaries use to keep access to systems across restarts, changed credentials, and other interruptions that could cut off their access. Techniques used for persistence include any access, action, or configuration changes that let them maintain their foothold on systems, such as replacing or hijacking legitimate code or adding startup code. ",
          "techniques": [
            {
              "id": "T1198",
              "name": "SIP and Trust Provider Hijacking",
              "link": "https://attack.mitre.org/techniques/T1198/",
              "description": "In user mode, Windows Authenticode  digital signatures are used to verify a file's origin and integrity, variables that may be used to establish trust in signed code (ex: a driver with a valid Microsoft signature may be handled as safe). The signature validation process is handled via the WinVerifyTrust application programming interface (API) function,   which accepts an inquiry and coordinates with the appropriate trust provider, which is responsible for validating parameters of a signature. \nBecause of the varying executable file types and corresponding signature formats, Microsoft created software components called Subject Interface Packages (SIPs)  to provide a layer of abstraction between API functions and files. SIPs are responsible for enabling API functions to create, retrieve, calculate, and verify signatures. Unique SIPs exist for most file formats (Executable, PowerShell, Installer, etc., with catalog signing providing a catch-all  ) and are identified by globally unique identifiers (GUIDs). \nSimilar to Code Signing, adversaries may abuse this architecture to subvert trust controls and bypass security policies that allow only legitimately signed code to execute on a system. Adversaries may hijack SIP and trust provider components to mislead operating system and whitelisting tools to classify malicious (or any) code as signed by: \n\nModifying the Dll and FuncName Registry values in HKLM\\SOFTWARE[\\WOW6432Node]Microsoft\\Cryptography\\OID\\EncodingType 0\\CryptSIPDllGetSignedDataMsg{SIP_GUID} that point to the dynamic link library (DLL) providing a SIP’s CryptSIPDllGetSignedDataMsg function, which retrieves an encoded digital certificate from a signed file. By pointing to a maliciously-crafted DLL with an exported function that always returns a known good signature value (ex: a Microsoft signature for Portable Executables) rather than the file’s real signature, an adversary can apply an acceptable signature value to all files using that SIP  (although a hash mismatch will likely occur, invalidating the signature, since the hash returned by the function will not match the value computed from the file).\nModifying the Dll and FuncName Registry values in HKLM\\SOFTWARE[WOW6432Node]Microsoft\\Cryptography\\OID\\EncodingType 0\\CryptSIPDllVerifyIndirectData{SIP_GUID} that point to the DLL providing a SIP’s CryptSIPDllVerifyIndirectData function, which validates a file’s computed hash against the signed hash value. By pointing to a maliciously-crafted DLL with an exported function that always returns TRUE (indicating that the validation was successful), an adversary can successfully validate any file (with a legitimate signature) using that SIP  (with or without hijacking the previously mentioned CryptSIPDllGetSignedDataMsg function). This Registry value could also be redirected to a suitable exported function from an already present DLL, avoiding the requirement to drop and execute a new file on disk.\nModifying the DLL and Function Registry values in HKLM\\SOFTWARE[WOW6432Node]Microsoft\\Cryptography\\Providers\\Trust\\FinalPolicy{trust provider GUID} that point to the DLL providing a trust provider’s FinalPolicy function, which is where the decoded and parsed signature is checked and the majority of trust decisions are made. Similar to hijacking SIP’s CryptSIPDllVerifyIndirectData function, this value can be redirected to a suitable exported function from an already present DLL or a maliciously-crafted DLL (though the implementation of a trust provider is complex).\nNote: The above hijacks are also possible without modifying the Registry via DLL Search Order Hijacking.\n\nHijacking SIP or trust provider components can also enable persistent code execution, since these malicious components may be invoked by any application that performs code signing or signature validation. ",
              "signatures": [
                {
                  "severity": "UNKNOWN",
                  "description": "The binary has an Authenticode signature"
                },
                {
                  "severity": "UNKNOWN",
                  "description": "The file have a Trusted Certificate"
                }
              ]
            },
            {
              "id": "T1060",
              "name": "Registry Run Keys / Startup Folder",
              "link": "https://attack.mitre.org/techniques/T1060/",
              "description": "Adversaries may achieve persistence by adding a program to a startup folder or referencing it with a Registry run key. Adding an entry to the \"run keys\" in the Registry or startup folder will cause the program referenced to be executed when a user logs in.  These programs will be executed under the context of the user and will have the account's associated permissions level.\nPlacing a program within a startup folder will cause that program to execute when a user logs in. There is a startup folder location for individual user accounts as well as a system-wide startup folder that will be checked regardless of which user account logs in.\nThe startup folder path for the current user is:\n* C:\\Users[Username]\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup\nThe startup folder path for all users is:\n* C:\\ProgramData\\Microsoft\\Windows\\Start Menu\\Programs\\StartUp\nThe following run keys are created by default on Windows systems:\n* HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\n* HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnce\n* HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\n* HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnce\nThe HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnceEx is also available but is not created by default on Windows Vista and newer. Registry run key entries can reference programs directly or list them as a dependency.  For example, it is possible to load a DLL at logon using a \"Depend\" key with RunOnceEx: reg add HKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\RunOnceEx\\0001\\Depend /v 1 /d \"C:\\temp\\evil[.]dll\" \nThe following Registry keys can be used to set startup folder items for persistence:\n* HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell Folders\n* HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Shell Folders\n* HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Shell Folders\n* HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell Folders\nThe following Registry keys can control automatic startup of services during boot:\n* HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServicesOnce\n* HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServicesOnce\n* HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServices\n* HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServices\nUsing policy settings to specify startup programs creates corresponding values in either of two Registry keys:\n* HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer\\Run\n* HKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer\\Run\nThe Winlogon key controls actions that occur when a user logs on to a computer running Windows 7. Most of these actions are under the control of the operating system, but you can also add custom actions here. The HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon\\Userinit and HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Winlogon\\Shell subkeys can automatically launch programs.\nPrograms listed in the load value of the registry key HKEY_CURRENT_USER\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Windows run when any user logs on.\nBy default, the multistring BootExecute value of the registry key HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\Session Manager is set to autocheck autochk *. This value causes Windows, at startup, to check the file-system integrity of the hard disks if the system has been shut down abnormally. Adversaries can add other programs or processes to this registry value which will automatically launch at boot.\nAdversaries can use these configuration locations to execute malware, such as remote access tools, to maintain persistence through system reboots. Adversaries may also use Masquerading to make the Registry entries look as if they are associated with legitimate programs.",
              "signatures": [
                {
                  "severity": "UNKNOWN",
                  "description": "The process has tried to set its autorun on the system startup"
                }
              ]
            },
            {
              "id": "T1050",
              "name": "New Service",
              "link": "https://attack.mitre.org/techniques/T1050/",
              "description": "When operating systems boot up, they can start programs or applications called services that perform background system functions.  A service's configuration information, including the file path to the service's executable, is stored in the Windows Registry. \nAdversaries may install a new service that can be configured to execute at startup by using utilities to interact with services or by directly modifying the Registry. The service name may be disguised by using a name from a related operating system or benign software with Masquerading. Services may be created with administrator privileges but are executed under SYSTEM privileges, so an adversary may also use a service to escalate privileges from administrator to SYSTEM. Adversaries may also directly start services through Service Execution.",
              "signatures": [
                {
                  "severity": "UNKNOWN",
                  "description": "The process has tried to set its autorun on the system startup"
                }
              ]
            },
            {
              "id": "T1112",
              "name": "Modify Registry",
              "link": "https://attack.mitre.org/techniques/T1112/",
              "description": "Adversaries may interact with the Windows Registry as part of a variety of other techniques to aid in defense evasion, persistence, and execution.\nAccess to specific areas of the Registry depends on account permissions, with some keys requiring administrator-level access. The built-in Windows command-line utility Reg may be used for local or remote Registry modification. Other tools, such as remote access tools, may also contain functionality to interact with the Registry through the Windows API.\nThe Registry may be modified in order to hide configuration information or malicious payloads via Obfuscated Files or Information. The Registry may also be modified to Impair Defenses, such as by enabling macros for all Microsoft Office products, allowing privilege escalation without alerting the user, increasing the maximum number of allowed outbound requests, and/or modifying systems to store plaintext credentials in memory.\nThe Registry of a remote system may be modified to aid in execution of files as part of lateral movement. It requires the remote Registry service to be running on the target system. Often Valid Accounts are required, along with access to the remote system's SMB/Windows Admin Shares for RPC communication.\nFinally, Registry modifications may also include actions to hide keys, such as prepending key names with a null character, which will cause an error and/or be ignored when read via Reg or other utilities using the Win32 API. Adversaries may abuse these pseudo-hidden keys to conceal payloads/commands used to maintain persistence.",
              "signatures": [
                {
                  "severity": "UNKNOWN",
                  "description": "The process has tried to set its autorun on the system startup"
                }
              ]
            },
            {
              "id": "T1053",
              "name": "Scheduled Task/Job",
              "link": "https://attack.mitre.org/techniques/T1053/",
              "description": "Adversaries may abuse task scheduling functionality to facilitate initial or recurring execution of malicious code. Utilities exist within all major operating systems to schedule programs or scripts to be executed at a specified date and time. A task can also be scheduled on a remote system, provided the proper authentication is met (ex: RPC and file and printer sharing in Windows environments). Scheduling a task on a remote system typically may require being a member of an admin or otherwise privileged group on the remote system.\nAdversaries may use task scheduling to execute programs at system startup or on a scheduled basis for persistence. These mechanisms can also be abused to run a process under the context of a specified account (such as one with elevated permissions/privileges). Similar to System Binary Proxy Execution, adversaries have also abused task scheduling to potentially mask one-time execution under a trusted system process.",
              "signatures": [
                {
                  "severity": "UNKNOWN",
                  "description": "It creates a system task"
                }
              ]
            }
          ]
        },
        {
          "id": "TA0005",
          "name": "Defense Evasion",
          "link": "https://attack.mitre.org/tactics/TA0005/",
          "description": "The adversary is trying to avoid being detected.\n\nDefense Evasion consists of techniques that adversaries use to avoid detection throughout their compromise. Techniques used for defense evasion include uninstalling/disabling security software or obfuscating/encrypting data and scripts. Adversaries also leverage and abuse trusted processes to hide and masquerade their malware. Other tactics’ techniques are cross-listed here when those techniques include the added benefit of subverting defenses. ",
          "techniques": [
            {
              "id": "T1198",
              "name": "SIP and Trust Provider Hijacking",
              "link": "https://attack.mitre.org/techniques/T1198/",
              "description": "In user mode, Windows Authenticode  digital signatures are used to verify a file's origin and integrity, variables that may be used to establish trust in signed code (ex: a driver with a valid Microsoft signature may be handled as safe). The signature validation process is handled via the WinVerifyTrust application programming interface (API) function,   which accepts an inquiry and coordinates with the appropriate trust provider, which is responsible for validating parameters of a signature. \nBecause of the varying executable file types and corresponding signature formats, Microsoft created software components called Subject Interface Packages (SIPs)  to provide a layer of abstraction between API functions and files. SIPs are responsible for enabling API functions to create, retrieve, calculate, and verify signatures. Unique SIPs exist for most file formats (Executable, PowerShell, Installer, etc., with catalog signing providing a catch-all  ) and are identified by globally unique identifiers (GUIDs). \nSimilar to Code Signing, adversaries may abuse this architecture to subvert trust controls and bypass security policies that allow only legitimately signed code to execute on a system. Adversaries may hijack SIP and trust provider components to mislead operating system and whitelisting tools to classify malicious (or any) code as signed by: \n\nModifying the Dll and FuncName Registry values in HKLM\\SOFTWARE[\\WOW6432Node]Microsoft\\Cryptography\\OID\\EncodingType 0\\CryptSIPDllGetSignedDataMsg{SIP_GUID} that point to the dynamic link library (DLL) providing a SIP’s CryptSIPDllGetSignedDataMsg function, which retrieves an encoded digital certificate from a signed file. By pointing to a maliciously-crafted DLL with an exported function that always returns a known good signature value (ex: a Microsoft signature for Portable Executables) rather than the file’s real signature, an adversary can apply an acceptable signature value to all files using that SIP  (although a hash mismatch will likely occur, invalidating the signature, since the hash returned by the function will not match the value computed from the file).\nModifying the Dll and FuncName Registry values in HKLM\\SOFTWARE[WOW6432Node]Microsoft\\Cryptography\\OID\\EncodingType 0\\CryptSIPDllVerifyIndirectData{SIP_GUID} that point to the DLL providing a SIP’s CryptSIPDllVerifyIndirectData function, which validates a file’s computed hash against the signed hash value. By pointing to a maliciously-crafted DLL with an exported function that always returns TRUE (indicating that the validation was successful), an adversary can successfully validate any file (with a legitimate signature) using that SIP  (with or without hijacking the previously mentioned CryptSIPDllGetSignedDataMsg function). This Registry value could also be redirected to a suitable exported function from an already present DLL, avoiding the requirement to drop and execute a new file on disk.\nModifying the DLL and Function Registry values in HKLM\\SOFTWARE[WOW6432Node]Microsoft\\Cryptography\\Providers\\Trust\\FinalPolicy{trust provider GUID} that point to the DLL providing a trust provider’s FinalPolicy function, which is where the decoded and parsed signature is checked and the majority of trust decisions are made. Similar to hijacking SIP’s CryptSIPDllVerifyIndirectData function, this value can be redirected to a suitable exported function from an already present DLL or a maliciously-crafted DLL (though the implementation of a trust provider is complex).\nNote: The above hijacks are also possible without modifying the Registry via DLL Search Order Hijacking.\n\nHijacking SIP or trust provider components can also enable persistent code execution, since these malicious components may be invoked by any application that performs code signing or signature validation. ",
              "signatures": [
                {
                  "severity": "UNKNOWN",
                  "description": "The binary has an Authenticode signature"
                },
                {
                  "severity": "UNKNOWN",
                  "description": "The file have a Trusted Certificate"
                }
              ]
            },
            {
              "id": "T1564",
              "name": "Hide Artifacts",
              "link": "https://attack.mitre.org/techniques/T1564/",
              "description": "Adversaries may attempt to hide artifacts associated with their behaviors to evade detection. Operating systems may have features to hide various artifacts, such as important system files and administrative task execution, to avoid disrupting user work environments and prevent users from changing files or features on the system. Adversaries may abuse these features to hide artifacts such as files, directories, user accounts, or other system activity to evade detection.\nAdversaries may also attempt to hide artifacts associated with malicious behavior by creating computing regions that are isolated from common security instrumentation, such as through the use of virtualization technology."
            },
            {
              "id": "T1564.003",
              "name": "Hidden Window",
              "link": "https://attack.mitre.org/techniques/T1564/003/",
              "description": "Adversaries may use hidden windows to conceal malicious activity from the plain sight of users. In some cases, windows that would typically be displayed when an application carries out an operation can be hidden. This may be utilized by system administrators to avoid disrupting user work environments when carrying out administrative tasks. \nAdversaries may abuse these functionalities to hide otherwise visible windows from users so as not to alert the user to adversary activity on the system.\nOn macOS, the configurations for how applications run are listed in property list (plist) files. One of the tags in these files can be apple.awt.UIElement, which allows for Java applications to prevent the application's icon from appearing in the Dock. A common use for this is when applications run in the system tray, but don't also want to show up in the Dock.\nSimilarly, on Windows there are a variety of features in scripting languages, such as PowerShell, Jscript, and Visual Basic to make windows hidden. One example of this is powershell.exe -WindowStyle Hidden.\nThe Windows Registry can also be edited to hide application windows from the current user. For example, by setting the WindowPosition subkey in the HKEY_CURRENT_USER\\Console\\%SystemRoot%_System32_WindowsPowerShell_v1.0_PowerShell.exe Registry key to a maximum value, PowerShell windows will open off screen and be hidden.\nIn addition, Windows supports the CreateDesktop() API that can create a hidden desktop window with its own corresponding explorer.exe process.  All applications running on the hidden desktop window, such as a hidden VNC (hVNC) session, will be invisible to other desktops windows.",
              "signatures": [
                {
                  "severity": "UNKNOWN",
                  "description": "Detected the creation of a hidden window (common execution hiding technique)"
                }
              ]
            },
            {
              "id": "T1140",
              "name": "Deobfuscate/Decode Files or Information",
              "link": "https://attack.mitre.org/techniques/T1140/",
              "description": "Adversaries may use Obfuscated Files or Information to hide artifacts of an intrusion from analysis. They may require separate mechanisms to decode or deobfuscate that information depending on how they intend to use it. Methods for doing that include built-in functionality of malware or by using utilities present on the system.\nOne such example is the use of certutil to decode a remote access tool portable executable file that has been hidden inside a certificate file. Another example is using the Windows copy /b or type command to reassemble binary fragments into a malicious payload.\nSometimes a user's action may be required to open it for deobfuscation or decryption as part of User Execution. The user may also be required to input a password to open a password protected compressed/encrypted file that was provided by the adversary.",
              "signatures": [
                {
                  "severity": "UNKNOWN",
                  "description": "Detected an attempt to pull out some data from the binary image"
                },
                {
                  "severity": "UNKNOWN",
                  "description": "decode data using Base64 in .NET"
                }
              ]
            },
            {
              "id": "T1027",
              "name": "Obfuscated Files or Information",
              "link": "https://attack.mitre.org/techniques/T1027/",
              "description": "Adversaries may attempt to make an executable or file difficult to discover or analyze by encrypting, encoding, or otherwise obfuscating its contents on the system or in transit. This is common behavior that can be used across different platforms and the network to evade defenses. \nPayloads may be compressed, archived, or encrypted in order to avoid detection. These payloads may be used during Initial Access or later to mitigate detection. Sometimes a user's action may be required to open and Deobfuscate/Decode Files or Information for User Execution. The user may also be required to input a password to open a password protected compressed/encrypted file that was provided by the adversary.  Adversaries may also use compressed or archived scripts, such as JavaScript. \nPortions of files can also be encoded to hide the plain-text strings that would otherwise help defenders with discovery.  Payloads may also be split into separate, seemingly benign files that only reveal malicious functionality when reassembled. \nAdversaries may also abuse Command Obfuscation to obscure commands executed from payloads or directly via Command and Scripting Interpreter. Environment variables, aliases, characters, and other platform/language specific semantics can be used to evade signature based detections and application control mechanisms.   ",
              "signatures": [
                {
                  "severity": "UNKNOWN",
                  "description": "encode data using Base64"
                }
              ]
            },
            {
              "id": "T1027.009",
              "name": "Embedded Payloads",
              "link": "https://attack.mitre.org/techniques/T1027/009/",
              "description": "Adversaries may embed payloads within other files to conceal malicious content from defenses. Otherwise seemingly benign files (such as scripts and executables) may be abused to carry and obfuscate malicious payloads and content. In some cases, embedded payloads may also enable adversaries to Subvert Trust Controls by not impacting execution controls such as digital signatures and notarization tickets. \nAdversaries may embed payloads in various file formats to hide payloads. This is similar to Steganography, though does not involve weaving malicious content into specific bytes and patterns related to legitimate digital media formats. \nFor example, adversaries have been observed embedding payloads within or as an overlay of an otherwise benign binary. Adversaries have also been observed nesting payloads (such as executables and run-only scripts) inside a file of the same format. \nEmbedded content may also be used as Process Injection payloads used to infect benign system processes. These embedded then injected payloads may be used as part of the modules of malware designed to provide specific features such as encrypting C2 communications in support of an orchestrator module. For example, an embedded module may be injected into default browsers, allowing adversaries to then communicate via the network.",
              "signatures": [
                {
                  "severity": "UNKNOWN",
                  "description": "The process has executed a dropped binary"
                },
                {
                  "severity": "UNKNOWN",
                  "description": "Drops interesting files and uses them"
                }
              ]
            },
            {
              "id": "T1620",
              "name": "Reflective Code Loading",
              "link": "https://attack.mitre.org/techniques/T1620/",
              "description": "Adversaries may reflectively load code into a process in order to conceal the execution of malicious payloads. Reflective loading involves allocating then executing payloads directly within the memory of the process, vice creating a thread or process backed by a file path on disk (e.g., Shared Modules).\nReflectively loaded payloads may be compiled binaries, anonymous files (only present in RAM), or just snubs of fileless executable code (ex: position-independent shellcode). For example, the Assembly.Load() method executed by PowerShell may be abused to load raw code into the running process.\nReflective code injection is very similar to Process Injection except that the “injection” loads code into the processes’ own memory instead of that of a separate process. Reflective loading may evade process-based detections since the execution of the arbitrary code may be masked within a legitimate or otherwise benign process. Reflectively loading payloads directly into memory may also avoid creating files or other artifacts on disk, while also enabling malware to keep these payloads encrypted (or otherwise obfuscated) until execution.",
              "signatures": [
                {
                  "severity": "UNKNOWN",
                  "description": "load .NET assembly"
                }
              ]
            },
            {
              "id": "T1089",
              "name": "Disabling Security Tools",
              "link": "https://attack.mitre.org/techniques/T1089/",
              "description": "Adversaries may disable security tools to avoid possible detection of their tools and activities. This can take the form of killing security software or event logging processes, deleting Registry keys so that tools do not start at run time, or other methods to interfere with security scanning or event reporting.",
              "signatures": [
                {
                  "severity": "UNKNOWN",
                  "description": "The process has tried to suspend a sandbox-related thread (possible sandbox evasion attempt)"
                }
              ]
            },
            {
              "id": "T1055",
              "name": "Process Injection",
              "link": "https://attack.mitre.org/techniques/T1055/",
              "description": "Adversaries may inject code into processes in order to evade process-based defenses as well as possibly elevate privileges. Process injection is a method of executing arbitrary code in the address space of a separate live process. Running code in the context of another process may allow access to the process's memory, system/network resources, and possibly elevated privileges. Execution via process injection may also evade detection from security products since the execution is masked under a legitimate process. \nThere are many different ways to inject code into a process, many of which abuse legitimate functionalities. These implementations exist for every major OS but are typically platform specific. \nMore sophisticated samples may perform multiple process injections to segment modules and further evade detection, utilizing named pipes or other inter-process communication (IPC) mechanisms as a communication channel. ",
              "signatures": [
                {
                  "severity": "UNKNOWN",
                  "description": "Likely PROPagate Technique is running"
                }
              ]
            },
            {
              "id": "T1096",
              "name": "NTFS File Attributes",
              "link": "https://attack.mitre.org/techniques/T1096/",
              "description": "Every New Technology File System (NTFS) formatted partition contains a Master File Table (MFT) that maintains a record for every file/directory on the partition.  Within MFT entries are file attributes,  such as Extended Attributes (EA) and Data [known as Alternate Data Streams (ADSs) when more than one Data attribute is present], that can be used to store arbitrary data (and even complete files).    \nAdversaries may store malicious data or binaries in file attribute metadata instead of directly in files. This may be done to evade some defenses, such as static indicator scanning tools and anti-virus.  ",
              "signatures": [
                {
                  "severity": "UNKNOWN",
                  "description": "Detected an attemp to access an Alternate Data Stream (ADS)"
                }
              ]
            },
            {
              "id": "T1112",
              "name": "Modify Registry",
              "link": "https://attack.mitre.org/techniques/T1112/",
              "description": "Adversaries may interact with the Windows Registry as part of a variety of other techniques to aid in defense evasion, persistence, and execution.\nAccess to specific areas of the Registry depends on account permissions, with some keys requiring administrator-level access. The built-in Windows command-line utility Reg may be used for local or remote Registry modification. Other tools, such as remote access tools, may also contain functionality to interact with the Registry through the Windows API.\nThe Registry may be modified in order to hide configuration information or malicious payloads via Obfuscated Files or Information. The Registry may also be modified to Impair Defenses, such as by enabling macros for all Microsoft Office products, allowing privilege escalation without alerting the user, increasing the maximum number of allowed outbound requests, and/or modifying systems to store plaintext credentials in memory.\nThe Registry of a remote system may be modified to aid in execution of files as part of lateral movement. It requires the remote Registry service to be running on the target system. Often Valid Accounts are required, along with access to the remote system's SMB/Windows Admin Shares for RPC communication.\nFinally, Registry modifications may also include actions to hide keys, such as prepending key names with a null character, which will cause an error and/or be ignored when read via Reg or other utilities using the Win32 API. Adversaries may abuse these pseudo-hidden keys to conceal payloads/commands used to maintain persistence.",
              "signatures": [
                {
                  "severity": "UNKNOWN",
                  "description": "The process has tried to set its autorun on the system startup"
                }
              ]
            }
          ]
        },
        {
          "id": "TA0007",
          "name": "Discovery",
          "link": "https://attack.mitre.org/tactics/TA0007/",
          "description": "The adversary is trying to figure out your environment.\n\nDiscovery consists of techniques an adversary may use to gain knowledge about the system and internal network. These techniques help adversaries observe the environment and orient themselves before deciding how to act. They also allow adversaries to explore what they can control and what’s around their entry point in order to discover how it could benefit their current objective. Native operating system tools are often used toward this post-compromise information-gathering objective. ",
          "techniques": [
            {
              "id": "T1057",
              "name": "Process Discovery",
              "link": "https://attack.mitre.org/techniques/T1057/",
              "description": "Adversaries may attempt to get information about running processes on a system. Information obtained could be used to gain an understanding of common software/applications running on systems within the network. Administrator or otherwise elevated access may provide better process details. Adversaries may use the information from Process Discovery during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\nIn Windows environments, adversaries could obtain details on running processes using the Tasklist utility via cmd or Get-Process via PowerShell. Information about processes can also be extracted from the output of Native API calls such as CreateToolhelp32Snapshot. In Mac and Linux, this is accomplished with the ps command. Adversaries may also opt to enumerate processes via /proc. ESXi also supports use of the ps command, as well as esxcli system process list.\nOn network devices, Network Device CLI commands such as show processes can be used to display current running processes.",
              "signatures": [
                {
                  "severity": "UNKNOWN",
                  "description": "The process has tried to detect the debugger probing the use of page guards."
                },
                {
                  "severity": "UNKNOWN",
                  "description": "The process attempted to detect a running debugger using common APIs"
                }
              ]
            },
            {
              "id": "T1082",
              "name": "System Information Discovery",
              "link": "https://attack.mitre.org/techniques/T1082/",
              "description": "An adversary may attempt to get detailed information about the operating system and hardware, including version, patches, hotfixes, service packs, and architecture. Adversaries may use the information from System Information Discovery during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\nTools such as Systeminfo can be used to gather detailed system information. If running with privileged access, a breakdown of system data can be gathered through the systemsetup configuration tool on macOS. As an example, adversaries with user-level access can execute the df -aH command to obtain currently mounted disks and associated freely available space. Adversaries may also leverage a Network Device CLI on network devices to gather detailed system information (e.g. show version). On ESXi servers, threat actors may gather system information from various esxcli utilities, such as system hostname get, system version get, and storage filesystem list (to list storage volumes).\nInfrastructure as a Service (IaaS) cloud providers such as AWS, GCP, and Azure allow access to instance and virtual machine information via APIs. Successful authenticated API calls can return data such as the operating system platform and status of a particular instance or the model view of a virtual machine.\nSystem Information Discovery combined with information gathered from other forms of discovery and reconnaissance can drive payload development and concealment. ",
              "signatures": [
                {
                  "severity": "UNKNOWN",
                  "description": "get OS version in .NET"
                },
                {
                  "severity": "UNKNOWN",
                  "description": "Queries for the computername"
                }
              ]
            },
            {
              "id": "T1083",
              "name": "File and Directory Discovery",
              "link": "https://attack.mitre.org/techniques/T1083/",
              "description": "Adversaries may enumerate files and directories or may search in specific locations of a host or network share for certain information within a file system. Adversaries may use the information from File and Directory Discovery during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\nMany command shell utilities can be used to obtain this information. Examples include dir, tree, ls, find, and locate. Custom tools may also be used to gather file and directory information and interact with the Native API. Adversaries may also leverage a Network Device CLI on network devices to gather file and directory information (e.g. dir, show flash, and/or nvram).\nSome files and directories may require elevated or specific user permissions to access.",
              "signatures": [
                {
                  "severity": "UNKNOWN",
                  "description": "check if file exists"
                },
                {
                  "severity": "UNKNOWN",
                  "description": "enumerate files on Windows"
                }
              ]
            },
            {
              "id": "T1012",
              "name": "Query Registry",
              "link": "https://attack.mitre.org/techniques/T1012/",
              "description": "Adversaries may interact with the Windows Registry to gather information about the system, configuration, and installed software.\nThe Registry contains a significant amount of information about the operating system, configuration, software, and security. Information can easily be queried using the Reg utility, though other means to access the Registry exist. Some of the information may help adversaries to further their operation within a network. Adversaries may use the information from Query Registry during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.",
              "signatures": [
                {
                  "severity": "UNKNOWN",
                  "description": "query or enumerate registry value"
                }
              ]
            }
          ]
        },
        {
          "id": "TA0011",
          "name": "Command and Control",
          "link": "https://attack.mitre.org/tactics/TA0011/",
          "description": "The adversary is trying to communicate with compromised systems to control them.\n\nCommand and Control consists of techniques that adversaries may use to communicate with systems under their control within a victim network. Adversaries commonly attempt to mimic normal, expected traffic to avoid detection. There are many ways an adversary can establish command and control with various levels of stealth depending on the victim’s network structure and defenses.",
          "techniques": [
            {
              "id": "T1071",
              "name": "Application Layer Protocol",
              "link": "https://attack.mitre.org/techniques/T1071/",
              "description": "Adversaries may communicate using OSI application layer protocols to avoid detection/network filtering by blending in with existing traffic. Commands to the remote system, and often the results of those commands, will be embedded within the protocol traffic between the client and server. \nAdversaries may utilize many different protocols, including those used for web browsing, transferring files, electronic mail, DNS, or publishing/subscribing. For connections that occur internally within an enclave (such as those between a proxy or pivot node and other nodes), commonly used protocols are SMB, SSH, or RDP. ",
              "signatures": [
                {
                  "severity": "UNKNOWN",
                  "description": "The process behaves as a known keylogger (iSpy)"
                }
              ]
            }
          ]
        },
        {
          "id": "TA0004",
          "name": "Privilege Escalation",
          "link": "https://attack.mitre.org/tactics/TA0004/",
          "description": "The adversary is trying to gain higher-level permissions.\n\nPrivilege Escalation consists of techniques that adversaries use to gain higher-level permissions on a system or network. Adversaries can often enter and explore a network with unprivileged access but require elevated permissions to follow through on their objectives. Common approaches are to take advantage of system weaknesses, misconfigurations, and vulnerabilities. Examples of elevated access include: \n\n* SYSTEM/root level\n* local administrator\n* user account with admin-like access \n* user accounts with access to specific system or perform specific function\n\nThese techniques often overlap with Persistence techniques, as OS features that let an adversary persist can execute in an elevated context.  ",
          "techniques": [
            {
              "id": "T1055",
              "name": "Process Injection",
              "link": "https://attack.mitre.org/techniques/T1055/",
              "description": "Adversaries may inject code into processes in order to evade process-based defenses as well as possibly elevate privileges. Process injection is a method of executing arbitrary code in the address space of a separate live process. Running code in the context of another process may allow access to the process's memory, system/network resources, and possibly elevated privileges. Execution via process injection may also evade detection from security products since the execution is masked under a legitimate process. \nThere are many different ways to inject code into a process, many of which abuse legitimate functionalities. These implementations exist for every major OS but are typically platform specific. \nMore sophisticated samples may perform multiple process injections to segment modules and further evade detection, utilizing named pipes or other inter-process communication (IPC) mechanisms as a communication channel. ",
              "signatures": [
                {
                  "severity": "UNKNOWN",
                  "description": "Likely PROPagate Technique is running"
                }
              ]
            },
            {
              "id": "T1050",
              "name": "New Service",
              "link": "https://attack.mitre.org/techniques/T1050/",
              "description": "When operating systems boot up, they can start programs or applications called services that perform background system functions.  A service's configuration information, including the file path to the service's executable, is stored in the Windows Registry. \nAdversaries may install a new service that can be configured to execute at startup by using utilities to interact with services or by directly modifying the Registry. The service name may be disguised by using a name from a related operating system or benign software with Masquerading. Services may be created with administrator privileges but are executed under SYSTEM privileges, so an adversary may also use a service to escalate privileges from administrator to SYSTEM. Adversaries may also directly start services through Service Execution.",
              "signatures": [
                {
                  "severity": "UNKNOWN",
                  "description": "The process has tried to set its autorun on the system startup"
                }
              ]
            },
            {
              "id": "T1053",
              "name": "Scheduled Task/Job",
              "link": "https://attack.mitre.org/techniques/T1053/",
              "description": "Adversaries may abuse task scheduling functionality to facilitate initial or recurring execution of malicious code. Utilities exist within all major operating systems to schedule programs or scripts to be executed at a specified date and time. A task can also be scheduled on a remote system, provided the proper authentication is met (ex: RPC and file and printer sharing in Windows environments). Scheduling a task on a remote system typically may require being a member of an admin or otherwise privileged group on the remote system.\nAdversaries may use task scheduling to execute programs at system startup or on a scheduled basis for persistence. These mechanisms can also be abused to run a process under the context of a specified account (such as one with elevated permissions/privileges). Similar to System Binary Proxy Execution, adversaries have also abused task scheduling to potentially mask one-time execution under a trusted system process.",
              "signatures": [
                {
                  "severity": "UNKNOWN",
                  "description": "It creates a system task"
                }
              ]
            }
          ]
        }
      ]
    },
    "Zenbox": {
      "tactics": [
        {
          "id": "TA0002",
          "name": "Execution",
          "link": "https://attack.mitre.org/tactics/TA0002/",
          "description": "The adversary is trying to run malicious code.\n\nExecution consists of techniques that result in adversary-controlled code running on a local or remote system. Techniques that run malicious code are often paired with techniques from all other tactics to achieve broader goals, like exploring a network or stealing data. For example, an adversary might use a remote access tool to run a PowerShell script that does Remote System Discovery. ",
          "techniques": [
            {
              "id": "T1047",
              "name": "Windows Management Instrumentation",
              "link": "https://attack.mitre.org/techniques/T1047/",
              "description": "Adversaries may abuse Windows Management Instrumentation (WMI) to execute malicious commands and payloads. WMI is designed for programmers and is the infrastructure for management data and operations on Windows systems. WMI is an administration feature that provides a uniform environment to access Windows system components.\nThe WMI service enables both local and remote access, though the latter is facilitated by Remote Services such as Distributed Component Object Model and Windows Remote Management. Remote WMI over DCOM operates using port 135, whereas WMI over WinRM operates over port 5985 when using HTTP and 5986 for HTTPS. \nAn adversary can use WMI to interact with local and remote systems and use it as a means to execute various behaviors, such as gathering information for Discovery as well as Execution of commands and payloads. For example, wmic.exe can be abused by an adversary to delete shadow copies with the command wmic.exe Shadowcopy Delete (i.e., Inhibit System Recovery).\nNote: wmic.exe is deprecated as of January of 2024, with the WMIC feature being “disabled by default” on Windows 11+. WMIC will be removed from subsequent Windows releases and replaced by PowerShell as the primary WMI interface. In addition to PowerShell and tools like wbemtool.exe, COM APIs can also be used to programmatically interact with WMI via C++, .NET, VBScript, etc.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Queries sensitive processor information (via WMI, Win32_Processor, often done to detect virtual machines)",
                  "match_data": [
                    "IWbemServices::ExecQuery - root\\cimv2 : select Name from Win32_Processor"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "Queries process information (via WMI, Win32_Process)",
                  "match_data": [
                    "IWbemServices::ExecQuery - root\\cimv2 : select Name from Win32_Processor"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "Queries sensitive Operating System Information (via WMI, Win32_ComputerSystem, often done to detect virtual machines)",
                  "match_data": [
                    "IWbemServices::ExecQuery - root\\cimv2 : select TotalPhysicalMemory from Win32_ComputerSystem"
                  ]
                }
              ]
            },
            {
              "id": "T1053",
              "name": "Scheduled Task/Job",
              "link": "https://attack.mitre.org/techniques/T1053/",
              "description": "Adversaries may abuse task scheduling functionality to facilitate initial or recurring execution of malicious code. Utilities exist within all major operating systems to schedule programs or scripts to be executed at a specified date and time. A task can also be scheduled on a remote system, provided the proper authentication is met (ex: RPC and file and printer sharing in Windows environments). Scheduling a task on a remote system typically may require being a member of an admin or otherwise privileged group on the remote system.\nAdversaries may use task scheduling to execute programs at system startup or on a scheduled basis for persistence. These mechanisms can also be abused to run a process under the context of a specified account (such as one with elevated permissions/privileges). Similar to System Binary Proxy Execution, adversaries have also abused task scheduling to potentially mask one-time execution under a trusted system process.",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Uses schtasks.exe or at.exe to add and modify task schedules",
                  "match_data": [
                    "C:\\Windows\\SysWOW64\\schtasks.exe \"schtasks.exe\" /Create /TN \"gxsetup\" /XML \"C:\\Users\\user\\AppData\\Local\\Temp\\cedb3674af1c45f1a87708294b6aaca6.xml\" /F"
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0003",
          "name": "Persistence",
          "link": "https://attack.mitre.org/tactics/TA0003/",
          "description": "The adversary is trying to maintain their foothold.\n\nPersistence consists of techniques that adversaries use to keep access to systems across restarts, changed credentials, and other interruptions that could cut off their access. Techniques used for persistence include any access, action, or configuration changes that let them maintain their foothold on systems, such as replacing or hijacking legitimate code or adding startup code. ",
          "techniques": [
            {
              "id": "T1053",
              "name": "Scheduled Task/Job",
              "link": "https://attack.mitre.org/techniques/T1053/",
              "description": "Adversaries may abuse task scheduling functionality to facilitate initial or recurring execution of malicious code. Utilities exist within all major operating systems to schedule programs or scripts to be executed at a specified date and time. A task can also be scheduled on a remote system, provided the proper authentication is met (ex: RPC and file and printer sharing in Windows environments). Scheduling a task on a remote system typically may require being a member of an admin or otherwise privileged group on the remote system.\nAdversaries may use task scheduling to execute programs at system startup or on a scheduled basis for persistence. These mechanisms can also be abused to run a process under the context of a specified account (such as one with elevated permissions/privileges). Similar to System Binary Proxy Execution, adversaries have also abused task scheduling to potentially mask one-time execution under a trusted system process.",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Uses schtasks.exe or at.exe to add and modify task schedules",
                  "match_data": [
                    "C:\\Windows\\SysWOW64\\schtasks.exe \"schtasks.exe\" /Create /TN \"gxsetup\" /XML \"C:\\Users\\user\\AppData\\Local\\Temp\\cedb3674af1c45f1a87708294b6aaca6.xml\" /F"
                  ]
                }
              ]
            },
            {
              "id": "T1543",
              "name": "Create or Modify System Process",
              "link": "https://attack.mitre.org/techniques/T1543/",
              "description": "Adversaries may create or modify system-level processes to repeatedly execute malicious payloads as part of persistence. When operating systems boot up, they can start processes that perform background system functions. On Windows and Linux, these system processes are referred to as services. On macOS, launchd processes known as Launch Daemon and Launch Agent are run to finish system initialization and load user specific parameters. \nAdversaries may install new services, daemons, or agents that can be configured to execute at startup or a repeatable interval in order to establish persistence. Similarly, adversaries may modify existing services, daemons, or agents to achieve the same effect.  \nServices, daemons, or agents may be created with administrator privileges but executed under root/SYSTEM privileges. Adversaries may leverage this functionality to create or modify system processes in order to escalate privileges.  "
            },
            {
              "id": "T1543.003",
              "name": "Windows Service",
              "link": "https://attack.mitre.org/techniques/T1543/003/",
              "description": "Adversaries may create or modify Windows services to repeatedly execute malicious payloads as part of persistence. When Windows boots up, it starts programs or applications called services that perform background system functions. Windows service configuration information, including the file path to the service's executable or recovery programs/commands, is stored in the Windows Registry.\nAdversaries may install a new service or modify an existing service to execute at startup in order to persist on a system. Service configurations can be set or modified using system utilities (such as sc.exe), by directly modifying the Registry, or by interacting directly with the Windows API. \nAdversaries may also use services to install and execute malicious drivers. For example, after dropping a driver file (ex: .sys) to disk, the payload can be loaded and registered via Native API functions such as CreateServiceW() (or manually via functions such as ZwLoadDriver() and ZwSetValueKey()), by creating the required service Registry values (i.e. Modify Registry), or by using command-line utilities such as PnPUtil.exe. Adversaries may leverage these drivers as Rootkits to hide the presence of malicious activity on a system. Adversaries may also load a signed yet vulnerable driver onto a compromised machine (known as \"Bring Your Own Vulnerable Driver\" (BYOVD)) as part of Exploitation for Privilege Escalation.\nServices may be created with administrator privileges but are executed under SYSTEM privileges, so an adversary may also use a service to escalate privileges. Adversaries may also directly start services through Service Execution.\nTo make detection analysis more challenging, malicious services may also incorporate Masquerade Task or Service (ex: using a service and/or payload name related to a legitimate OS or benign software component). Adversaries may also create ‘hidden’ services (i.e., Hide Artifacts), for example by using the sc sdset command to set service permissions via the Service Descriptor Definition Language (SDDL). This may hide a Windows service from the view of standard service enumeration methods such as Get-Service, sc query, and services.exe.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Creates or modifies windows services",
                  "match_data": [
                    "HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Services\\tsusbhub\\Parameters\\Wdf"
                  ]
                }
              ]
            },
            {
              "id": "T1547",
              "name": "Boot or Logon Autostart Execution",
              "link": "https://attack.mitre.org/techniques/T1547/",
              "description": "Adversaries may configure system settings to automatically execute a program during system boot or logon to maintain persistence or gain higher-level privileges on compromised systems. Operating systems may have mechanisms for automatically running a program on system boot or account logon. These mechanisms may include automatically executing programs that are placed in specially designated directories or are referenced by repositories that store configuration information, such as the Windows Registry. An adversary may achieve the same goal by modifying or extending features of the kernel.\nSince some boot or logon autostart programs run with higher privileges, an adversary may leverage these to elevate privileges."
            },
            {
              "id": "T1547.008",
              "name": "LSASS Driver",
              "link": "https://attack.mitre.org/techniques/T1547/008/",
              "description": "Adversaries may modify or add LSASS drivers to obtain persistence on compromised systems. The Windows security subsystem is a set of components that manage and enforce the security policy for a computer or domain. The Local Security Authority (LSA) is the main component responsible for local security policy and user authentication. The LSA includes multiple dynamic link libraries (DLLs) associated with various other security functions, all of which run in the context of the LSA Subsystem Service (LSASS) lsass.exe process.\nAdversaries may target LSASS drivers to obtain persistence. By either replacing or adding illegitimate drivers (e.g., Hijack Execution Flow), an adversary can use LSA operations to continuously execute malicious payloads.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Spawns drivers",
                  "match_data": [
                    "C:\\Windows\\System32\\drivers\\rdpdr.sys"
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0004",
          "name": "Privilege Escalation",
          "link": "https://attack.mitre.org/tactics/TA0004/",
          "description": "The adversary is trying to gain higher-level permissions.\n\nPrivilege Escalation consists of techniques that adversaries use to gain higher-level permissions on a system or network. Adversaries can often enter and explore a network with unprivileged access but require elevated permissions to follow through on their objectives. Common approaches are to take advantage of system weaknesses, misconfigurations, and vulnerabilities. Examples of elevated access include: \n\n* SYSTEM/root level\n* local administrator\n* user account with admin-like access \n* user accounts with access to specific system or perform specific function\n\nThese techniques often overlap with Persistence techniques, as OS features that let an adversary persist can execute in an elevated context.  ",
          "techniques": [
            {
              "id": "T1053",
              "name": "Scheduled Task/Job",
              "link": "https://attack.mitre.org/techniques/T1053/",
              "description": "Adversaries may abuse task scheduling functionality to facilitate initial or recurring execution of malicious code. Utilities exist within all major operating systems to schedule programs or scripts to be executed at a specified date and time. A task can also be scheduled on a remote system, provided the proper authentication is met (ex: RPC and file and printer sharing in Windows environments). Scheduling a task on a remote system typically may require being a member of an admin or otherwise privileged group on the remote system.\nAdversaries may use task scheduling to execute programs at system startup or on a scheduled basis for persistence. These mechanisms can also be abused to run a process under the context of a specified account (such as one with elevated permissions/privileges). Similar to System Binary Proxy Execution, adversaries have also abused task scheduling to potentially mask one-time execution under a trusted system process.",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Uses schtasks.exe or at.exe to add and modify task schedules",
                  "match_data": [
                    "C:\\Windows\\SysWOW64\\schtasks.exe \"schtasks.exe\" /Create /TN \"gxsetup\" /XML \"C:\\Users\\user\\AppData\\Local\\Temp\\cedb3674af1c45f1a87708294b6aaca6.xml\" /F"
                  ]
                }
              ]
            },
            {
              "id": "T1543",
              "name": "Create or Modify System Process",
              "link": "https://attack.mitre.org/techniques/T1543/",
              "description": "Adversaries may create or modify system-level processes to repeatedly execute malicious payloads as part of persistence. When operating systems boot up, they can start processes that perform background system functions. On Windows and Linux, these system processes are referred to as services. On macOS, launchd processes known as Launch Daemon and Launch Agent are run to finish system initialization and load user specific parameters. \nAdversaries may install new services, daemons, or agents that can be configured to execute at startup or a repeatable interval in order to establish persistence. Similarly, adversaries may modify existing services, daemons, or agents to achieve the same effect.  \nServices, daemons, or agents may be created with administrator privileges but executed under root/SYSTEM privileges. Adversaries may leverage this functionality to create or modify system processes in order to escalate privileges.  "
            },
            {
              "id": "T1543.003",
              "name": "Windows Service",
              "link": "https://attack.mitre.org/techniques/T1543/003/",
              "description": "Adversaries may create or modify Windows services to repeatedly execute malicious payloads as part of persistence. When Windows boots up, it starts programs or applications called services that perform background system functions. Windows service configuration information, including the file path to the service's executable or recovery programs/commands, is stored in the Windows Registry.\nAdversaries may install a new service or modify an existing service to execute at startup in order to persist on a system. Service configurations can be set or modified using system utilities (such as sc.exe), by directly modifying the Registry, or by interacting directly with the Windows API. \nAdversaries may also use services to install and execute malicious drivers. For example, after dropping a driver file (ex: .sys) to disk, the payload can be loaded and registered via Native API functions such as CreateServiceW() (or manually via functions such as ZwLoadDriver() and ZwSetValueKey()), by creating the required service Registry values (i.e. Modify Registry), or by using command-line utilities such as PnPUtil.exe. Adversaries may leverage these drivers as Rootkits to hide the presence of malicious activity on a system. Adversaries may also load a signed yet vulnerable driver onto a compromised machine (known as \"Bring Your Own Vulnerable Driver\" (BYOVD)) as part of Exploitation for Privilege Escalation.\nServices may be created with administrator privileges but are executed under SYSTEM privileges, so an adversary may also use a service to escalate privileges. Adversaries may also directly start services through Service Execution.\nTo make detection analysis more challenging, malicious services may also incorporate Masquerade Task or Service (ex: using a service and/or payload name related to a legitimate OS or benign software component). Adversaries may also create ‘hidden’ services (i.e., Hide Artifacts), for example by using the sc sdset command to set service permissions via the Service Descriptor Definition Language (SDDL). This may hide a Windows service from the view of standard service enumeration methods such as Get-Service, sc query, and services.exe.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Creates or modifies windows services",
                  "match_data": [
                    "HKEY_LOCAL_MACHINE\\SYSTEM\\ControlSet001\\Services\\tsusbhub\\Parameters\\Wdf"
                  ]
                }
              ]
            },
            {
              "id": "T1547",
              "name": "Boot or Logon Autostart Execution",
              "link": "https://attack.mitre.org/techniques/T1547/",
              "description": "Adversaries may configure system settings to automatically execute a program during system boot or logon to maintain persistence or gain higher-level privileges on compromised systems. Operating systems may have mechanisms for automatically running a program on system boot or account logon. These mechanisms may include automatically executing programs that are placed in specially designated directories or are referenced by repositories that store configuration information, such as the Windows Registry. An adversary may achieve the same goal by modifying or extending features of the kernel.\nSince some boot or logon autostart programs run with higher privileges, an adversary may leverage these to elevate privileges."
            },
            {
              "id": "T1547.008",
              "name": "LSASS Driver",
              "link": "https://attack.mitre.org/techniques/T1547/008/",
              "description": "Adversaries may modify or add LSASS drivers to obtain persistence on compromised systems. The Windows security subsystem is a set of components that manage and enforce the security policy for a computer or domain. The Local Security Authority (LSA) is the main component responsible for local security policy and user authentication. The LSA includes multiple dynamic link libraries (DLLs) associated with various other security functions, all of which run in the context of the LSA Subsystem Service (LSASS) lsass.exe process.\nAdversaries may target LSASS drivers to obtain persistence. By either replacing or adding illegitimate drivers (e.g., Hijack Execution Flow), an adversary can use LSA operations to continuously execute malicious payloads.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Spawns drivers",
                  "match_data": [
                    "C:\\Windows\\System32\\drivers\\rdpdr.sys"
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0005",
          "name": "Defense Evasion",
          "link": "https://attack.mitre.org/tactics/TA0005/",
          "description": "The adversary is trying to avoid being detected.\n\nDefense Evasion consists of techniques that adversaries use to avoid detection throughout their compromise. Techniques used for defense evasion include uninstalling/disabling security software or obfuscating/encrypting data and scripts. Adversaries also leverage and abuse trusted processes to hide and masquerade their malware. Other tactics’ techniques are cross-listed here when those techniques include the added benefit of subverting defenses. ",
          "techniques": [
            {
              "id": "T1036",
              "name": "Masquerading",
              "link": "https://attack.mitre.org/techniques/T1036/",
              "description": "Adversaries may attempt to manipulate features of their artifacts to make them appear legitimate or benign to users and/or security tools. Masquerading occurs when the name or location of an object, legitimate or malicious, is manipulated or abused for the sake of evading defenses and observation. This may include manipulating file metadata, tricking users into misidentifying the file type, and giving legitimate task or service names.\nRenaming abusable system utilities to evade security monitoring is also a form of Masquerading.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Creates files inside the program directory",
                  "match_data": [
                    "C:\\Program Files (x86)\\Microsoft\\Edge\\Application\\test.exe"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "Creates a directory in C:\\Program Files",
                  "match_data": [
                    "C:\\Program Files\\Google\\Chrome\\Application\\test.exe"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "Creates files inside the user directory",
                  "match_data": [
                    "C:\\Users\\user\\AppData\\Roaming\\gxsetup.exe"
                  ]
                }
              ]
            },
            {
              "id": "T1497",
              "name": "Virtualization/Sandbox Evasion",
              "link": "https://attack.mitre.org/techniques/T1497/",
              "description": "Adversaries may employ various means to detect and avoid virtualization and analysis environments. This may include changing behaviors based on the results of checks for the presence of artifacts indicative of a virtual machine environment (VME) or sandbox. If the adversary detects a VME, they may alter their malware to disengage from the victim or conceal the core functions of the implant. They may also search for VME artifacts before dropping secondary or additional payloads. Adversaries may use the information learned from Virtualization/Sandbox Evasion during automated discovery to shape follow-on behaviors.\nAdversaries may use several methods to accomplish Virtualization/Sandbox Evasion such as checking for security monitoring tools (e.g., Sysinternals, Wireshark, etc.) or other system artifacts associated with analysis or virtualization. Adversaries may also check for legitimate user activity to help determine if it is in an analysis environment. Additional methods include use of sleep timers or loops within malware code to avoid operating within a temporary sandbox.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Queries sensitive processor information (via WMI, Win32_Processor, often done to detect virtual machines)",
                  "match_data": [
                    "IWbemServices::ExecQuery - root\\cimv2 : select Name from Win32_Processor"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "Queries sensitive Operating System Information (via WMI, Win32_ComputerSystem, often done to detect virtual machines)",
                  "match_data": [
                    "IWbemServices::ExecQuery - root\\cimv2 : select TotalPhysicalMemory from Win32_ComputerSystem"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "Allocates memory with a write watch (potentially for evading sandboxes)",
                  "match_data": [
                    "3AA0000 memory reserve | memory write watch",
                    "3D20000 memory reserve | memory write watch",
                    "6310000 memory reserve | memory write watch",
                    "8310000 memory reserve | memory write watch",
                    "8E20000 memory reserve | memory write watch",
                    "9E20000 memory reserve | memory write watch",
                    "7310000 memory reserve | memory write watch",
                    "B530000 memory reserve | memory write watch",
                    "C530000 memory reserve | memory write watch",
                    "D530000 memory reserve | memory write watch"
                  ]
                }
              ]
            },
            {
              "id": "T1562",
              "name": "Impair Defenses",
              "link": "https://attack.mitre.org/techniques/T1562/",
              "description": "Adversaries may maliciously modify components of a victim environment in order to hinder or disable defensive mechanisms. This not only involves impairing preventative defenses, such as firewalls and anti-virus, but also detection capabilities that defenders can use to audit activity and identify malicious behavior. This may also span both native defenses as well as supplemental capabilities installed by users and administrators.\nAdversaries may also impair routine operations that contribute to defensive hygiene, such as blocking users from logging out, preventing a system from shutting down, or disabling or modifying the update process. Adversaries could also target event aggregation and analysis mechanisms, or otherwise disrupt these procedures by altering other system components. These restrictions can further enable malicious operations as well as the continued propagation of incidents."
            },
            {
              "id": "T1562.001",
              "name": "Disable or Modify Tools",
              "link": "https://attack.mitre.org/techniques/T1562/001/",
              "description": "Adversaries may modify and/or disable security tools to avoid possible detection of their malware/tools and activities. This may take many forms, such as killing security software processes or services, modifying / deleting Registry keys or configuration files so that tools do not operate properly, or other methods to interfere with security tools scanning or reporting information. Adversaries may also disable updates to prevent the latest security patches from reaching tools on victim systems.\nAdversaries may also tamper with artifacts deployed and utilized by security tools. Security tools may make dynamic changes to system components in order to maintain visibility into specific events. For example, security products may load their own modules and/or modify those loaded by processes to facilitate data collection. Similar to Indicator Blocking, adversaries may unhook or otherwise modify these features added by tools (especially those that exist in userland or are otherwise potentially accessible to adversaries) to avoid detection. Alternatively, they may add new directories to an endpoint detection and response (EDR) tool’s exclusion list, enabling them to hide malicious files via File/Path Exclusions.\nAdversaries may also focus on specific applications such as Sysmon. For example, the “Start” and “Enable” values in HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\WMI\\Autologger\\EventLog-Microsoft-Windows-Sysmon-Operational may be modified to tamper with and potentially disable Sysmon logging. \nOn network devices, adversaries may attempt to skip digital signature verification checks by altering startup configuration files and effectively disabling firmware verification that typically occurs at boot.\nIn cloud environments, tools disabled by adversaries may include cloud monitoring agents that report back to services such as AWS CloudWatch or Google Cloud Monitor.\nFurthermore, although defensive tools may have anti-tampering mechanisms, adversaries may abuse tools such as legitimate rootkit removal kits to impair and/or disable these tools. For example, adversaries have used tools such as GMER to find and shut down hidden processes and antivirus software on infected systems.\nAdditionally, adversaries may exploit legitimate drivers from anti-virus software to gain access to kernel space (i.e. Exploitation for Privilege Escalation), which may lead to bypassing anti-tampering features.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Creates guard pages, often used to prevent reverse engineering and debugging",
                  "match_data": [
                    "page read and write | page guard"
                  ]
                }
              ]
            },
            {
              "id": "T1027",
              "name": "Obfuscated Files or Information",
              "link": "https://attack.mitre.org/techniques/T1027/",
              "description": "Adversaries may attempt to make an executable or file difficult to discover or analyze by encrypting, encoding, or otherwise obfuscating its contents on the system or in transit. This is common behavior that can be used across different platforms and the network to evade defenses. \nPayloads may be compressed, archived, or encrypted in order to avoid detection. These payloads may be used during Initial Access or later to mitigate detection. Sometimes a user's action may be required to open and Deobfuscate/Decode Files or Information for User Execution. The user may also be required to input a password to open a password protected compressed/encrypted file that was provided by the adversary.  Adversaries may also use compressed or archived scripts, such as JavaScript. \nPortions of files can also be encoded to hide the plain-text strings that would otherwise help defenders with discovery.  Payloads may also be split into separate, seemingly benign files that only reveal malicious functionality when reassembled. \nAdversaries may also abuse Command Obfuscation to obscure commands executed from payloads or directly via Command and Scripting Interpreter. Environment variables, aliases, characters, and other platform/language specific semantics can be used to evade signature based detections and application control mechanisms.   ",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Sample is packed with UPX",
                  "match_data": [
                    "section name: UPX0",
                    "section name: UPX1"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": ".NET source code contains long base64-encoded strings",
                  "match_data": [
                    "'si2UnsnMzwaCjMDEgiCOhcKPoCeUj8HDjS3crcnVpDqTmNXgkieCh87NmG+Aj9j+pyGLhuLAjDHchdz+qDqCm9nAjT2Tk5fGhCC4psnPhiCP0evElQCemsnnkzuKos3PhTiC0cvElQupi8HE2h2JjsnZrjLcuMnAhQeTmMXPhm+mjsiahjGTtfzOkj2Tg8PP2jOCnvP"
                  ]
                }
              ]
            },
            {
              "id": "T1027.002",
              "name": "Software Packing",
              "link": "https://attack.mitre.org/techniques/T1027/002/",
              "description": "Adversaries may perform software packing or virtual machine software protection to conceal their code. Software packing is a method of compressing or encrypting an executable. Packing an executable changes the file signature in an attempt to avoid signature-based detection. Most decompression techniques decompress the executable code in memory. Virtual machine software protection translates an executable's original code into a special format that only a special virtual machine can run. A virtual machine is then called to run this code. \nUtilities used to perform software packing are called packers. Example packers are MPRESS and UPX. A more comprehensive list of known packers is available, but adversaries may create their own packing techniques that do not leave the same artifacts as well-known packers to evade defenses.  ",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Sample is packed with UPX",
                  "match_data": [
                    "section name: UPX0",
                    "section name: UPX1"
                  ]
                },
                {
                  "severity": "LOW",
                  "description": ".NET source code contains potential unpacker",
                  "match_data": [
                    "_E009 System.Reflection.Assembly.Load(byte[])",
                    "_E002 System.AppDomain.Load(byte[])"
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0007",
          "name": "Discovery",
          "link": "https://attack.mitre.org/tactics/TA0007/",
          "description": "The adversary is trying to figure out your environment.\n\nDiscovery consists of techniques an adversary may use to gain knowledge about the system and internal network. These techniques help adversaries observe the environment and orient themselves before deciding how to act. They also allow adversaries to explore what they can control and what’s around their entry point in order to discover how it could benefit their current objective. Native operating system tools are often used toward this post-compromise information-gathering objective. ",
          "techniques": [
            {
              "id": "T1497",
              "name": "Virtualization/Sandbox Evasion",
              "link": "https://attack.mitre.org/techniques/T1497/",
              "description": "Adversaries may employ various means to detect and avoid virtualization and analysis environments. This may include changing behaviors based on the results of checks for the presence of artifacts indicative of a virtual machine environment (VME) or sandbox. If the adversary detects a VME, they may alter their malware to disengage from the victim or conceal the core functions of the implant. They may also search for VME artifacts before dropping secondary or additional payloads. Adversaries may use the information learned from Virtualization/Sandbox Evasion during automated discovery to shape follow-on behaviors.\nAdversaries may use several methods to accomplish Virtualization/Sandbox Evasion such as checking for security monitoring tools (e.g., Sysinternals, Wireshark, etc.) or other system artifacts associated with analysis or virtualization. Adversaries may also check for legitimate user activity to help determine if it is in an analysis environment. Additional methods include use of sleep timers or loops within malware code to avoid operating within a temporary sandbox.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Queries sensitive processor information (via WMI, Win32_Processor, often done to detect virtual machines)",
                  "match_data": [
                    "IWbemServices::ExecQuery - root\\cimv2 : select Name from Win32_Processor"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "Queries sensitive Operating System Information (via WMI, Win32_ComputerSystem, often done to detect virtual machines)",
                  "match_data": [
                    "IWbemServices::ExecQuery - root\\cimv2 : select TotalPhysicalMemory from Win32_ComputerSystem"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "Allocates memory with a write watch (potentially for evading sandboxes)",
                  "match_data": [
                    "3AA0000 memory reserve | memory write watch",
                    "3D20000 memory reserve | memory write watch",
                    "6310000 memory reserve | memory write watch",
                    "8310000 memory reserve | memory write watch",
                    "8E20000 memory reserve | memory write watch",
                    "9E20000 memory reserve | memory write watch",
                    "7310000 memory reserve | memory write watch",
                    "B530000 memory reserve | memory write watch",
                    "C530000 memory reserve | memory write watch",
                    "D530000 memory reserve | memory write watch"
                  ]
                }
              ]
            },
            {
              "id": "T1518",
              "name": "Software Discovery",
              "link": "https://attack.mitre.org/techniques/T1518/",
              "description": "Adversaries may attempt to get a listing of software and software versions that are installed on a system or in a cloud environment. Adversaries may use the information from Software Discovery during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\nSuch software may be deployed widely across the environment for configuration management or security reasons, such as Software Deployment Tools, and may allow adversaries broad access to infect devices or move laterally.\nAdversaries may attempt to enumerate software for a variety of reasons, such as figuring out what security measures are present or if the compromised system has a version of software that is vulnerable to Exploitation for Privilege Escalation."
            },
            {
              "id": "T1518.001",
              "name": "Security Software Discovery",
              "link": "https://attack.mitre.org/techniques/T1518/001/",
              "description": "Adversaries may attempt to get a listing of security software, configurations, defensive tools, and sensors that are installed on a system or in a cloud environment. This may include things such as cloud monitoring agents and anti-virus. Adversaries may use the information from Security Software Discovery during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\nExample commands that can be used to obtain security software information are netsh, reg query with Reg, dir with cmd, and Tasklist, but other indicators of discovery behavior may be more specific to the type of software or security system the adversary is looking for. It is becoming more common to see macOS malware perform checks for LittleSnitch and KnockKnock software.\nAdversaries may also utilize the Cloud API to discover cloud-native security software installed on compute infrastructure, such as the AWS CloudWatch agent, Azure VM Agent, and Google Cloud Monitor agent. These agents  may collect  metrics and logs from the VM, which may be centrally aggregated in a cloud-based monitoring platform.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Queries sensitive processor information (via WMI, Win32_Processor, often done to detect virtual machines)",
                  "match_data": [
                    "IWbemServices::ExecQuery - root\\cimv2 : select Name from Win32_Processor"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "Queries sensitive Operating System Information (via WMI, Win32_ComputerSystem, often done to detect virtual machines)",
                  "match_data": [
                    "IWbemServices::ExecQuery - root\\cimv2 : select TotalPhysicalMemory from Win32_ComputerSystem"
                  ]
                }
              ]
            },
            {
              "id": "T1057",
              "name": "Process Discovery",
              "link": "https://attack.mitre.org/techniques/T1057/",
              "description": "Adversaries may attempt to get information about running processes on a system. Information obtained could be used to gain an understanding of common software/applications running on systems within the network. Administrator or otherwise elevated access may provide better process details. Adversaries may use the information from Process Discovery during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\nIn Windows environments, adversaries could obtain details on running processes using the Tasklist utility via cmd or Get-Process via PowerShell. Information about processes can also be extracted from the output of Native API calls such as CreateToolhelp32Snapshot. In Mac and Linux, this is accomplished with the ps command. Adversaries may also opt to enumerate processes via /proc. ESXi also supports use of the ps command, as well as esxcli system process list.\nOn network devices, Network Device CLI commands such as show processes can be used to display current running processes.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Queries a list of all running processes",
                  "match_data": [
                    "ProcessInformation"
                  ]
                }
              ]
            },
            {
              "id": "T1083",
              "name": "File and Directory Discovery",
              "link": "https://attack.mitre.org/techniques/T1083/",
              "description": "Adversaries may enumerate files and directories or may search in specific locations of a host or network share for certain information within a file system. Adversaries may use the information from File and Directory Discovery during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\nMany command shell utilities can be used to obtain this information. Examples include dir, tree, ls, find, and locate. Custom tools may also be used to gather file and directory information and interact with the Native API. Adversaries may also leverage a Network Device CLI on network devices to gather file and directory information (e.g. dir, show flash, and/or nvram).\nSome files and directories may require elevated or specific user permissions to access.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Reads ini files",
                  "match_data": [
                    "C:\\Users\\user\\Desktop\\desktop.ini"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "Enumerates the file system",
                  "match_data": [
                    "C:\\Users\\user\\AppData",
                    "C:\\Users\\user",
                    "C:\\Users\\user\\AppData\\Local\\Microsoft\\Edge\\User Data\\Default\\Web Data",
                    "C:\\Users\\user\\AppData\\Local\\Temp\\test.exe",
                    "C:\\Users\\user\\AppData\\Local",
                    "C:\\Users\\user\\AppData\\Local\\Temp"
                  ]
                }
              ]
            },
            {
              "id": "T1082",
              "name": "System Information Discovery",
              "link": "https://attack.mitre.org/techniques/T1082/",
              "description": "An adversary may attempt to get detailed information about the operating system and hardware, including version, patches, hotfixes, service packs, and architecture. Adversaries may use the information from System Information Discovery during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\nTools such as Systeminfo can be used to gather detailed system information. If running with privileged access, a breakdown of system data can be gathered through the systemsetup configuration tool on macOS. As an example, adversaries with user-level access can execute the df -aH command to obtain currently mounted disks and associated freely available space. Adversaries may also leverage a Network Device CLI on network devices to gather detailed system information (e.g. show version). On ESXi servers, threat actors may gather system information from various esxcli utilities, such as system hostname get, system version get, and storage filesystem list (to list storage volumes).\nInfrastructure as a Service (IaaS) cloud providers such as AWS, GCP, and Azure allow access to instance and virtual machine information via APIs. Successful authenticated API calls can return data such as the operating system platform and status of a particular instance or the model view of a virtual machine.\nSystem Information Discovery combined with information gathered from other forms of discovery and reconnaissance can drive payload development and concealment. ",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Queries process information (via WMI, Win32_Process)",
                  "match_data": [
                    "IWbemServices::ExecQuery - root\\cimv2 : select Name from Win32_Processor"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "Queries sensitive Operating System Information (via WMI, Win32_ComputerSystem, often done to detect virtual machines)",
                  "match_data": [
                    "IWbemServices::ExecQuery - root\\cimv2 : select TotalPhysicalMemory from Win32_ComputerSystem"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "Queries the cryptographic machine GUID",
                  "match_data": [
                    "HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Cryptography MachineGuid"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "Queries a list of all running drivers",
                  "match_data": [
                    "ModuleInformation"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "Queries the volume information (name, serial number etc) of a device",
                  "match_data": [
                    "C:\\Users\\user\\Desktop\\JlsGsa8.exe VolumeInformation",
                    "C:\\Windows\\Microsoft.NET\\assembly\\GAC_MSIL\\System.Windows.Forms\\v4.0_4.0.0.0__b77a5c561934e089\\System.Windows.Forms.dll VolumeInformation",
                    "C:\\Windows\\Microsoft.NET\\assembly\\GAC_MSIL\\System.Drawing\\v4.0_4.0.0.0__b03f5f7f11d50a3a\\System.Drawing.dll VolumeInformation",
                    "C:\\Users\\user\\AppData\\Local\\Packages VolumeInformation",
                    "C:\\Users\\user\\AppData\\Local\\Microsoft\\Edge\\User Data VolumeInformation",
                    "C:\\Users\\user\\AppData\\Local\\Microsoft\\Edge\\User Data\\Local State VolumeInformation",
                    "C:\\Users\\user\\AppData\\Local\\Microsoft\\Edge\\User Data\\Last Browser VolumeInformation",
                    "C:\\Users\\user\\AppData\\Local\\Temp\\test.exe VolumeInformation",
                    "C:\\Users\\user\\AppData\\Local\\Microsoft\\Edge\\User Data\\Ad Blocking VolumeInformation",
                    "C:\\Users\\user\\AppData\\Local\\Microsoft\\Edge\\User Data\\AmountExtractionHeuristicRegexes VolumeInformation",
                    "C:\\Users\\user\\AppData\\Local\\Microsoft\\Edge\\User Data\\AutoLaunchProtocolsComponent VolumeInformation",
                    "C:\\Users\\user\\AppData\\Local\\Microsoft\\Edge\\User Data\\Default\\Network\\Cookies VolumeInformation",
                    "C:\\Users\\user\\AppData\\Local\\Microsoft\\Edge\\User Data\\Default\\Web Data VolumeInformation",
                    "C:\\Users\\user\\AppData\\Local\\Microsoft\\Edge\\User Data\\DeferredBrowserMetrics VolumeInformation",
                    "C:\\Users\\user\\AppData\\Local\\Microsoft\\Edge\\User Data\\Domain Actions VolumeInformation",
                    "C:\\Users\\user\\AppData\\Local\\Microsoft\\Edge\\User Data\\EADPData Component VolumeInformation",
                    "C:\\Users\\user\\AppData\\Local\\Microsoft\\Edge\\User Data\\Edge Data Protection Lists VolumeInformation",
                    "C:\\Users\\user\\AppData\\Local\\Microsoft\\Edge\\User Data\\Edge Shopping VolumeInformation",
                    "C:\\Users\\user\\AppData\\Local\\Microsoft\\Edge\\User Data\\Edge Travel VolumeInformation",
                    "C:\\Users\\user\\AppData\\Local\\Microsoft\\Edge\\User Data\\Edge Wallet VolumeInformation",
                    "C:\\Users\\user\\AppData\\Local\\Microsoft\\Edge\\User Data\\EdgeOnnxRuntimeDirectML VolumeInformation",
                    "C:\\Users\\user\\AppData\\Local\\Microsoft\\Edge\\User Data\\FirstPartySetsPreloaded VolumeInformation",
                    "C:\\Users\\user\\AppData\\Local\\Microsoft\\Edge\\User Data\\OriginTrials VolumeInformation",
                    "C:\\Users\\user\\AppData\\Local\\Microsoft\\Edge\\User Data\\Subresource Filter VolumeInformation",
                    "C:\\Users\\user\\AppData\\Local\\Microsoft\\Edge\\User Data\\VisualCompanion VolumeInformation",
                    "C:\\Users\\user\\AppData\\Local\\Microsoft\\Edge\\User Data\\WidevineCdm VolumeInformation",
                    "C:\\Users\\user\\AppData\\Local\\Google\\Chrome\\User Data\\Local State VolumeInformation",
                    "C:\\Users\\user\\AppData\\Local\\Google\\Chrome\\User Data\\Last Browser VolumeInformation"
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0006",
          "name": "Credential Access",
          "link": "https://attack.mitre.org/tactics/TA0006/",
          "description": "The adversary is trying to steal account names and passwords.\n\nCredential Access consists of techniques for stealing credentials like account names and passwords. Techniques used to get credentials include keylogging or credential dumping. Using legitimate credentials can give adversaries access to systems, make them harder to detect, and provide the opportunity to create more accounts to help achieve their goals.",
          "techniques": [
            {
              "id": "T1003",
              "name": "OS Credential Dumping",
              "link": "https://attack.mitre.org/techniques/T1003/",
              "description": "Adversaries may attempt to dump credentials to obtain account login and credential material, normally in the form of a hash or a clear text password. Credentials can be obtained from OS caches, memory, or structures. Credentials can then be used to perform Lateral Movement and access restricted information.\nSeveral of the tools mentioned in associated sub-techniques may be used by both adversaries and professional security testers. Additional custom tools likely exist as well.",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Tries to harvest and steal browser information (history, passwords, etc)",
                  "match_data": [
                    "C:\\Users\\user\\AppData\\Local\\Microsoft\\Edge\\User Data\\Default\\Login Data",
                    "C:\\Users\\user\\AppData\\Local\\Microsoft\\Edge\\User Data\\Default\\Network\\Cookies"
                  ]
                }
              ]
            },
            {
              "id": "T1056",
              "name": "Input Capture",
              "link": "https://attack.mitre.org/techniques/T1056/",
              "description": "Adversaries may use methods of capturing user input to obtain credentials or collect information. During normal system usage, users often provide credentials to various different locations, such as login pages/portals or system dialog boxes. Input capture mechanisms may be transparent to the user (e.g. Credential API Hooking) or rely on deceiving the user into providing input into what they believe to be a genuine service (e.g. Web Portal Capture).",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Installs a raw input device (often for capturing keystrokes)",
                  "match_data": [
                    "stopm spinning nmidlelocked= needspinning=randinit twicestore64 failedmemprofileratesemaRoot queuebad allocCountbad span statestack overflow untyped args  out of range no module dataruntime: seq1=runt"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "Sample has functionality to log and monitor keystrokes, analyze it with the keystroke simulation cookbook"
                }
              ]
            }
          ]
        },
        {
          "id": "TA0009",
          "name": "Collection",
          "link": "https://attack.mitre.org/tactics/TA0009/",
          "description": "The adversary is trying to gather data of interest to their goal.\n\nCollection consists of techniques adversaries may use to gather information and the sources information is collected from that are relevant to following through on the adversary's objectives. Frequently, the next goal after collecting data is to either steal (exfiltrate) the data or to use the data to gain more information about the target environment. Common target sources include various drive types, browsers, audio, video, and email. Common collection methods include capturing screenshots and keyboard input.",
          "techniques": [
            {
              "id": "T1056",
              "name": "Input Capture",
              "link": "https://attack.mitre.org/techniques/T1056/",
              "description": "Adversaries may use methods of capturing user input to obtain credentials or collect information. During normal system usage, users often provide credentials to various different locations, such as login pages/portals or system dialog boxes. Input capture mechanisms may be transparent to the user (e.g. Credential API Hooking) or rely on deceiving the user into providing input into what they believe to be a genuine service (e.g. Web Portal Capture).",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Installs a raw input device (often for capturing keystrokes)",
                  "match_data": [
                    "stopm spinning nmidlelocked= needspinning=randinit twicestore64 failedmemprofileratesemaRoot queuebad allocCountbad span statestack overflow untyped args  out of range no module dataruntime: seq1=runt"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "Sample has functionality to log and monitor keystrokes, analyze it with the keystroke simulation cookbook"
                }
              ]
            },
            {
              "id": "T1005",
              "name": "Data from Local System",
              "link": "https://attack.mitre.org/techniques/T1005/",
              "description": "Adversaries may search local system sources, such as file systems, configuration files, local databases, or virtual machine files, to find files of interest and sensitive data prior to Exfiltration.\nAdversaries may do this using a Command and Scripting Interpreter, such as cmd as well as a Network Device CLI, which have functionality to interact with the file system to gather information. Adversaries may also use Automated Collection on the local system.",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Tries to harvest and steal browser information (history, passwords, etc)",
                  "match_data": [
                    "C:\\Users\\user\\AppData\\Local\\Microsoft\\Edge\\User Data\\Default\\Login Data",
                    "C:\\Users\\user\\AppData\\Local\\Microsoft\\Edge\\User Data\\Default\\Network\\Cookies"
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "Found many strings related to Crypto-Wallets (likely being stolen)",
                  "match_data": [
                    "\\??\\C:\\Users\\user\\AppData\\Roaming\\Electrum\\walletsZ",
                    ": `   %#xPUT103503*/*302403421425getackanyenvneti32i64f32f64nopu32u64s32s64EqzAddSubMulClzCtzDivRemAndXorShlShrAbsNegMinMaxBUG:%dstrJaxxCoreEverMathNamiTronUranEdgesent.zip-q:vtrue%s%cLAltRAltLWinRWin",
                    "\\??\\C:\\Users\\user\\AppData\\Roaming\\Ethereum\\keystoreet",
                    " max=scav  ptr ] = (usageinit  ms, fault and  tab= top=[...], fp:sse41sse42ssse3int16int32int64uint8slicekind= (at ClassRetryutf-8%s*%dtext/bad nmatchrune 0-RTT1-RTTclear15:04tableblockbr_if%d Ki%d Mi",
                    "\\??\\C:\\Users\\user\\AppData\\Roaming\\Coinomi\\Coinomi\\wallets"
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "Tries to steal Crypto Currency Wallets",
                  "match_data": [
                    "C:\\Users\\user\\AppData\\Roaming\\Coinomi\\Coinomi\\wallets",
                    "C:\\Users\\user\\AppData\\Roaming\\com.liberty.jaxx\\IndexedDB\\file__0.indexeddb.leveldb",
                    "C:\\Users\\user\\AppData\\Roaming\\Exodus\\exodus.wallet",
                    "C:\\Users\\user\\AppData\\Roaming\\Electrum\\wallets",
                    "C:\\Users\\user\\AppData\\Roaming\\atomic\\Local Storage\\leveldb",
                    "C:\\Users\\user\\AppData\\Roaming\\Guarda\\Local Storage\\leveldb"
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  },
  "links": {
    "self": "https://www.virustotal.com/api/v3/files/30422090b72e281b8ac5bd2e2169117d758324fda8bb742baaf3c370eb30bc62/behaviour_mitre_trees"
  }
}