{
  "data": {
    "CAPA": {
      "tactics": [
        {
          "id": "TA0005",
          "name": "Defense Evasion",
          "link": "https://attack.mitre.org/tactics/TA0005/",
          "description": "The adversary is trying to avoid being detected.\n\nDefense Evasion consists of techniques that adversaries use to avoid detection throughout their compromise. Techniques used for defense evasion include uninstalling/disabling security software or obfuscating/encrypting data and scripts. Adversaries also leverage and abuse trusted processes to hide and masquerade their malware. Other tactics’ techniques are cross-listed here when those techniques include the added benefit of subverting defenses. ",
          "techniques": [
            {
              "id": "T1620",
              "name": "Reflective Code Loading",
              "link": "https://attack.mitre.org/techniques/T1620/",
              "description": "Adversaries may reflectively load code into a process in order to conceal the execution of malicious payloads. Reflective loading involves allocating then executing payloads directly within the memory of the process, vice creating a thread or process backed by a file path on disk (e.g., Shared Modules).\nReflectively loaded payloads may be compiled binaries, anonymous files (only present in RAM), or just snubs of fileless executable code (ex: position-independent shellcode). For example, the Assembly.Load() method executed by PowerShell may be abused to load raw code into the running process.\nReflective code injection is very similar to Process Injection except that the “injection” loads code into the processes’ own memory instead of that of a separate process. Reflective loading may evade process-based detections since the execution of the arbitrary code may be masked within a legitimate or otherwise benign process. Reflectively loading payloads directly into memory may also avoid creating files or other artifacts on disk, while also enabling malware to keep these payloads encrypted (or otherwise obfuscated) until execution.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "invoke .NET assembly method",
                  "match_data": [
                    "api: System.Type::InvokeMember",
                    "api: System.Type::GetMethod",
                    "api: System.Reflection.MethodBase::Invoke"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "load .NET assembly",
                  "match_data": [
                    "api: System.AppDomain::Load",
                    "api: System.Reflection.Assembly::Load"
                  ]
                }
              ]
            },
            {
              "id": "T1027",
              "name": "Obfuscated Files or Information",
              "link": "https://attack.mitre.org/techniques/T1027/",
              "description": "Adversaries may attempt to make an executable or file difficult to discover or analyze by encrypting, encoding, or otherwise obfuscating its contents on the system or in transit. This is common behavior that can be used across different platforms and the network to evade defenses. \nPayloads may be compressed, archived, or encrypted in order to avoid detection. These payloads may be used during Initial Access or later to mitigate detection. Sometimes a user's action may be required to open and Deobfuscate/Decode Files or Information for User Execution. The user may also be required to input a password to open a password protected compressed/encrypted file that was provided by the adversary.  Adversaries may also use compressed or archived scripts, such as JavaScript. \nPortions of files can also be encoded to hide the plain-text strings that would otherwise help defenders with discovery.  Payloads may also be split into separate, seemingly benign files that only reveal malicious functionality when reassembled. \nAdversaries may also abuse Command Obfuscation to obscure commands executed from payloads or directly via Command and Scripting Interpreter. Environment variables, aliases, characters, and other platform/language specific semantics can be used to evade signature based detections and application control mechanisms.   ",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "encode data using Base64",
                  "match_data": [
                    "api: System.Convert::ToBase64String"
                  ]
                }
              ]
            },
            {
              "id": "T1222",
              "name": "File and Directory Permissions Modification",
              "link": "https://attack.mitre.org/techniques/T1222/",
              "description": "Adversaries may modify file or directory permissions/attributes to evade access control lists (ACLs) and access protected files. File and directory permissions are commonly managed by ACLs configured by the file or directory owner, or users with the appropriate permissions. File and directory ACL implementations vary by platform, but generally explicitly designate which users or groups can perform which actions (read, write, execute, etc.).\nModifications may include changing specific access rights, which may require taking ownership of a file or directory and/or elevated permissions depending on the file or directory’s existing permissions. This may enable malicious activity such as modifying, replacing, or deleting specific files or directories. Specific file and directory modifications may be a required step for many techniques, such as establishing Persistence via Accessibility Features, Boot or Logon Initialization Scripts, Unix Shell Configuration Modification, or tainting/hijacking other instrumental binary/configuration files via Hijack Execution Flow.\nAdversaries may also change permissions of symbolic links. For example, malware (particularly ransomware) may modify symbolic links and associated settings to enable access to files from local shortcuts with remote paths. ",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "set file attributes",
                  "match_data": [
                    "api: utime"
                  ]
                }
              ]
            },
            {
              "id": "T1140",
              "name": "Deobfuscate/Decode Files or Information",
              "link": "https://attack.mitre.org/techniques/T1140/",
              "description": "Adversaries may use Obfuscated Files or Information to hide artifacts of an intrusion from analysis. They may require separate mechanisms to decode or deobfuscate that information depending on how they intend to use it. Methods for doing that include built-in functionality of malware or by using utilities present on the system.\nOne such example is the use of certutil to decode a remote access tool portable executable file that has been hidden inside a certificate file. Another example is using the Windows copy /b or type command to reassemble binary fragments into a malicious payload.\nSometimes a user's action may be required to open it for deobfuscation or decryption as part of User Execution. The user may also be required to input a password to open a password protected compressed/encrypted file that was provided by the adversary.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "decode data using Base64 in .NET",
                  "match_data": [
                    "api: System.Convert::FromBase64String"
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0007",
          "name": "Discovery",
          "link": "https://attack.mitre.org/tactics/TA0007/",
          "description": "The adversary is trying to figure out your environment.\n\nDiscovery consists of techniques an adversary may use to gain knowledge about the system and internal network. These techniques help adversaries observe the environment and orient themselves before deciding how to act. They also allow adversaries to explore what they can control and what’s around their entry point in order to discover how it could benefit their current objective. Native operating system tools are often used toward this post-compromise information-gathering objective. ",
          "techniques": [
            {
              "id": "T1012",
              "name": "Query Registry",
              "link": "https://attack.mitre.org/techniques/T1012/",
              "description": "Adversaries may interact with the Windows Registry to gather information about the system, configuration, and installed software.\nThe Registry contains a significant amount of information about the operating system, configuration, software, and security. Information can easily be queried using the Reg utility, though other means to access the Registry exist. Some of the information may help adversaries to further their operation within a network. Adversaries may use the information from Query Registry during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "query or enumerate registry value",
                  "match_data": [
                    "api: RegQueryValueEx"
                  ]
                }
              ]
            },
            {
              "id": "T1083",
              "name": "File and Directory Discovery",
              "link": "https://attack.mitre.org/techniques/T1083/",
              "description": "Adversaries may enumerate files and directories or may search in specific locations of a host or network share for certain information within a file system. Adversaries may use the information from File and Directory Discovery during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\nMany command shell utilities can be used to obtain this information. Examples include dir, tree, ls, find, and locate. Custom tools may also be used to gather file and directory information and interact with the Native API. Adversaries may also leverage a Network Device CLI on network devices to gather file and directory information (e.g. dir, show flash, and/or nvram).\nSome files and directories may require elevated or specific user permissions to access.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "enumerate files in .NET",
                  "match_data": [
                    "api: System.IO.Directory::GetFiles"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "check if file exists",
                  "match_data": [
                    "api: System.IO.File::Exists"
                  ]
                }
              ]
            },
            {
              "id": "T1082",
              "name": "System Information Discovery",
              "link": "https://attack.mitre.org/techniques/T1082/",
              "description": "An adversary may attempt to get detailed information about the operating system and hardware, including version, patches, hotfixes, service packs, and architecture. Adversaries may use the information from System Information Discovery during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\nTools such as Systeminfo can be used to gather detailed system information. If running with privileged access, a breakdown of system data can be gathered through the systemsetup configuration tool on macOS. As an example, adversaries with user-level access can execute the df -aH command to obtain currently mounted disks and associated freely available space. Adversaries may also leverage a Network Device CLI on network devices to gather detailed system information (e.g. show version). On ESXi servers, threat actors may gather system information from various esxcli utilities, such as system hostname get, system version get, and storage filesystem list (to list storage volumes).\nInfrastructure as a Service (IaaS) cloud providers such as AWS, GCP, and Azure allow access to instance and virtual machine information via APIs. Successful authenticated API calls can return data such as the operating system platform and status of a particular instance or the model view of a virtual machine.\nSystem Information Discovery combined with information gathered from other forms of discovery and reconnaissance can drive payload development and concealment. ",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "get OS version in .NET",
                  "match_data": [
                    "property: System.OperatingSystem::Version",
                    "property: System.Environment::OSVersion"
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0002",
          "name": "Execution",
          "link": "https://attack.mitre.org/tactics/TA0002/",
          "description": "The adversary is trying to run malicious code.\n\nExecution consists of techniques that result in adversary-controlled code running on a local or remote system. Techniques that run malicious code are often paired with techniques from all other tactics to achieve broader goals, like exploring a network or stealing data. For example, an adversary might use a remote access tool to run a PowerShell script that does Remote System Discovery. ",
          "techniques": [
            {
              "id": "T1129",
              "name": "Shared Modules",
              "link": "https://attack.mitre.org/techniques/T1129/",
              "description": "Adversaries may execute malicious payloads via loading shared modules. Shared modules are executable files that are loaded into processes to provide access to reusable code, such as specific custom functions or invoking OS API functions (i.e., Native API).\nAdversaries may use this functionality as a way to execute arbitrary payloads on a victim system. For example, adversaries can modularize functionality of their malware into shared objects that perform various functions such as managing C2 network communications or execution of specific actions on objective.\nThe Linux & macOS module loader can load and execute shared objects from arbitrary local paths. This functionality resides in dlfcn.h in functions such as dlopen and dlsym. Although macOS can execute .so files, common practice uses .dylib files.\nThe Windows module loader can be instructed to load DLLs from arbitrary local paths and arbitrary Universal Naming Convention (UNC) network paths. This functionality resides in NTDLL.dll and is part of the Windows Native API which is called from functions like LoadLibrary at run time.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "link function at runtime on Linux",
                  "match_data": [
                    "api: dlsym"
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    "CAPE Sandbox": {
      "tactics": [
        {
          "id": "TA0003",
          "name": "Persistence",
          "link": "https://attack.mitre.org/tactics/TA0003/",
          "description": "The adversary is trying to maintain their foothold.\n\nPersistence consists of techniques that adversaries use to keep access to systems across restarts, changed credentials, and other interruptions that could cut off their access. Techniques used for persistence include any access, action, or configuration changes that let them maintain their foothold on systems, such as replacing or hijacking legitimate code or adding startup code. ",
          "techniques": [
            {
              "id": "T1112",
              "name": "Modify Registry",
              "link": "https://attack.mitre.org/techniques/T1112/",
              "description": "Adversaries may interact with the Windows Registry as part of a variety of other techniques to aid in defense evasion, persistence, and execution.\nAccess to specific areas of the Registry depends on account permissions, with some keys requiring administrator-level access. The built-in Windows command-line utility Reg may be used for local or remote Registry modification. Other tools, such as remote access tools, may also contain functionality to interact with the Registry through the Windows API.\nThe Registry may be modified in order to hide configuration information or malicious payloads via Obfuscated Files or Information. The Registry may also be modified to Impair Defenses, such as by enabling macros for all Microsoft Office products, allowing privilege escalation without alerting the user, increasing the maximum number of allowed outbound requests, and/or modifying systems to store plaintext credentials in memory.\nThe Registry of a remote system may be modified to aid in execution of files as part of lateral movement. It requires the remote Registry service to be running on the target system. Often Valid Accounts are required, along with access to the remote system's SMB/Windows Admin Shares for RPC communication.\nFinally, Registry modifications may also include actions to hide keys, such as prepending key names with a null character, which will cause an error and/or be ignored when read via Reg or other utilities using the Win32 API. Adversaries may abuse these pseudo-hidden keys to conceal payloads/commands used to maintain persistence.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Installs itself for autorun at Windows startup",
                  "match_data": [
                    "Process program.exe"
                  ]
                }
              ]
            },
            {
              "id": "T1547",
              "name": "Boot or Logon Autostart Execution",
              "link": "https://attack.mitre.org/techniques/T1547/",
              "description": "Adversaries may configure system settings to automatically execute a program during system boot or logon to maintain persistence or gain higher-level privileges on compromised systems. Operating systems may have mechanisms for automatically running a program on system boot or account logon. These mechanisms may include automatically executing programs that are placed in specially designated directories or are referenced by repositories that store configuration information, such as the Windows Registry. An adversary may achieve the same goal by modifying or extending features of the kernel.\nSince some boot or logon autostart programs run with higher privileges, an adversary may leverage these to elevate privileges.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Installs itself for autorun at Windows startup",
                  "match_data": [
                    "Process program.exe"
                  ]
                }
              ]
            },
            {
              "id": "T1547.001",
              "name": "Registry Run Keys / Startup Folder",
              "link": "https://attack.mitre.org/techniques/T1547/001/",
              "description": "Adversaries may achieve persistence by adding a program to a startup folder or referencing it with a Registry run key. Adding an entry to the \"run keys\" in the Registry or startup folder will cause the program referenced to be executed when a user logs in. These programs will be executed under the context of the user and will have the account's associated permissions level.\nThe following run keys are created by default on Windows systems:\n\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnce\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnce\n\nRun keys may exist under multiple hives. The HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnceEx is also available but is not created by default on Windows Vista and newer. Registry run key entries can reference programs directly or list them as a dependency. For example, it is possible to load a DLL at logon using a \"Depend\" key with RunOnceEx: reg add HKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\RunOnceEx\\0001\\Depend /v 1 /d \"C:\\temp\\evil[.]dll\" \nPlacing a program within a startup folder will also cause that program to execute when a user logs in. There is a startup folder location for individual user accounts as well as a system-wide startup folder that will be checked regardless of which user account logs in. The startup folder path for the current user is C:\\Users\\[Username]\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup. The startup folder path for all users is C:\\ProgramData\\Microsoft\\Windows\\Start Menu\\Programs\\StartUp.\nThe following Registry keys can be used to set startup folder items for persistence:\n\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell Folders\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Shell Folders\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Shell Folders\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell Folders\n\nThe following Registry keys can control automatic startup of services during boot:\n\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServicesOnce\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServicesOnce\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServices\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServices\n\nUsing policy settings to specify startup programs creates corresponding values in either of two Registry keys:\n\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer\\Run\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer\\Run\n\nPrograms listed in the load value of the registry key HKEY_CURRENT_USER\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Windows run automatically for the currently logged-on user.\nBy default, the multistring BootExecute value of the registry key HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\Session Manager is set to autocheck autochk *. This value causes Windows, at startup, to check the file-system integrity of the hard disks if the system has been shut down abnormally. Adversaries can add other programs or processes to this registry value which will automatically launch at boot.\nAdversaries can use these configuration locations to execute malware, such as remote access tools, to maintain persistence through system reboots. Adversaries may also use Masquerading to make the Registry entries look as if they are associated with legitimate programs.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Installs itself for autorun at Windows startup",
                  "match_data": [
                    "Process program.exe"
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0005",
          "name": "Defense Evasion",
          "link": "https://attack.mitre.org/tactics/TA0005/",
          "description": "The adversary is trying to avoid being detected.\n\nDefense Evasion consists of techniques that adversaries use to avoid detection throughout their compromise. Techniques used for defense evasion include uninstalling/disabling security software or obfuscating/encrypting data and scripts. Adversaries also leverage and abuse trusted processes to hide and masquerade their malware. Other tactics’ techniques are cross-listed here when those techniques include the added benefit of subverting defenses. ",
          "techniques": [
            {
              "id": "T1112",
              "name": "Modify Registry",
              "link": "https://attack.mitre.org/techniques/T1112/",
              "description": "Adversaries may interact with the Windows Registry as part of a variety of other techniques to aid in defense evasion, persistence, and execution.\nAccess to specific areas of the Registry depends on account permissions, with some keys requiring administrator-level access. The built-in Windows command-line utility Reg may be used for local or remote Registry modification. Other tools, such as remote access tools, may also contain functionality to interact with the Registry through the Windows API.\nThe Registry may be modified in order to hide configuration information or malicious payloads via Obfuscated Files or Information. The Registry may also be modified to Impair Defenses, such as by enabling macros for all Microsoft Office products, allowing privilege escalation without alerting the user, increasing the maximum number of allowed outbound requests, and/or modifying systems to store plaintext credentials in memory.\nThe Registry of a remote system may be modified to aid in execution of files as part of lateral movement. It requires the remote Registry service to be running on the target system. Often Valid Accounts are required, along with access to the remote system's SMB/Windows Admin Shares for RPC communication.\nFinally, Registry modifications may also include actions to hide keys, such as prepending key names with a null character, which will cause an error and/or be ignored when read via Reg or other utilities using the Win32 API. Adversaries may abuse these pseudo-hidden keys to conceal payloads/commands used to maintain persistence.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Installs itself for autorun at Windows startup",
                  "match_data": [
                    "Process program.exe"
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0004",
          "name": "Privilege Escalation",
          "link": "https://attack.mitre.org/tactics/TA0004/",
          "description": "The adversary is trying to gain higher-level permissions.\n\nPrivilege Escalation consists of techniques that adversaries use to gain higher-level permissions on a system or network. Adversaries can often enter and explore a network with unprivileged access but require elevated permissions to follow through on their objectives. Common approaches are to take advantage of system weaknesses, misconfigurations, and vulnerabilities. Examples of elevated access include: \n\n* SYSTEM/root level\n* local administrator\n* user account with admin-like access \n* user accounts with access to specific system or perform specific function\n\nThese techniques often overlap with Persistence techniques, as OS features that let an adversary persist can execute in an elevated context.  ",
          "techniques": [
            {
              "id": "T1547",
              "name": "Boot or Logon Autostart Execution",
              "link": "https://attack.mitre.org/techniques/T1547/",
              "description": "Adversaries may configure system settings to automatically execute a program during system boot or logon to maintain persistence or gain higher-level privileges on compromised systems. Operating systems may have mechanisms for automatically running a program on system boot or account logon. These mechanisms may include automatically executing programs that are placed in specially designated directories or are referenced by repositories that store configuration information, such as the Windows Registry. An adversary may achieve the same goal by modifying or extending features of the kernel.\nSince some boot or logon autostart programs run with higher privileges, an adversary may leverage these to elevate privileges.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Installs itself for autorun at Windows startup",
                  "match_data": [
                    "Process program.exe"
                  ]
                }
              ]
            },
            {
              "id": "T1547.001",
              "name": "Registry Run Keys / Startup Folder",
              "link": "https://attack.mitre.org/techniques/T1547/001/",
              "description": "Adversaries may achieve persistence by adding a program to a startup folder or referencing it with a Registry run key. Adding an entry to the \"run keys\" in the Registry or startup folder will cause the program referenced to be executed when a user logs in. These programs will be executed under the context of the user and will have the account's associated permissions level.\nThe following run keys are created by default on Windows systems:\n\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnce\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnce\n\nRun keys may exist under multiple hives. The HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnceEx is also available but is not created by default on Windows Vista and newer. Registry run key entries can reference programs directly or list them as a dependency. For example, it is possible to load a DLL at logon using a \"Depend\" key with RunOnceEx: reg add HKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\RunOnceEx\\0001\\Depend /v 1 /d \"C:\\temp\\evil[.]dll\" \nPlacing a program within a startup folder will also cause that program to execute when a user logs in. There is a startup folder location for individual user accounts as well as a system-wide startup folder that will be checked regardless of which user account logs in. The startup folder path for the current user is C:\\Users\\[Username]\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup. The startup folder path for all users is C:\\ProgramData\\Microsoft\\Windows\\Start Menu\\Programs\\StartUp.\nThe following Registry keys can be used to set startup folder items for persistence:\n\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell Folders\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Shell Folders\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Shell Folders\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell Folders\n\nThe following Registry keys can control automatic startup of services during boot:\n\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServicesOnce\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServicesOnce\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServices\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServices\n\nUsing policy settings to specify startup programs creates corresponding values in either of two Registry keys:\n\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer\\Run\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer\\Run\n\nPrograms listed in the load value of the registry key HKEY_CURRENT_USER\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Windows run automatically for the currently logged-on user.\nBy default, the multistring BootExecute value of the registry key HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\Session Manager is set to autocheck autochk *. This value causes Windows, at startup, to check the file-system integrity of the hard disks if the system has been shut down abnormally. Adversaries can add other programs or processes to this registry value which will automatically launch at boot.\nAdversaries can use these configuration locations to execute malware, such as remote access tools, to maintain persistence through system reboots. Adversaries may also use Masquerading to make the Registry entries look as if they are associated with legitimate programs.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Installs itself for autorun at Windows startup",
                  "match_data": [
                    "Process program.exe"
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0007",
          "name": "Discovery",
          "link": "https://attack.mitre.org/tactics/TA0007/",
          "description": "The adversary is trying to figure out your environment.\n\nDiscovery consists of techniques an adversary may use to gain knowledge about the system and internal network. These techniques help adversaries observe the environment and orient themselves before deciding how to act. They also allow adversaries to explore what they can control and what’s around their entry point in order to discover how it could benefit their current objective. Native operating system tools are often used toward this post-compromise information-gathering objective. ",
          "techniques": [
            {
              "id": "T1082",
              "name": "System Information Discovery",
              "link": "https://attack.mitre.org/techniques/T1082/",
              "description": "An adversary may attempt to get detailed information about the operating system and hardware, including version, patches, hotfixes, service packs, and architecture. Adversaries may use the information from System Information Discovery during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\nTools such as Systeminfo can be used to gather detailed system information. If running with privileged access, a breakdown of system data can be gathered through the systemsetup configuration tool on macOS. As an example, adversaries with user-level access can execute the df -aH command to obtain currently mounted disks and associated freely available space. Adversaries may also leverage a Network Device CLI on network devices to gather detailed system information (e.g. show version). On ESXi servers, threat actors may gather system information from various esxcli utilities, such as system hostname get, system version get, and storage filesystem list (to list storage volumes).\nInfrastructure as a Service (IaaS) cloud providers such as AWS, GCP, and Azure allow access to instance and virtual machine information via APIs. Successful authenticated API calls can return data such as the operating system platform and status of a particular instance or the model view of a virtual machine.\nSystem Information Discovery combined with information gathered from other forms of discovery and reconnaissance can drive payload development and concealment. ",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Checks available memory",
                  "match_data": [
                    "Process program.exe"
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0011",
          "name": "Command and Control",
          "link": "https://attack.mitre.org/tactics/TA0011/",
          "description": "The adversary is trying to communicate with compromised systems to control them.\n\nCommand and Control consists of techniques that adversaries may use to communicate with systems under their control within a victim network. Adversaries commonly attempt to mimic normal, expected traffic to avoid detection. There are many ways an adversary can establish command and control with various levels of stealth depending on the victim’s network structure and defenses.",
          "techniques": [
            {
              "id": "T1071",
              "name": "Application Layer Protocol",
              "link": "https://attack.mitre.org/techniques/T1071/",
              "description": "Adversaries may communicate using OSI application layer protocols to avoid detection/network filtering by blending in with existing traffic. Commands to the remote system, and often the results of those commands, will be embedded within the protocol traffic between the client and server. \nAdversaries may utilize many different protocols, including those used for web browsing, transferring files, electronic mail, DNS, or publishing/subscribing. For connections that occur internally within an enclave (such as those between a proxy or pivot node and other nodes), commonly used protocols are SMB, SSH, or RDP. ",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Reads from the memory of another process",
                  "match_data": [
                    "Process program.exe with process ID 5168 read from the memory of process handle 0x00000868",
                    "Process program.exe"
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "Reads data out of its own binary image",
                  "match_data": [
                    "process: program.exe, pid: 5168, offset: 0x00000000, length: 0x00054e00"
                  ]
                },
                {
                  "severity": "MEDIUM",
                  "description": "Yara detections observed in process dumps, payloads or dropped files",
                  "match_data": [
                    "Yara rule 'A310Logger' with data '['T\\x00e\\x00m\\x00p\\x00o\\x00r\\x00a\\x00r\\x00y\\x00 \\x00D\\x00i\\x00r\\x00e\\x00c\\x00t\\x00o\\x00r\\x00y\\x00 \\x00*\\x00 \\x00f\\x00o\\x00r\\x00', 'H\\x00K\\x00C\\x00U\\x00\\\\\\x00S\\x00O\\x00F\\x00T\\x00W\\x00A\\x00R\\x00E\\x00\\\\\\x00M\\x00i\\x00c\\x00r\\x00o\\x00s\\x00o\\x00f\\x00t\\x00\\\\\\x00W\\x00i\\x00n\\x00d\\x00o\\x00w\\x00s\\x00\\\\\\x00C\\x00u\\x00r\\x00r\\x00e\\x00n\\x00t\\x00V\\x00e\\x00r\\x00s\\x00i\\x00o\\x00n\\x00\\\\\\x00R\\x00u\\x00n\\x00O\\x00n\\x00c\\x00e\\x00\\\\\\x00*\\x00R\\x00D\\x00_\\x00', 'E\\x00x\\x00e\\x00c\\x00Q\\x00u\\x00e\\x00r\\x00y\\x00', 'C\\x00o\\x00n\\x00t\\x00e\\x00n\\x00t\\x00-\\x00D\\x00i\\x00s\\x00p\\x00o\\x00s\\x00i\\x00t\\x00i\\x00o\\x00n\\x00:\\x00 \\x00f\\x00o\\x00r\\x00m\\x00-\\x00d\\x00a\\x00t\\x00a\\x00;\\x00 \\x00n\\x00a\\x00m\\x00e\\x00=\\x00\"\\x00d\\x00o\\x00c\\x00u\\x00m\\x00e\\x00n\\x00t\\x00\"\\x00;\\x00 \\x00f\\x00i\\x00l\\x00e\\x00n\\x00a\\x00m\\x00e\\x00=\\x00\"\\x00', 'C\\x00o\\x00p\\x00y\\x00H\\x00e\\x00r\\x00e\\x00', 'S\\x00h\\x00e\\x00l\\x00l\\x00.\\x00A\\x00p\\x00p\\x00l\\x00i\\x00c\\x00a\\x00t\\x00i\\x00o\\x00n\\x00', '@\\x00T\\x00I\\x00T\\x00L\\x00E\\x00 \\x00R\\x00e\\x00m\\x00o\\x00v\\x00i\\x00n\\x00g\\x00', '@\\x00R\\x00D\\x00 \\x00/\\x00S\\x00 \\x00/\\x00Q\\x00 \\x00\"\\x00', 'A\\x00d\\x00d\\x00A\\x00t\\x00t\\x00a\\x00c\\x00h\\x00m\\x00e\\x00n\\x00t\\x00']'"
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "At least one IP Address, Domain, or File Name was found in a crypto call",
                  "match_data": [
                    "Process program.exe",
                    "x00.text"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "Attempts to connect to a dead IP:Port",
                  "match_data": [
                    "Process program.exe",
                    "192.99.207.151:443 (unknown)"
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "Terminates another process",
                  "match_data": [
                    "Process program.exe",
                    "program.exe"
                  ]
                }
              ]
            },
            {
              "id": "T1573",
              "name": "Encrypted Channel",
              "link": "https://attack.mitre.org/techniques/T1573/",
              "description": "Adversaries may employ an encryption algorithm to conceal command and control traffic rather than relying on any inherent protections provided by a communication protocol. Despite the use of a secure algorithm, these implementations may be vulnerable to reverse engineering if secret keys are encoded and/or generated within malware samples/configuration files.",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Establishes an encrypted HTTPS connection",
                  "match_data": [
                    "GET /Itnihfkvy.dat HTTP/1.1\r\nHost: www.arcon.com.pe\r\nConnection: Keep-Alive\r\n\r\n",
                    "Process program.exe"
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0002",
          "name": "Execution",
          "link": "https://attack.mitre.org/tactics/TA0002/",
          "description": "The adversary is trying to run malicious code.\n\nExecution consists of techniques that result in adversary-controlled code running on a local or remote system. Techniques that run malicious code are often paired with techniques from all other tactics to achieve broader goals, like exploring a network or stealing data. For example, an adversary might use a remote access tool to run a PowerShell script that does Remote System Discovery. ",
          "techniques": [
            {
              "id": "T1106",
              "name": "Native API",
              "link": "https://attack.mitre.org/techniques/T1106/",
              "description": "Adversaries may interact with the native OS application programming interface (API) to execute behaviors. Native APIs provide a controlled means of calling low-level OS services within the kernel, such as those involving hardware/devices, memory, and processes. These native APIs are leveraged by the OS during system boot (when other system components are not yet initialized) as well as carrying out tasks and requests during routine operations.\nAdversaries may abuse these OS API functions as a means of executing behaviors. Similar to Command and Scripting Interpreter, the native API and its hierarchy of interfaces provide mechanisms to interact with and utilize various components of a victimized system.\nNative API functions (such as NtCreateProcess) may be directed invoked via system calls / syscalls, but these features are also often exposed to user-mode applications via interfaces and libraries. For example, functions such as the Windows API CreateProcess() or GNU fork() will allow programs and scripts to start other processes. This may allow API callers to execute a binary, run a CLI command, load modules, etc. as thousands of similar API functions exist for various system operations.\nHigher level software frameworks, such as Microsoft .NET and macOS Cocoa, are also available to interact with native APIs. These frameworks typically provide language wrappers/abstractions to API functionalities and are designed for ease-of-use/portability of code.\nAdversaries may use assembly to directly or in-directly invoke syscalls in an attempt to subvert defensive sensors and detection signatures such as user mode API-hooks. Adversaries may also attempt to tamper with sensors and defensive tools associated with API monitoring, such as unhooking monitored functions via Disable or Modify Tools.",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Guard pages use detected - possible anti-debugging.",
                  "match_data": [
                    "Process program.exe"
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    "VMRay": {
      "tactics": [
        {
          "id": "TA0005",
          "name": "Defense Evasion",
          "link": "https://attack.mitre.org/tactics/TA0005/",
          "description": "The adversary is trying to avoid being detected.\n\nDefense Evasion consists of techniques that adversaries use to avoid detection throughout their compromise. Techniques used for defense evasion include uninstalling/disabling security software or obfuscating/encrypting data and scripts. Adversaries also leverage and abuse trusted processes to hide and masquerade their malware. Other tactics’ techniques are cross-listed here when those techniques include the added benefit of subverting defenses. ",
          "techniques": [
            {
              "id": "T1006",
              "name": "Direct Volume Access",
              "link": "https://attack.mitre.org/techniques/T1006/",
              "description": "Adversaries may directly access a volume to bypass file access controls and file system monitoring. Windows allows programs to have direct access to logical volumes. Programs with direct access may read and write files directly from the drive by analyzing file system data structures. This technique may bypass Windows file access controls as well as file system monitoring tools. \nUtilities, such as NinjaCopy, exist to perform these actions in PowerShell. Adversaries may also use built-in or third-party utilities (such as vssadmin, wbadmin, and esentutl) to create shadow copies or backups of data from system volumes.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Accesses volumes directly",
                  "match_data": [
                    "wmiprvse.exe opens a handle to directly access the volume \"C\"."
                  ]
                }
              ]
            },
            {
              "id": "T1027",
              "name": "Obfuscated Files or Information",
              "link": "https://attack.mitre.org/techniques/T1027/",
              "description": "Adversaries may attempt to make an executable or file difficult to discover or analyze by encrypting, encoding, or otherwise obfuscating its contents on the system or in transit. This is common behavior that can be used across different platforms and the network to evade defenses. \nPayloads may be compressed, archived, or encrypted in order to avoid detection. These payloads may be used during Initial Access or later to mitigate detection. Sometimes a user's action may be required to open and Deobfuscate/Decode Files or Information for User Execution. The user may also be required to input a password to open a password protected compressed/encrypted file that was provided by the adversary.  Adversaries may also use compressed or archived scripts, such as JavaScript. \nPortions of files can also be encoded to hide the plain-text strings that would otherwise help defenders with discovery.  Payloads may also be split into separate, seemingly benign files that only reveal malicious functionality when reassembled. \nAdversaries may also abuse Command Obfuscation to obscure commands executed from payloads or directly via Command and Scripting Interpreter. Environment variables, aliases, characters, and other platform/language specific semantics can be used to evade signature based detections and application control mechanisms.   "
            },
            {
              "id": "T1027.002",
              "name": "Software Packing",
              "link": "https://attack.mitre.org/techniques/T1027/002/",
              "description": "Adversaries may perform software packing or virtual machine software protection to conceal their code. Software packing is a method of compressing or encrypting an executable. Packing an executable changes the file signature in an attempt to avoid signature-based detection. Most decompression techniques decompress the executable code in memory. Virtual machine software protection translates an executable's original code into a special format that only a special virtual machine can run. A virtual machine is then called to run this code. \nUtilities used to perform software packing are called packers. Example packers are MPRESS and UPX. A more comprehensive list of known packers is available, but adversaries may create their own packing techniques that do not leave the same artifacts as well-known packers to evade defenses.  ",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Creates a page with write and execute permissions",
                  "match_data": [
                    "transferencia interbancaria (bbva).exe allocates a page in a foreign process with \"PAGE_EXECUTE_READWRITE\" permissions, often used to dynamically unpack code.",
                    "installutil.exe changes the protection of a page from writable (\"PAGE_READWRITE\") to executable (\"PAGE_EXECUTE_READ\").",
                    "typeid.exe changes the protection of a page from writable (\"PAGE_READWRITE\") to executable (\"PAGE_EXECUTE_READWRITE\").",
                    "typeid.exe allocates a page in a foreign process with \"PAGE_EXECUTE_READWRITE\" permissions, often used to dynamically unpack code."
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "Resolves API functions dynamically",
                  "match_data": [
                    "installutil.exe resolves 69 API functions by name.",
                    "wmiprvse.exe resolves 42 API functions by name."
                  ]
                }
              ]
            },
            {
              "id": "T1055",
              "name": "Process Injection",
              "link": "https://attack.mitre.org/techniques/T1055/",
              "description": "Adversaries may inject code into processes in order to evade process-based defenses as well as possibly elevate privileges. Process injection is a method of executing arbitrary code in the address space of a separate live process. Running code in the context of another process may allow access to the process's memory, system/network resources, and possibly elevated privileges. Execution via process injection may also evade detection from security products since the execution is masked under a legitimate process. \nThere are many different ways to inject code into a process, many of which abuse legitimate functionalities. These implementations exist for every major OS but are typically platform specific. \nMore sophisticated samples may perform multiple process injections to segment modules and further evade detection, utilizing named pipes or other inter-process communication (IPC) mechanisms as a communication channel. ",
              "signatures": [
                {
                  "severity": "HIGH",
                  "description": "Writes into the memory of another process",
                  "match_data": [
                    "transferencia interbancaria (bbva).exe modifies memory of (process #2) installutil.exe.",
                    "typeid.exe modifies memory of (process #8) installutil.exe."
                  ]
                },
                {
                  "severity": "HIGH",
                  "description": "Modifies control flow of another process",
                  "match_data": [
                    "transferencia interbancaria (bbva).exe alters context of (process #2) installutil.exe.",
                    "typeid.exe alters context of (process #8) installutil.exe."
                  ]
                }
              ]
            },
            {
              "id": "T1055.012",
              "name": "Process Hollowing",
              "link": "https://attack.mitre.org/techniques/T1055/012/",
              "description": "Adversaries may inject malicious code into suspended and hollowed processes in order to evade process-based defenses. Process hollowing is a method of executing arbitrary code in the address space of a separate live process.  \nProcess hollowing is commonly performed by creating a process in a suspended state then unmapping/hollowing its memory, which can then be replaced with malicious code. A victim process can be created with native Windows API calls such as CreateProcess, which includes a flag to suspend the processes primary thread. At this point the process can be unmapped using APIs calls such as ZwUnmapViewOfSection or NtUnmapViewOfSection  before being written to, realigned to the injected code, and resumed via VirtualAllocEx, WriteProcessMemory, SetThreadContext, then ResumeThread respectively.\nThis is very similar to Thread Local Storage but creates a new process rather than targeting an existing process. This behavior will likely not result in elevated privileges since the injected process was spawned from (and thus inherits the security context) of the injecting process. However, execution via process hollowing may also evade detection from security products since the execution is masked under a legitimate process. ",
              "signatures": [
                {
                  "severity": "HIGH",
                  "description": "Process Hollowing",
                  "match_data": [
                    "transferencia interbancaria (bbva).exe hollows (process #2) installutil.exe.",
                    "typeid.exe hollows (process #8) installutil.exe."
                  ]
                }
              ]
            },
            {
              "id": "T1134",
              "name": "Access Token Manipulation",
              "link": "https://attack.mitre.org/techniques/T1134/",
              "description": "Adversaries may modify access tokens to operate under a different user or system security context to perform actions and bypass access controls. Windows uses access tokens to determine the ownership of a running process. A user can manipulate access tokens to make a running process appear as though it is the child of a different process or belongs to someone other than the user that started the process. When this occurs, the process also takes on the security context associated with the new token.\nAn adversary can use built-in Windows API functions to copy access tokens from existing processes; this is known as token stealing. These token can then be applied to an existing process (i.e. Token Impersonation/Theft) or used to spawn a new process (i.e. Create Process with Token). An adversary must already be in a privileged user context (i.e. administrator) to steal a token. However, adversaries commonly use token stealing to elevate their security context from the administrator level to the SYSTEM level. An adversary can then use a token to authenticate to a remote system as the account for that token if the account has appropriate permissions on the remote system.\nAny standard user can use the runas command, and the Windows API functions, to create impersonation tokens; it does not require access to an administrator account. There are also other mechanisms, such as Active Directory fields, that can be used to modify access tokens.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Enables process privileges",
                  "match_data": [
                    "transferencia interbancaria (bbva).exe enables process privilege \"SeDebugPrivilege\".",
                    "wmiprvse.exe enables process privilege \"SeDebugPrivilege\".",
                    "typeid.exe enables process privilege \"SeDebugPrivilege\"."
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0007",
          "name": "Discovery",
          "link": "https://attack.mitre.org/tactics/TA0007/",
          "description": "The adversary is trying to figure out your environment.\n\nDiscovery consists of techniques an adversary may use to gain knowledge about the system and internal network. These techniques help adversaries observe the environment and orient themselves before deciding how to act. They also allow adversaries to explore what they can control and what’s around their entry point in order to discover how it could benefit their current objective. Native operating system tools are often used toward this post-compromise information-gathering objective. ",
          "techniques": [
            {
              "id": "T1012",
              "name": "Query Registry",
              "link": "https://attack.mitre.org/techniques/T1012/",
              "description": "Adversaries may interact with the Windows Registry to gather information about the system, configuration, and installed software.\nThe Registry contains a significant amount of information about the operating system, configuration, software, and security. Information can easily be queried using the Reg utility, though other means to access the Registry exist. Some of the information may help adversaries to further their operation within a network. Adversaries may use the information from Query Registry during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Query OS Information",
                  "match_data": [
                    "transferencia interbancaria (bbva).exe reads installation type from registry.",
                    "typeid.exe reads installation type from registry."
                  ]
                }
              ]
            },
            {
              "id": "T1082",
              "name": "System Information Discovery",
              "link": "https://attack.mitre.org/techniques/T1082/",
              "description": "An adversary may attempt to get detailed information about the operating system and hardware, including version, patches, hotfixes, service packs, and architecture. Adversaries may use the information from System Information Discovery during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\nTools such as Systeminfo can be used to gather detailed system information. If running with privileged access, a breakdown of system data can be gathered through the systemsetup configuration tool on macOS. As an example, adversaries with user-level access can execute the df -aH command to obtain currently mounted disks and associated freely available space. Adversaries may also leverage a Network Device CLI on network devices to gather detailed system information (e.g. show version). On ESXi servers, threat actors may gather system information from various esxcli utilities, such as system hostname get, system version get, and storage filesystem list (to list storage volumes).\nInfrastructure as a Service (IaaS) cloud providers such as AWS, GCP, and Azure allow access to instance and virtual machine information via APIs. Successful authenticated API calls can return data such as the operating system platform and status of a particular instance or the model view of a virtual machine.\nSystem Information Discovery combined with information gathered from other forms of discovery and reconnaissance can drive payload development and concealment. ",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Query OS Information",
                  "match_data": [
                    "transferencia interbancaria (bbva).exe reads installation type from registry.",
                    "typeid.exe reads installation type from registry."
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "Enumerates running processes",
                  "match_data": [
                    "installutil.exe enumerates running processes via WMI query Select * from Win32_Process."
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "Collects hardware properties",
                  "match_data": [
                    "installutil.exe queries hardware properties via WMI: Select * from Win32_LogicalDisk.",
                    "installutil.exe queries hardware properties via WMI: Select * from Win32_ComputerSystem.",
                    "installutil.exe queries hardware properties via WMI: SELECT * FROM Win32_Processor."
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0002",
          "name": "Execution",
          "link": "https://attack.mitre.org/tactics/TA0002/",
          "description": "The adversary is trying to run malicious code.\n\nExecution consists of techniques that result in adversary-controlled code running on a local or remote system. Techniques that run malicious code are often paired with techniques from all other tactics to achieve broader goals, like exploring a network or stealing data. For example, an adversary might use a remote access tool to run a PowerShell script that does Remote System Discovery. ",
          "techniques": [
            {
              "id": "T1047",
              "name": "Windows Management Instrumentation",
              "link": "https://attack.mitre.org/techniques/T1047/",
              "description": "Adversaries may abuse Windows Management Instrumentation (WMI) to execute malicious commands and payloads. WMI is designed for programmers and is the infrastructure for management data and operations on Windows systems. WMI is an administration feature that provides a uniform environment to access Windows system components.\nThe WMI service enables both local and remote access, though the latter is facilitated by Remote Services such as Distributed Component Object Model and Windows Remote Management. Remote WMI over DCOM operates using port 135, whereas WMI over WinRM operates over port 5985 when using HTTP and 5986 for HTTPS. \nAn adversary can use WMI to interact with local and remote systems and use it as a means to execute various behaviors, such as gathering information for Discovery as well as Execution of commands and payloads. For example, wmic.exe can be abused by an adversary to delete shadow copies with the command wmic.exe Shadowcopy Delete (i.e., Inhibit System Recovery).\nNote: wmic.exe is deprecated as of January of 2024, with the WMIC feature being “disabled by default” on Windows 11+. WMIC will be removed from subsequent Windows releases and replaced by PowerShell as the primary WMI interface. In addition to PowerShell and tools like wbemtool.exe, COM APIs can also be used to programmatically interact with WMI via C++, .NET, VBScript, etc.",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Enumerates running processes",
                  "match_data": [
                    "installutil.exe enumerates running processes via WMI query Select * from Win32_Process."
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "Collects hardware properties",
                  "match_data": [
                    "installutil.exe queries hardware properties via WMI: Select * from Win32_LogicalDisk.",
                    "installutil.exe queries hardware properties via WMI: Select * from Win32_ComputerSystem.",
                    "installutil.exe queries hardware properties via WMI: SELECT * FROM Win32_Processor."
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0004",
          "name": "Privilege Escalation",
          "link": "https://attack.mitre.org/tactics/TA0004/",
          "description": "The adversary is trying to gain higher-level permissions.\n\nPrivilege Escalation consists of techniques that adversaries use to gain higher-level permissions on a system or network. Adversaries can often enter and explore a network with unprivileged access but require elevated permissions to follow through on their objectives. Common approaches are to take advantage of system weaknesses, misconfigurations, and vulnerabilities. Examples of elevated access include: \n\n* SYSTEM/root level\n* local administrator\n* user account with admin-like access \n* user accounts with access to specific system or perform specific function\n\nThese techniques often overlap with Persistence techniques, as OS features that let an adversary persist can execute in an elevated context.  ",
          "techniques": [
            {
              "id": "T1055",
              "name": "Process Injection",
              "link": "https://attack.mitre.org/techniques/T1055/",
              "description": "Adversaries may inject code into processes in order to evade process-based defenses as well as possibly elevate privileges. Process injection is a method of executing arbitrary code in the address space of a separate live process. Running code in the context of another process may allow access to the process's memory, system/network resources, and possibly elevated privileges. Execution via process injection may also evade detection from security products since the execution is masked under a legitimate process. \nThere are many different ways to inject code into a process, many of which abuse legitimate functionalities. These implementations exist for every major OS but are typically platform specific. \nMore sophisticated samples may perform multiple process injections to segment modules and further evade detection, utilizing named pipes or other inter-process communication (IPC) mechanisms as a communication channel. ",
              "signatures": [
                {
                  "severity": "HIGH",
                  "description": "Writes into the memory of another process",
                  "match_data": [
                    "transferencia interbancaria (bbva).exe modifies memory of (process #2) installutil.exe.",
                    "typeid.exe modifies memory of (process #8) installutil.exe."
                  ]
                },
                {
                  "severity": "HIGH",
                  "description": "Modifies control flow of another process",
                  "match_data": [
                    "transferencia interbancaria (bbva).exe alters context of (process #2) installutil.exe.",
                    "typeid.exe alters context of (process #8) installutil.exe."
                  ]
                }
              ]
            },
            {
              "id": "T1055.012",
              "name": "Process Hollowing",
              "link": "https://attack.mitre.org/techniques/T1055/012/",
              "description": "Adversaries may inject malicious code into suspended and hollowed processes in order to evade process-based defenses. Process hollowing is a method of executing arbitrary code in the address space of a separate live process.  \nProcess hollowing is commonly performed by creating a process in a suspended state then unmapping/hollowing its memory, which can then be replaced with malicious code. A victim process can be created with native Windows API calls such as CreateProcess, which includes a flag to suspend the processes primary thread. At this point the process can be unmapped using APIs calls such as ZwUnmapViewOfSection or NtUnmapViewOfSection  before being written to, realigned to the injected code, and resumed via VirtualAllocEx, WriteProcessMemory, SetThreadContext, then ResumeThread respectively.\nThis is very similar to Thread Local Storage but creates a new process rather than targeting an existing process. This behavior will likely not result in elevated privileges since the injected process was spawned from (and thus inherits the security context) of the injecting process. However, execution via process hollowing may also evade detection from security products since the execution is masked under a legitimate process. ",
              "signatures": [
                {
                  "severity": "HIGH",
                  "description": "Process Hollowing",
                  "match_data": [
                    "transferencia interbancaria (bbva).exe hollows (process #2) installutil.exe.",
                    "typeid.exe hollows (process #8) installutil.exe."
                  ]
                }
              ]
            },
            {
              "id": "T1134",
              "name": "Access Token Manipulation",
              "link": "https://attack.mitre.org/techniques/T1134/",
              "description": "Adversaries may modify access tokens to operate under a different user or system security context to perform actions and bypass access controls. Windows uses access tokens to determine the ownership of a running process. A user can manipulate access tokens to make a running process appear as though it is the child of a different process or belongs to someone other than the user that started the process. When this occurs, the process also takes on the security context associated with the new token.\nAn adversary can use built-in Windows API functions to copy access tokens from existing processes; this is known as token stealing. These token can then be applied to an existing process (i.e. Token Impersonation/Theft) or used to spawn a new process (i.e. Create Process with Token). An adversary must already be in a privileged user context (i.e. administrator) to steal a token. However, adversaries commonly use token stealing to elevate their security context from the administrator level to the SYSTEM level. An adversary can then use a token to authenticate to a remote system as the account for that token if the account has appropriate permissions on the remote system.\nAny standard user can use the runas command, and the Windows API functions, to create impersonation tokens; it does not require access to an administrator account. There are also other mechanisms, such as Active Directory fields, that can be used to modify access tokens.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Enables process privileges",
                  "match_data": [
                    "transferencia interbancaria (bbva).exe enables process privilege \"SeDebugPrivilege\".",
                    "wmiprvse.exe enables process privilege \"SeDebugPrivilege\".",
                    "typeid.exe enables process privilege \"SeDebugPrivilege\"."
                  ]
                }
              ]
            },
            {
              "id": "T1547",
              "name": "Boot or Logon Autostart Execution",
              "link": "https://attack.mitre.org/techniques/T1547/",
              "description": "Adversaries may configure system settings to automatically execute a program during system boot or logon to maintain persistence or gain higher-level privileges on compromised systems. Operating systems may have mechanisms for automatically running a program on system boot or account logon. These mechanisms may include automatically executing programs that are placed in specially designated directories or are referenced by repositories that store configuration information, such as the Windows Registry. An adversary may achieve the same goal by modifying or extending features of the kernel.\nSince some boot or logon autostart programs run with higher privileges, an adversary may leverage these to elevate privileges."
            },
            {
              "id": "T1547.001",
              "name": "Registry Run Keys / Startup Folder",
              "link": "https://attack.mitre.org/techniques/T1547/001/",
              "description": "Adversaries may achieve persistence by adding a program to a startup folder or referencing it with a Registry run key. Adding an entry to the \"run keys\" in the Registry or startup folder will cause the program referenced to be executed when a user logs in. These programs will be executed under the context of the user and will have the account's associated permissions level.\nThe following run keys are created by default on Windows systems:\n\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnce\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnce\n\nRun keys may exist under multiple hives. The HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnceEx is also available but is not created by default on Windows Vista and newer. Registry run key entries can reference programs directly or list them as a dependency. For example, it is possible to load a DLL at logon using a \"Depend\" key with RunOnceEx: reg add HKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\RunOnceEx\\0001\\Depend /v 1 /d \"C:\\temp\\evil[.]dll\" \nPlacing a program within a startup folder will also cause that program to execute when a user logs in. There is a startup folder location for individual user accounts as well as a system-wide startup folder that will be checked regardless of which user account logs in. The startup folder path for the current user is C:\\Users\\[Username]\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup. The startup folder path for all users is C:\\ProgramData\\Microsoft\\Windows\\Start Menu\\Programs\\StartUp.\nThe following Registry keys can be used to set startup folder items for persistence:\n\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell Folders\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Shell Folders\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Shell Folders\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell Folders\n\nThe following Registry keys can control automatic startup of services during boot:\n\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServicesOnce\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServicesOnce\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServices\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServices\n\nUsing policy settings to specify startup programs creates corresponding values in either of two Registry keys:\n\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer\\Run\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer\\Run\n\nPrograms listed in the load value of the registry key HKEY_CURRENT_USER\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Windows run automatically for the currently logged-on user.\nBy default, the multistring BootExecute value of the registry key HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\Session Manager is set to autocheck autochk *. This value causes Windows, at startup, to check the file-system integrity of the hard disks if the system has been shut down abnormally. Adversaries can add other programs or processes to this registry value which will automatically launch at boot.\nAdversaries can use these configuration locations to execute malware, such as remote access tools, to maintain persistence through system reboots. Adversaries may also use Masquerading to make the Registry entries look as if they are associated with legitimate programs.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Installs system startup script or application",
                  "match_data": [
                    "transferencia interbancaria (bbva).exe adds \"C:\\Users\\RDhJ0CNFevzX\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup\\TypeId.vbs\" to Windows startup folder."
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0006",
          "name": "Credential Access",
          "link": "https://attack.mitre.org/tactics/TA0006/",
          "description": "The adversary is trying to steal account names and passwords.\n\nCredential Access consists of techniques for stealing credentials like account names and passwords. Techniques used to get credentials include keylogging or credential dumping. Using legitimate credentials can give adversaries access to systems, make them harder to detect, and provide the opportunity to create more accounts to help achieve their goals.",
          "techniques": [
            {
              "id": "T1056",
              "name": "Input Capture",
              "link": "https://attack.mitre.org/techniques/T1056/",
              "description": "Adversaries may use methods of capturing user input to obtain credentials or collect information. During normal system usage, users often provide credentials to various different locations, such as login pages/portals or system dialog boxes. Input capture mechanisms may be transparent to the user (e.g. Credential API Hooking) or rely on deceiving the user into providing input into what they believe to be a genuine service (e.g. Web Portal Capture)."
            },
            {
              "id": "T1056.002",
              "name": "GUI Input Capture",
              "link": "https://attack.mitre.org/techniques/T1056/002/",
              "description": "Adversaries may mimic common operating system GUI components to prompt users for credentials with a seemingly legitimate prompt. When programs are executed that need additional privileges than are present in the current user context, it is common for the operating system to prompt the user for proper credentials to authorize the elevated privileges for the task (ex: Bypass User Account Control).\nAdversaries may mimic this functionality to prompt users for credentials with a seemingly legitimate prompt for a number of reasons that mimic normal usage, such as a fake installer requiring additional access or a fake malware removal suite. This type of prompt can be used to collect credentials via various languages such as AppleScript and PowerShell. On Linux systems adversaries may launch dialog boxes prompting users for credentials from malicious shell scripts or the command line (i.e. Unix Shell).\nAdversaries may also mimic common software authentication requests, such as those from browsers or email clients. This may also be paired with user activity monitoring (i.e., Browser Information Discovery and/or Application Window Discovery) to spoof prompts when users are naturally accessing sensitive sites/data.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Monitors GUI Input",
                  "match_data": [
                    "installutil.exe installs hook to monitor GUI input."
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0009",
          "name": "Collection",
          "link": "https://attack.mitre.org/tactics/TA0009/",
          "description": "The adversary is trying to gather data of interest to their goal.\n\nCollection consists of techniques adversaries may use to gather information and the sources information is collected from that are relevant to following through on the adversary's objectives. Frequently, the next goal after collecting data is to either steal (exfiltrate) the data or to use the data to gain more information about the target environment. Common target sources include various drive types, browsers, audio, video, and email. Common collection methods include capturing screenshots and keyboard input.",
          "techniques": [
            {
              "id": "T1056",
              "name": "Input Capture",
              "link": "https://attack.mitre.org/techniques/T1056/",
              "description": "Adversaries may use methods of capturing user input to obtain credentials or collect information. During normal system usage, users often provide credentials to various different locations, such as login pages/portals or system dialog boxes. Input capture mechanisms may be transparent to the user (e.g. Credential API Hooking) or rely on deceiving the user into providing input into what they believe to be a genuine service (e.g. Web Portal Capture)."
            },
            {
              "id": "T1056.002",
              "name": "GUI Input Capture",
              "link": "https://attack.mitre.org/techniques/T1056/002/",
              "description": "Adversaries may mimic common operating system GUI components to prompt users for credentials with a seemingly legitimate prompt. When programs are executed that need additional privileges than are present in the current user context, it is common for the operating system to prompt the user for proper credentials to authorize the elevated privileges for the task (ex: Bypass User Account Control).\nAdversaries may mimic this functionality to prompt users for credentials with a seemingly legitimate prompt for a number of reasons that mimic normal usage, such as a fake installer requiring additional access or a fake malware removal suite. This type of prompt can be used to collect credentials via various languages such as AppleScript and PowerShell. On Linux systems adversaries may launch dialog boxes prompting users for credentials from malicious shell scripts or the command line (i.e. Unix Shell).\nAdversaries may also mimic common software authentication requests, such as those from browsers or email clients. This may also be paired with user activity monitoring (i.e., Browser Information Discovery and/or Application Window Discovery) to spoof prompts when users are naturally accessing sensitive sites/data.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Monitors GUI Input",
                  "match_data": [
                    "installutil.exe installs hook to monitor GUI input."
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0011",
          "name": "Command and Control",
          "link": "https://attack.mitre.org/tactics/TA0011/",
          "description": "The adversary is trying to communicate with compromised systems to control them.\n\nCommand and Control consists of techniques that adversaries may use to communicate with systems under their control within a victim network. Adversaries commonly attempt to mimic normal, expected traffic to avoid detection. There are many ways an adversary can establish command and control with various levels of stealth depending on the victim’s network structure and defenses.",
          "techniques": [
            {
              "id": "T1071",
              "name": "Application Layer Protocol",
              "link": "https://attack.mitre.org/techniques/T1071/",
              "description": "Adversaries may communicate using OSI application layer protocols to avoid detection/network filtering by blending in with existing traffic. Commands to the remote system, and often the results of those commands, will be embedded within the protocol traffic between the client and server. \nAdversaries may utilize many different protocols, including those used for web browsing, transferring files, electronic mail, DNS, or publishing/subscribing. For connections that occur internally within an enclave (such as those between a proxy or pivot node and other nodes), commonly used protocols are SMB, SSH, or RDP. "
            },
            {
              "id": "T1071.001",
              "name": "Web Protocols",
              "link": "https://attack.mitre.org/techniques/T1071/001/",
              "description": "Adversaries may communicate using application layer protocols associated with web traffic to avoid detection/network filtering by blending in with existing traffic. Commands to the remote system, and often the results of those commands, will be embedded within the protocol traffic between the client and server. \nProtocols such as HTTP/S and WebSocket that carry web traffic may be very common in environments. HTTP/S packets have many fields and headers in which data can be concealed. An adversary may abuse these protocols to communicate with systems under their control within a victim network while also mimicking normal, expected traffic. ",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Downloads file",
                  "match_data": [
                    "typeid.exe downloads file via http from https://www.arcon.com.pe/Itnihfkvy.dat."
                  ]
                }
              ]
            },
            {
              "id": "T1071.004",
              "name": "DNS",
              "link": "https://attack.mitre.org/techniques/T1071/004/",
              "description": "Adversaries may communicate using the Domain Name System (DNS) application layer protocol to avoid detection/network filtering by blending in with existing traffic. Commands to the remote system, and often the results of those commands, will be embedded within the protocol traffic between the client and server. \nThe DNS protocol serves an administrative function in computer networking and thus may be very common in environments. DNS traffic may also be allowed even before network authentication is completed. DNS packets contain many fields and headers in which data can be concealed. Often known as DNS tunneling, adversaries may abuse DNS to communicate with systems under their control within a victim network while also mimicking normal, expected traffic. ",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Performs DNS request",
                  "match_data": [
                    "transferencia interbancaria (bbva).exe resolves hostname \"www.arcon.com.pe\" to IP \"192.99.207.151\"."
                  ]
                }
              ]
            },
            {
              "id": "T1095",
              "name": "Non-Application Layer Protocol",
              "link": "https://attack.mitre.org/techniques/T1095/",
              "description": "Adversaries may use an OSI non-application layer protocol for communication between host and C2 server or among infected hosts within a network. The list of possible protocols is extensive. Specific examples include use of network layer protocols, such as the Internet Control Message Protocol (ICMP), transport layer protocols, such as the User Datagram Protocol (UDP), session layer protocols, such as Socket Secure (SOCKS), as well as redirected/tunneled protocols, such as Serial over LAN (SOL).\nICMP communication between hosts is one example. Because ICMP is part of the Internet Protocol Suite, it is required to be implemented by all IP-compatible hosts. However, it is not as commonly monitored as other Internet Protocols such as TCP or UDP and may be used by adversaries to hide communications.\nIn ESXi environments, adversaries may leverage the Virtual Machine Communication Interface (VMCI) for communication between guest virtual machines and the ESXi host. This traffic is similar to client-server communications on traditional network sockets but is localized to the physical machine running the ESXi host, meaning it does not traverse external networks (routers, switches). This results in communications that are invisible to external monitoring and standard networking tools like tcpdump, netstat, nmap, and Wireshark. By adding a VMCI backdoor to a compromised ESXi host, adversaries may persistently regain access from any guest VM to the compromised ESXi host’s backdoor, regardless of network segmentation or firewall rules in place.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Connects to remote host",
                  "match_data": [
                    "transferencia interbancaria (bbva).exe opens an outgoing TCP connection to host \"192.99.207.151:443\".",
                    "typeid.exe opens an outgoing TCP connection to host \"192.99.207.151:443\"."
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "Sets up server that accepts incoming connections",
                  "match_data": [
                    "transferencia interbancaria (bbva).exe starts a TCP server listening on port 49683.",
                    "typeid.exe starts a TCP server listening on port 49673."
                  ]
                }
              ]
            },
            {
              "id": "T1105",
              "name": "Ingress Tool Transfer",
              "link": "https://attack.mitre.org/techniques/T1105/",
              "description": "Adversaries may transfer tools or other files from an external system into a compromised environment. Tools or files may be copied from an external adversary-controlled system to the victim network through the command and control channel or through alternate protocols such as ftp. Once present, adversaries may also transfer/spread tools between victim devices within a compromised environment (i.e. Lateral Tool Transfer). \nOn Windows, adversaries may use various utilities to download tools, such as copy, finger, certutil, and PowerShell commands such as IEX(New-Object Net.WebClient).downloadString() and Invoke-WebRequest. On Linux and macOS systems, a variety of utilities also exist, such as curl, scp, sftp, tftp, rsync, finger, and wget.  A number of these tools, such as wget, curl, and scp, also exist on ESXi. After downloading a file, a threat actor may attempt to verify its integrity by checking its hash value (e.g., via certutil -hashfile).\nAdversaries may also abuse installers and package managers, such as yum or winget, to download tools to victim hosts. Adversaries have also abused file application features, such as the Windows search-ms protocol handler, to deliver malicious files to victims through remote file searches invoked by User Execution (typically after interacting with Phishing lures).\nFiles can also be transferred using various Web Services as well as native or otherwise present tools on the victim system. In some cases, adversaries may be able to leverage services that sync between a web-based and an on-premises client, such as Dropbox or OneDrive, to transfer files onto victim systems. For example, by compromising a cloud account and logging into the service's web portal, an adversary may be able to trigger an automatic syncing process that transfers the file onto the victim's machine.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Downloads file",
                  "match_data": [
                    "typeid.exe downloads file via http from https://www.arcon.com.pe/Itnihfkvy.dat."
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0003",
          "name": "Persistence",
          "link": "https://attack.mitre.org/tactics/TA0003/",
          "description": "The adversary is trying to maintain their foothold.\n\nPersistence consists of techniques that adversaries use to keep access to systems across restarts, changed credentials, and other interruptions that could cut off their access. Techniques used for persistence include any access, action, or configuration changes that let them maintain their foothold on systems, such as replacing or hijacking legitimate code or adding startup code. ",
          "techniques": [
            {
              "id": "T1547",
              "name": "Boot or Logon Autostart Execution",
              "link": "https://attack.mitre.org/techniques/T1547/",
              "description": "Adversaries may configure system settings to automatically execute a program during system boot or logon to maintain persistence or gain higher-level privileges on compromised systems. Operating systems may have mechanisms for automatically running a program on system boot or account logon. These mechanisms may include automatically executing programs that are placed in specially designated directories or are referenced by repositories that store configuration information, such as the Windows Registry. An adversary may achieve the same goal by modifying or extending features of the kernel.\nSince some boot or logon autostart programs run with higher privileges, an adversary may leverage these to elevate privileges."
            },
            {
              "id": "T1547.001",
              "name": "Registry Run Keys / Startup Folder",
              "link": "https://attack.mitre.org/techniques/T1547/001/",
              "description": "Adversaries may achieve persistence by adding a program to a startup folder or referencing it with a Registry run key. Adding an entry to the \"run keys\" in the Registry or startup folder will cause the program referenced to be executed when a user logs in. These programs will be executed under the context of the user and will have the account's associated permissions level.\nThe following run keys are created by default on Windows systems:\n\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnce\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnce\n\nRun keys may exist under multiple hives. The HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnceEx is also available but is not created by default on Windows Vista and newer. Registry run key entries can reference programs directly or list them as a dependency. For example, it is possible to load a DLL at logon using a \"Depend\" key with RunOnceEx: reg add HKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\RunOnceEx\\0001\\Depend /v 1 /d \"C:\\temp\\evil[.]dll\" \nPlacing a program within a startup folder will also cause that program to execute when a user logs in. There is a startup folder location for individual user accounts as well as a system-wide startup folder that will be checked regardless of which user account logs in. The startup folder path for the current user is C:\\Users\\[Username]\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup. The startup folder path for all users is C:\\ProgramData\\Microsoft\\Windows\\Start Menu\\Programs\\StartUp.\nThe following Registry keys can be used to set startup folder items for persistence:\n\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell Folders\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Shell Folders\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Shell Folders\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell Folders\n\nThe following Registry keys can control automatic startup of services during boot:\n\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServicesOnce\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServicesOnce\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServices\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServices\n\nUsing policy settings to specify startup programs creates corresponding values in either of two Registry keys:\n\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer\\Run\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer\\Run\n\nPrograms listed in the load value of the registry key HKEY_CURRENT_USER\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Windows run automatically for the currently logged-on user.\nBy default, the multistring BootExecute value of the registry key HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\Session Manager is set to autocheck autochk *. This value causes Windows, at startup, to check the file-system integrity of the hard disks if the system has been shut down abnormally. Adversaries can add other programs or processes to this registry value which will automatically launch at boot.\nAdversaries can use these configuration locations to execute malware, such as remote access tools, to maintain persistence through system reboots. Adversaries may also use Masquerading to make the Registry entries look as if they are associated with legitimate programs.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Installs system startup script or application",
                  "match_data": [
                    "transferencia interbancaria (bbva).exe adds \"C:\\Users\\RDhJ0CNFevzX\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup\\TypeId.vbs\" to Windows startup folder."
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    "Yomi Hunter": {
      "tactics": [
        {
          "id": "TA0002",
          "name": "Execution",
          "link": "https://attack.mitre.org/tactics/TA0002/",
          "description": "The adversary is trying to run malicious code.\n\nExecution consists of techniques that result in adversary-controlled code running on a local or remote system. Techniques that run malicious code are often paired with techniques from all other tactics to achieve broader goals, like exploring a network or stealing data. For example, an adversary might use a remote access tool to run a PowerShell script that does Remote System Discovery. ",
          "techniques": [
            {
              "id": "T1129",
              "name": "Shared Modules",
              "link": "https://attack.mitre.org/techniques/T1129/",
              "description": "Adversaries may execute malicious payloads via loading shared modules. Shared modules are executable files that are loaded into processes to provide access to reusable code, such as specific custom functions or invoking OS API functions (i.e., Native API).\nAdversaries may use this functionality as a way to execute arbitrary payloads on a victim system. For example, adversaries can modularize functionality of their malware into shared objects that perform various functions such as managing C2 network communications or execution of specific actions on objective.\nThe Linux & macOS module loader can load and execute shared objects from arbitrary local paths. This functionality resides in dlfcn.h in functions such as dlopen and dlsym. Although macOS can execute .so files, common practice uses .dylib files.\nThe Windows module loader can be instructed to load DLLs from arbitrary local paths and arbitrary Universal Naming Convention (UNC) network paths. This functionality resides in NTDLL.dll and is part of the Windows Native API which is called from functions like LoadLibrary at run time.",
              "signatures": [
                {
                  "severity": "UNKNOWN",
                  "description": "The process attempted to dynamically load a malicious function"
                },
                {
                  "severity": "UNKNOWN",
                  "description": "The process tried to load dynamically one or more functions."
                },
                {
                  "severity": "UNKNOWN",
                  "description": "link function at runtime on Linux"
                }
              ]
            },
            {
              "id": "T1569",
              "name": "System Services",
              "link": "https://attack.mitre.org/techniques/T1569/",
              "description": "Adversaries may abuse system services or daemons to execute commands or programs. Adversaries can execute malicious content by interacting with or creating services either locally or remotely. Many services are set to run at boot, which can aid in achieving persistence (Create or Modify System Process), but adversaries can also abuse services for one-time or temporary execution."
            },
            {
              "id": "T1569.002",
              "name": "Service Execution",
              "link": "https://attack.mitre.org/techniques/T1569/002/",
              "description": "Adversaries may abuse the Windows service control manager to execute malicious commands or payloads. The Windows service control manager (services.exe) is an interface to manage and manipulate services. The service control manager is accessible to users via GUI components as well as system utilities such as sc.exe and Net.\nPsExec can also be used to execute commands or payloads via a temporary Windows service created through the service control manager API. Tools such as PsExec and sc.exe can accept remote servers as arguments and may be used to conduct remote execution.\nAdversaries may leverage these mechanisms to execute malicious content. This can be done by either executing a new or modified service. This technique is the execution used in conjunction with Windows Service during service persistence or privilege escalation.",
              "signatures": [
                {
                  "severity": "UNKNOWN",
                  "description": "interact with driver via control codes"
                }
              ]
            }
          ]
        },
        {
          "id": "TA0007",
          "name": "Discovery",
          "link": "https://attack.mitre.org/tactics/TA0007/",
          "description": "The adversary is trying to figure out your environment.\n\nDiscovery consists of techniques an adversary may use to gain knowledge about the system and internal network. These techniques help adversaries observe the environment and orient themselves before deciding how to act. They also allow adversaries to explore what they can control and what’s around their entry point in order to discover how it could benefit their current objective. Native operating system tools are often used toward this post-compromise information-gathering objective. ",
          "techniques": [
            {
              "id": "T1057",
              "name": "Process Discovery",
              "link": "https://attack.mitre.org/techniques/T1057/",
              "description": "Adversaries may attempt to get information about running processes on a system. Information obtained could be used to gain an understanding of common software/applications running on systems within the network. Administrator or otherwise elevated access may provide better process details. Adversaries may use the information from Process Discovery during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\nIn Windows environments, adversaries could obtain details on running processes using the Tasklist utility via cmd or Get-Process via PowerShell. Information about processes can also be extracted from the output of Native API calls such as CreateToolhelp32Snapshot. In Mac and Linux, this is accomplished with the ps command. Adversaries may also opt to enumerate processes via /proc. ESXi also supports use of the ps command, as well as esxcli system process list.\nOn network devices, Network Device CLI commands such as show processes can be used to display current running processes.",
              "signatures": [
                {
                  "severity": "UNKNOWN",
                  "description": "The process has tried to detect the debugger probing the use of page guards."
                },
                {
                  "severity": "UNKNOWN",
                  "description": "The process attempted to detect a running debugger using common APIs"
                }
              ]
            },
            {
              "id": "T1082",
              "name": "System Information Discovery",
              "link": "https://attack.mitre.org/techniques/T1082/",
              "description": "An adversary may attempt to get detailed information about the operating system and hardware, including version, patches, hotfixes, service packs, and architecture. Adversaries may use the information from System Information Discovery during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\nTools such as Systeminfo can be used to gather detailed system information. If running with privileged access, a breakdown of system data can be gathered through the systemsetup configuration tool on macOS. As an example, adversaries with user-level access can execute the df -aH command to obtain currently mounted disks and associated freely available space. Adversaries may also leverage a Network Device CLI on network devices to gather detailed system information (e.g. show version). On ESXi servers, threat actors may gather system information from various esxcli utilities, such as system hostname get, system version get, and storage filesystem list (to list storage volumes).\nInfrastructure as a Service (IaaS) cloud providers such as AWS, GCP, and Azure allow access to instance and virtual machine information via APIs. Successful authenticated API calls can return data such as the operating system platform and status of a particular instance or the model view of a virtual machine.\nSystem Information Discovery combined with information gathered from other forms of discovery and reconnaissance can drive payload development and concealment. ",
              "signatures": [
                {
                  "severity": "UNKNOWN",
                  "description": "get OS version in .NET"
                }
              ]
            },
            {
              "id": "T1083",
              "name": "File and Directory Discovery",
              "link": "https://attack.mitre.org/techniques/T1083/",
              "description": "Adversaries may enumerate files and directories or may search in specific locations of a host or network share for certain information within a file system. Adversaries may use the information from File and Directory Discovery during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\nMany command shell utilities can be used to obtain this information. Examples include dir, tree, ls, find, and locate. Custom tools may also be used to gather file and directory information and interact with the Native API. Adversaries may also leverage a Network Device CLI on network devices to gather file and directory information (e.g. dir, show flash, and/or nvram).\nSome files and directories may require elevated or specific user permissions to access.",
              "signatures": [
                {
                  "severity": "UNKNOWN",
                  "description": "check if file exists"
                },
                {
                  "severity": "UNKNOWN",
                  "description": "enumerate files on Windows"
                }
              ]
            },
            {
              "id": "T1012",
              "name": "Query Registry",
              "link": "https://attack.mitre.org/techniques/T1012/",
              "description": "Adversaries may interact with the Windows Registry to gather information about the system, configuration, and installed software.\nThe Registry contains a significant amount of information about the operating system, configuration, software, and security. Information can easily be queried using the Reg utility, though other means to access the Registry exist. Some of the information may help adversaries to further their operation within a network. Adversaries may use the information from Query Registry during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.",
              "signatures": [
                {
                  "severity": "UNKNOWN",
                  "description": "query or enumerate registry value"
                }
              ]
            }
          ]
        },
        {
          "id": "TA0005",
          "name": "Defense Evasion",
          "link": "https://attack.mitre.org/tactics/TA0005/",
          "description": "The adversary is trying to avoid being detected.\n\nDefense Evasion consists of techniques that adversaries use to avoid detection throughout their compromise. Techniques used for defense evasion include uninstalling/disabling security software or obfuscating/encrypting data and scripts. Adversaries also leverage and abuse trusted processes to hide and masquerade their malware. Other tactics’ techniques are cross-listed here when those techniques include the added benefit of subverting defenses. ",
          "techniques": [
            {
              "id": "T1140",
              "name": "Deobfuscate/Decode Files or Information",
              "link": "https://attack.mitre.org/techniques/T1140/",
              "description": "Adversaries may use Obfuscated Files or Information to hide artifacts of an intrusion from analysis. They may require separate mechanisms to decode or deobfuscate that information depending on how they intend to use it. Methods for doing that include built-in functionality of malware or by using utilities present on the system.\nOne such example is the use of certutil to decode a remote access tool portable executable file that has been hidden inside a certificate file. Another example is using the Windows copy /b or type command to reassemble binary fragments into a malicious payload.\nSometimes a user's action may be required to open it for deobfuscation or decryption as part of User Execution. The user may also be required to input a password to open a password protected compressed/encrypted file that was provided by the adversary.",
              "signatures": [
                {
                  "severity": "UNKNOWN",
                  "description": "decode data using Base64 in .NET"
                }
              ]
            },
            {
              "id": "T1620",
              "name": "Reflective Code Loading",
              "link": "https://attack.mitre.org/techniques/T1620/",
              "description": "Adversaries may reflectively load code into a process in order to conceal the execution of malicious payloads. Reflective loading involves allocating then executing payloads directly within the memory of the process, vice creating a thread or process backed by a file path on disk (e.g., Shared Modules).\nReflectively loaded payloads may be compiled binaries, anonymous files (only present in RAM), or just snubs of fileless executable code (ex: position-independent shellcode). For example, the Assembly.Load() method executed by PowerShell may be abused to load raw code into the running process.\nReflective code injection is very similar to Process Injection except that the “injection” loads code into the processes’ own memory instead of that of a separate process. Reflective loading may evade process-based detections since the execution of the arbitrary code may be masked within a legitimate or otherwise benign process. Reflectively loading payloads directly into memory may also avoid creating files or other artifacts on disk, while also enabling malware to keep these payloads encrypted (or otherwise obfuscated) until execution.",
              "signatures": [
                {
                  "severity": "UNKNOWN",
                  "description": "load .NET assembly"
                }
              ]
            },
            {
              "id": "T1027",
              "name": "Obfuscated Files or Information",
              "link": "https://attack.mitre.org/techniques/T1027/",
              "description": "Adversaries may attempt to make an executable or file difficult to discover or analyze by encrypting, encoding, or otherwise obfuscating its contents on the system or in transit. This is common behavior that can be used across different platforms and the network to evade defenses. \nPayloads may be compressed, archived, or encrypted in order to avoid detection. These payloads may be used during Initial Access or later to mitigate detection. Sometimes a user's action may be required to open and Deobfuscate/Decode Files or Information for User Execution. The user may also be required to input a password to open a password protected compressed/encrypted file that was provided by the adversary.  Adversaries may also use compressed or archived scripts, such as JavaScript. \nPortions of files can also be encoded to hide the plain-text strings that would otherwise help defenders with discovery.  Payloads may also be split into separate, seemingly benign files that only reveal malicious functionality when reassembled. \nAdversaries may also abuse Command Obfuscation to obscure commands executed from payloads or directly via Command and Scripting Interpreter. Environment variables, aliases, characters, and other platform/language specific semantics can be used to evade signature based detections and application control mechanisms.   ",
              "signatures": [
                {
                  "severity": "UNKNOWN",
                  "description": "encode data using Base64"
                }
              ]
            }
          ]
        }
      ]
    }
  },
  "links": {
    "self": "https://www.virustotal.com/api/v3/files/35771b256b8926ea266d84a3344618c3871ab0f730b8894c979a3fbb47fe8a7d/behaviour_mitre_trees"
  }
}