{
  "data": {
    "CAPA": {
      "tactics": [
        {
          "id": "TA0007",
          "name": "Discovery",
          "link": "https://attack.mitre.org/tactics/TA0007/",
          "description": "The adversary is trying to figure out your environment.\n\nDiscovery consists of techniques an adversary may use to gain knowledge about the system and internal network. These techniques help adversaries observe the environment and orient themselves before deciding how to act. They also allow adversaries to explore what they can control and what’s around their entry point in order to discover how it could benefit their current objective. Native operating system tools are often used toward this post-compromise information-gathering objective. ",
          "techniques": [
            {
              "id": "T1083",
              "name": "File and Directory Discovery",
              "link": "https://attack.mitre.org/techniques/T1083/",
              "description": "Adversaries may enumerate files and directories or may search in specific locations of a host or network share for certain information within a file system. Adversaries may use the information from File and Directory Discovery during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\nMany command shell utilities can be used to obtain this information. Examples include dir, tree, ls, find, and locate. Custom tools may also be used to gather file and directory information and interact with the Native API. Adversaries may also leverage a Network Device CLI on network devices to gather file and directory information (e.g. dir, show flash, and/or nvram).\nSome files and directories may require elevated or specific user permissions to access.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "check if file exists",
                  "match_data": [
                    "api: System.IO.File::Exists"
                  ]
                }
              ]
            },
            {
              "id": "T1082",
              "name": "System Information Discovery",
              "link": "https://attack.mitre.org/techniques/T1082/",
              "description": "An adversary may attempt to get detailed information about the operating system and hardware, including version, patches, hotfixes, service packs, and architecture. Adversaries may use this information to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions. This behavior is distinct from Local Storage Discovery which is an adversary's discovery of local drive, disks and/or volumes.\nTools such as Systeminfo can be used to gather detailed system information. If running with privileged access, a breakdown of system data can be gathered through the systemsetup configuration tool on macOS. Adversaries may leverage a Network Device CLI on network devices to gather detailed system information (e.g. show version). On ESXi servers, threat actors may gather system information from various esxcli utilities, such as system hostname get and system version get.\nInfrastructure as a Service (IaaS) cloud providers such as AWS, GCP, and Azure allow access to instance and virtual machine information via APIs. Successful authenticated API calls can return data such as the operating system platform and status of a particular instance or the model view of a virtual machine.\nSystem Information Discovery combined with information gathered from other forms of discovery and reconnaissance can drive payload development and concealment. ",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "query environment variable",
                  "match_data": [
                    "api: System.Environment::ExpandEnvironmentVariables"
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    "CAPE Sandbox": {
      "tactics": [
        {
          "id": "TA0002",
          "name": "Execution",
          "link": "https://attack.mitre.org/tactics/TA0002/",
          "description": "The adversary is trying to run malicious code.\n\nExecution consists of techniques that result in adversary-controlled code running on a local or remote system. Techniques that run malicious code are often paired with techniques from all other tactics to achieve broader goals, like exploring a network or stealing data. For example, an adversary might use a remote access tool to run a PowerShell script that does Remote System Discovery. ",
          "techniques": [
            {
              "id": "T1129",
              "name": "Shared Modules",
              "link": "https://attack.mitre.org/techniques/T1129/",
              "description": "Adversaries may execute malicious payloads via loading shared modules. Shared modules are executable files that are loaded into processes to provide access to reusable code, such as specific custom functions or invoking OS API functions (i.e., Native API).\nAdversaries may use this functionality as a way to execute arbitrary payloads on a victim system. For example, adversaries can modularize functionality of their malware into shared objects that perform various functions such as managing C2 network communications or execution of specific actions on objective.\nThe Linux & macOS module loader can load and execute shared objects from arbitrary local paths. This functionality resides in dlfcn.h in functions such as dlopen and dlsym. Although macOS can execute .so files, common practice uses .dylib files.\nThe Windows module loader can be instructed to load DLLs from arbitrary local paths and arbitrary Universal Naming Convention (UNC) network paths. This functionality resides in NTDLL.dll and is part of the Windows Native API which is called from functions like LoadLibrary at run time.",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Drops a binary and executes it",
                  "match_data": [
                    "C:\\Users\\Bruno\\Desktop\\XClient.exe",
                    "C:\\Users\\Bruno\\Desktop\\afsfasfasfas.exe",
                    "C:\\Users\\Bruno\\Desktop\\as.exe",
                    "C:\\Users\\Bruno\\Desktop\\whwhwhwh.exe",
                    "C:\\Users\\Bruno\\Desktop\\wwwsss.exe"
                  ]
                }
              ]
            },
            {
              "id": "T1106",
              "name": "Native API",
              "link": "https://attack.mitre.org/techniques/T1106/",
              "description": "Adversaries may interact with the native OS application programming interface (API) to execute behaviors. Native APIs provide a controlled means of calling low-level OS services within the kernel, such as those involving hardware/devices, memory, and processes. These native APIs are leveraged by the OS during system boot (when other system components are not yet initialized) as well as carrying out tasks and requests during routine operations.\nAdversaries may abuse these OS API functions as a means of executing behaviors. Similar to Command and Scripting Interpreter, the native API and its hierarchy of interfaces provide mechanisms to interact with and utilize various components of a victimized system.\nNative API functions (such as NtCreateProcess) may be directed invoked via system calls / syscalls, but these features are also often exposed to user-mode applications via interfaces and libraries. For example, functions such as the Windows API CreateProcess() or GNU fork() will allow programs and scripts to start other processes. This may allow API callers to execute a binary, run a CLI command, load modules, etc. as thousands of similar API functions exist for various system operations.\nHigher level software frameworks, such as Microsoft .NET and macOS Cocoa, are also available to interact with native APIs. These frameworks typically provide language wrappers/abstractions to API functionalities and are designed for ease-of-use/portability of code.\nAdversaries may use assembly to directly or in-directly invoke syscalls in an attempt to subvert defensive sensors and detection signatures such as user mode API-hooks. Adversaries may also attempt to tamper with sensors and defensive tools associated with API monitoring, such as unhooking monitored functions via Disable or Modify Tools.",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Guard pages use detected - possible anti-debugging.",
                  "match_data": [
                    "pid: 6356"
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0005",
          "name": "Defense Evasion",
          "link": "https://attack.mitre.org/tactics/TA0005/",
          "description": "The adversary is trying to avoid being detected.\n\nDefense Evasion consists of techniques that adversaries use to avoid detection throughout their compromise. Techniques used for defense evasion include uninstalling/disabling security software or obfuscating/encrypting data and scripts. Adversaries also leverage and abuse trusted processes to hide and masquerade their malware. Other tactics’ techniques are cross-listed here when those techniques include the added benefit of subverting defenses. ",
          "techniques": [
            {
              "id": "T1014",
              "name": "Rootkit",
              "link": "https://attack.mitre.org/techniques/T1014/",
              "description": "Adversaries may use rootkits to hide the presence of programs, files, network connections, services, drivers, and other system components. Rootkits are programs that hide the existence of malware by intercepting/hooking and modifying operating system API calls that supply system information.  \nRootkits or rootkit enabling functionality may reside at the user or kernel level in the operating system or lower, to include a hypervisor or System Firmware.  Rootkits have been seen for Windows, Linux, and Mac OS X systems.  \nRootkits that reside or modify boot sectors are known as Bootkits and specifically target the boot process of the operating system.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Attempted to write directly to a physical drive",
                  "match_data": [
                    "\\??\\PhysicalDrive0"
                  ]
                }
              ]
            },
            {
              "id": "T1542",
              "name": "Pre-OS Boot",
              "link": "https://attack.mitre.org/techniques/T1542/",
              "description": "Adversaries may abuse Pre-OS Boot mechanisms as a way to establish persistence on a system. During the booting process of a computer, firmware and various startup services are loaded before the operating system. These programs control flow of execution before the operating system takes control.\nAdversaries may overwrite data in boot drivers or firmware such as BIOS (Basic Input/Output System) and The Unified Extensible Firmware Interface (UEFI) to persist on systems at a layer below the operating system. This can be particularly difficult to detect as malware at this level will not be detected by host software-based defenses.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Attempted to write directly to a physical drive",
                  "match_data": [
                    "\\??\\PhysicalDrive0"
                  ]
                }
              ]
            },
            {
              "id": "T1542.003",
              "name": "Bootkit",
              "link": "https://attack.mitre.org/techniques/T1542/003/",
              "description": "Adversaries may use bootkits to persist on systems. A bootkit is a malware variant that modifies the boot sectors of a hard drive, allowing malicious code to execute before a computer's operating system has loaded. Bootkits reside at a layer below the operating system and may make it difficult to perform full remediation unless an organization suspects one was used and can act accordingly.\nIn BIOS systems, a bootkit may modify the Master Boot Record (MBR) and/or Volume Boot Record (VBR). The MBR is the section of disk that is first loaded after completing hardware initialization by the BIOS. It is the location of the boot loader. An adversary who has raw access to the boot drive may overwrite this area, diverting execution during startup from the normal boot loader to adversary code.\nThe MBR passes control of the boot process to the VBR. Similar to the case of MBR, an adversary who has raw access to the boot drive may overwrite the VBR to divert execution during startup to adversary code.\nIn UEFI (Unified Extensible Firmware Interface) systems, a bootkit may instead create or modify files in the EFI system partition (ESP). The ESP is a partition on data storage used by devices containing UEFI that allows the system to boot the OS and other utilities used by the system. An adversary can use the newly created or patched files in the ESP to run malicious kernel code.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Attempted to write directly to a physical drive",
                  "match_data": [
                    "\\??\\PhysicalDrive0"
                  ]
                },
                {
                  "severity": "MEDIUM",
                  "description": "Uses suspicious IO control codes",
                  "match_data": [
                    "pid: 1140"
                  ]
                }
              ]
            },
            {
              "id": "T1564",
              "name": "Hide Artifacts",
              "link": "https://attack.mitre.org/techniques/T1564/",
              "description": "Adversaries may attempt to hide artifacts associated with their behaviors to evade detection. Operating systems may have features to hide various artifacts, such as important system files and administrative task execution, to avoid disrupting user work environments and prevent users from changing files or features on the system. Adversaries may abuse these features to hide artifacts such as files, directories, user accounts, or other system activity to evade detection.\nAdversaries may also attempt to hide artifacts associated with malicious behavior by creating computing regions that are isolated from common security instrumentation, such as through the use of virtualization technology.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Creates a hidden or system file",
                  "match_data": [
                    "pid: 7008",
                    "C:\\Windows\\ServiceProfiles\\LocalService\\AppData\\Local\\FontCache\\Fonts\\Download-1.tmp"
                  ]
                }
              ]
            },
            {
              "id": "T1055",
              "name": "Process Injection",
              "link": "https://attack.mitre.org/techniques/T1055/",
              "description": "Adversaries may inject code into processes in order to evade process-based defenses as well as possibly elevate privileges. Process injection is a method of executing arbitrary code in the address space of a separate live process. Running code in the context of another process may allow access to the process's memory, system/network resources, and possibly elevated privileges. Execution via process injection may also evade detection from security products since the execution is masked under a legitimate process. \nThere are many different ways to inject code into a process, many of which abuse legitimate functionalities. These implementations exist for every major OS but are typically platform specific. \nMore sophisticated samples may perform multiple process injections to segment modules and further evade detection, utilizing named pipes or other inter-process communication (IPC) mechanisms as a communication channel. ",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Resumed a thread in another process",
                  "match_data": [
                    "Process output.exe with process ID 6356 resumed a thread in another process with the process ID 6356",
                    "pid: 6356",
                    "Process afsfasfasfas.exe with process ID 6140 resumed a thread in another process with the process ID 6140",
                    "pid: 6140"
                  ]
                }
              ]
            },
            {
              "id": "T1070",
              "name": "Indicator Removal",
              "link": "https://attack.mitre.org/techniques/T1070/",
              "description": "Adversaries may delete or modify artifacts generated within systems to remove evidence of their presence or hinder defenses. Various artifacts may be created by an adversary or something that can be attributed to an adversary’s actions. Typically these artifacts are used as defensive indicators related to monitored events, such as strings from downloaded files, logs that are generated from user actions, and other data analyzed by defenders. Location, format, and type of artifact (such as command or login history) are often specific to each platform.\nRemoval of these indicators may interfere with event collection, reporting, or other processes used to detect intrusion activity. This may compromise the integrity of security solutions by causing notable events to go unreported. This activity may also impede forensic analysis and incident response, due to lack of sufficient data to determine what occurred.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Anomalous binary characteristics",
                  "match_data": [
                    "Entrypoint of binary is located outside of any mapped sections"
                  ]
                },
                {
                  "severity": "MEDIUM",
                  "description": "Yara detections observed in process dumps, payloads or dropped files",
                  "match_data": [
                    "PID 6024 triggered the Yara rule 'shellcode_get_eip' with data '['{ E8 00 00 00 00 59 }']'",
                    "PID 5472 triggered the Yara rule 'shellcode_get_eip' with data '['{ E8 00 00 00 00 59 }']'",
                    "PID 3680 triggered the Yara rule 'shellcode_get_eip' with data '['{ E8 00 00 00 00 59 }']'",
                    "PID 1140 triggered the Yara rule 'shellcode_get_eip' with data '['{ E8 00 00 00 00 59 }']'",
                    "PID  triggered the Yara rule 'INDICATOR_SUSPICIOUS_EXE_NoneWindowsUA' with data '['M\\x00o\\x00z\\x00i\\x00l\\x00l\\x00a\\x00/\\x005\\x00.\\x000\\x00 \\x00(\\x00i\\x00P\\x00h\\x00o\\x00n\\x00e\\x00;\\x00 \\x00C\\x00P\\x00U\\x00 \\x00i\\x00P\\x00h\\x00o\\x00n\\x00e\\x00 \\x00O\\x00S\\x00']'"
                  ]
                }
              ]
            },
            {
              "id": "T1070.006",
              "name": "Timestomp",
              "link": "https://attack.mitre.org/techniques/T1070/006/",
              "description": "Adversaries may modify file time attributes to hide new files or changes to existing files. Timestomping is a technique that modifies the timestamps of a file (the modify, access, create, and change times), often to mimic files that are in the same folder and blend malicious files with legitimate files.\nIn Windows systems, both the $STANDARD_INFORMATION ($SI) and $FILE_NAME ($FN) attributes record times in a Master File Table (MFT) file. $SI (dates/time stamps) is displayed to the end user, including in the File System view, while $FN is dealt with by the kernel.\nModifying the $SI attribute is the most common method of timestomping because it can be modified at the user level using API calls. $FN timestomping, however, typically requires interacting with the system kernel or moving or renaming a file.\nAdversaries modify timestamps on files so that they do not appear conspicuous to forensic investigators or file analysis tools. In order to evade detections that rely on identifying discrepancies between the $SI and $FN attributes, adversaries may also engage in “double timestomping” by modifying times on both attributes simultaneously.\nIn Linux systems and on ESXi servers, threat actors may attempt to perform timestomping using commands such as touch -a -m -t <timestamp> <filename> (which sets access and modification times to a specific value) or touch -r <filename> <filename> (which sets access and modification times to match those of another file).\nTimestomping may be used along with file name Masquerading to hide malware and tools.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Anomalous binary characteristics",
                  "match_data": [
                    "Entrypoint of binary is located outside of any mapped sections"
                  ]
                },
                {
                  "severity": "MEDIUM",
                  "description": "Yara detections observed in process dumps, payloads or dropped files",
                  "match_data": [
                    "PID 6024 triggered the Yara rule 'shellcode_get_eip' with data '['{ E8 00 00 00 00 59 }']'",
                    "PID 5472 triggered the Yara rule 'shellcode_get_eip' with data '['{ E8 00 00 00 00 59 }']'",
                    "PID 3680 triggered the Yara rule 'shellcode_get_eip' with data '['{ E8 00 00 00 00 59 }']'",
                    "PID 1140 triggered the Yara rule 'shellcode_get_eip' with data '['{ E8 00 00 00 00 59 }']'",
                    "PID  triggered the Yara rule 'INDICATOR_SUSPICIOUS_EXE_NoneWindowsUA' with data '['M\\x00o\\x00z\\x00i\\x00l\\x00l\\x00a\\x00/\\x005\\x00.\\x000\\x00 \\x00(\\x00i\\x00P\\x00h\\x00o\\x00n\\x00e\\x00;\\x00 \\x00C\\x00P\\x00U\\x00 \\x00i\\x00P\\x00h\\x00o\\x00n\\x00e\\x00 \\x00O\\x00S\\x00']'"
                  ]
                }
              ]
            },
            {
              "id": "T1027",
              "name": "Obfuscated Files or Information",
              "link": "https://attack.mitre.org/techniques/T1027/",
              "description": "Adversaries may attempt to make an executable or file difficult to discover or analyze by encrypting, encoding, or otherwise obfuscating its contents on the system or in transit. This is common behavior that can be used across different platforms and the network to evade defenses. \nPayloads may be compressed, archived, or encrypted in order to avoid detection. These payloads may be used during Initial Access or later to mitigate detection. Sometimes a user's action may be required to open and Deobfuscate/Decode Files or Information for User Execution. The user may also be required to input a password to open a password protected compressed/encrypted file that was provided by the adversary.  Adversaries may also use compressed or archived scripts, such as JavaScript. \nPortions of files can also be encoded to hide the plain-text strings that would otherwise help defenders with discovery.  Payloads may also be split into separate, seemingly benign files that only reveal malicious functionality when reassembled. \nAdversaries may also abuse Command Obfuscation to obscure commands executed from payloads or directly via Command and Scripting Interpreter. Environment variables, aliases, characters, and other platform/language specific semantics can be used to evade signature based detections and application control mechanisms.   ",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "The binary likely contains encrypted or compressed data",
                  "match_data": [
                    ".text"
                  ]
                }
              ]
            },
            {
              "id": "T1027.002",
              "name": "Software Packing",
              "link": "https://attack.mitre.org/techniques/T1027/002/",
              "description": "Adversaries may perform software packing or virtual machine software protection to conceal their code. Software packing is a method of compressing or encrypting an executable. Packing an executable changes the file signature in an attempt to avoid signature-based detection. Most decompression techniques decompress the executable code in memory. Virtual machine software protection translates an executable's original code into a special format that only a special virtual machine can run. A virtual machine is then called to run this code. \nUtilities used to perform software packing are called packers. Example packers are MPRESS and UPX. A more comprehensive list of known packers is available, but adversaries may create their own packing techniques that do not leave the same artifacts as well-known packers to evade defenses.  ",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "The binary likely contains encrypted or compressed data",
                  "match_data": [
                    ".text"
                  ]
                }
              ]
            },
            {
              "id": "T1564.001",
              "name": "Hidden Files and Directories",
              "link": "https://attack.mitre.org/techniques/T1564/001/",
              "description": "Adversaries may set files and directories to be hidden to evade detection mechanisms. To prevent normal users from accidentally changing special files on a system, most operating systems have the concept of a ‘hidden’ file. These files don’t show up when a user browses the file system with a GUI or when using normal commands on the command line. Users must explicitly ask to show the hidden files either via a series of Graphical User Interface (GUI) prompts or with command line switches (dir /a for Windows and ls –a for Linux and macOS).\nOn Linux and Mac, users can mark specific files as hidden simply by putting a “.” as the first character in the file or folder name   . Files and folders that start with a period, ‘.’, are by default hidden from being viewed in the Finder application and standard command-line utilities like “ls”. Users must specifically change settings to have these files viewable.\nFiles on macOS can also be marked with the UF_HIDDEN flag which prevents them from being seen in Finder.app, but still allows them to be seen in Terminal.app . On Windows, users can mark specific files as hidden by using the attrib.exe binary. Many applications create these hidden files and folders to store information so that it doesn’t clutter up the user’s workspace. For example, SSH utilities create a .ssh folder that’s hidden and contains the user’s known hosts and keys.\nAdditionally, adversaries may name files in a manner that would allow the file to be hidden such as naming a file only a “space” character.\nAdversaries can use this to their advantage to hide files and folders anywhere on the system and evading a typical user or system analysis that does not incorporate investigation of hidden files.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Creates a hidden or system file",
                  "match_data": [
                    "pid: 7008",
                    "C:\\Windows\\ServiceProfiles\\LocalService\\AppData\\Local\\FontCache\\Fonts\\Download-1.tmp"
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0003",
          "name": "Persistence",
          "link": "https://attack.mitre.org/tactics/TA0003/",
          "description": "The adversary is trying to maintain their foothold.\n\nPersistence consists of techniques that adversaries use to keep access to systems across restarts, changed credentials, and other interruptions that could cut off their access. Techniques used for persistence include any access, action, or configuration changes that let them maintain their foothold on systems, such as replacing or hijacking legitimate code or adding startup code. ",
          "techniques": [
            {
              "id": "T1542",
              "name": "Pre-OS Boot",
              "link": "https://attack.mitre.org/techniques/T1542/",
              "description": "Adversaries may abuse Pre-OS Boot mechanisms as a way to establish persistence on a system. During the booting process of a computer, firmware and various startup services are loaded before the operating system. These programs control flow of execution before the operating system takes control.\nAdversaries may overwrite data in boot drivers or firmware such as BIOS (Basic Input/Output System) and The Unified Extensible Firmware Interface (UEFI) to persist on systems at a layer below the operating system. This can be particularly difficult to detect as malware at this level will not be detected by host software-based defenses.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Attempted to write directly to a physical drive",
                  "match_data": [
                    "\\??\\PhysicalDrive0"
                  ]
                }
              ]
            },
            {
              "id": "T1542.003",
              "name": "Bootkit",
              "link": "https://attack.mitre.org/techniques/T1542/003/",
              "description": "Adversaries may use bootkits to persist on systems. A bootkit is a malware variant that modifies the boot sectors of a hard drive, allowing malicious code to execute before a computer's operating system has loaded. Bootkits reside at a layer below the operating system and may make it difficult to perform full remediation unless an organization suspects one was used and can act accordingly.\nIn BIOS systems, a bootkit may modify the Master Boot Record (MBR) and/or Volume Boot Record (VBR). The MBR is the section of disk that is first loaded after completing hardware initialization by the BIOS. It is the location of the boot loader. An adversary who has raw access to the boot drive may overwrite this area, diverting execution during startup from the normal boot loader to adversary code.\nThe MBR passes control of the boot process to the VBR. Similar to the case of MBR, an adversary who has raw access to the boot drive may overwrite the VBR to divert execution during startup to adversary code.\nIn UEFI (Unified Extensible Firmware Interface) systems, a bootkit may instead create or modify files in the EFI system partition (ESP). The ESP is a partition on data storage used by devices containing UEFI that allows the system to boot the OS and other utilities used by the system. An adversary can use the newly created or patched files in the ESP to run malicious kernel code.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Attempted to write directly to a physical drive",
                  "match_data": [
                    "\\??\\PhysicalDrive0"
                  ]
                },
                {
                  "severity": "MEDIUM",
                  "description": "Uses suspicious IO control codes",
                  "match_data": [
                    "pid: 1140"
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0004",
          "name": "Privilege Escalation",
          "link": "https://attack.mitre.org/tactics/TA0004/",
          "description": "The adversary is trying to gain higher-level permissions.\n\nPrivilege Escalation consists of techniques that adversaries use to gain higher-level permissions on a system or network. Adversaries can often enter and explore a network with unprivileged access but require elevated permissions to follow through on their objectives. Common approaches are to take advantage of system weaknesses, misconfigurations, and vulnerabilities. Examples of elevated access include: \n\n* SYSTEM/root level\n* local administrator\n* user account with admin-like access \n* user accounts with access to specific system or perform specific function\n\nThese techniques often overlap with Persistence techniques, as OS features that let an adversary persist can execute in an elevated context.  ",
          "techniques": [
            {
              "id": "T1055",
              "name": "Process Injection",
              "link": "https://attack.mitre.org/techniques/T1055/",
              "description": "Adversaries may inject code into processes in order to evade process-based defenses as well as possibly elevate privileges. Process injection is a method of executing arbitrary code in the address space of a separate live process. Running code in the context of another process may allow access to the process's memory, system/network resources, and possibly elevated privileges. Execution via process injection may also evade detection from security products since the execution is masked under a legitimate process. \nThere are many different ways to inject code into a process, many of which abuse legitimate functionalities. These implementations exist for every major OS but are typically platform specific. \nMore sophisticated samples may perform multiple process injections to segment modules and further evade detection, utilizing named pipes or other inter-process communication (IPC) mechanisms as a communication channel. ",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Resumed a thread in another process",
                  "match_data": [
                    "Process output.exe with process ID 6356 resumed a thread in another process with the process ID 6356",
                    "pid: 6356",
                    "Process afsfasfasfas.exe with process ID 6140 resumed a thread in another process with the process ID 6140",
                    "pid: 6140"
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0007",
          "name": "Discovery",
          "link": "https://attack.mitre.org/tactics/TA0007/",
          "description": "The adversary is trying to figure out your environment.\n\nDiscovery consists of techniques an adversary may use to gain knowledge about the system and internal network. These techniques help adversaries observe the environment and orient themselves before deciding how to act. They also allow adversaries to explore what they can control and what’s around their entry point in order to discover how it could benefit their current objective. Native operating system tools are often used toward this post-compromise information-gathering objective. ",
          "techniques": [
            {
              "id": "T1082",
              "name": "System Information Discovery",
              "link": "https://attack.mitre.org/techniques/T1082/",
              "description": "An adversary may attempt to get detailed information about the operating system and hardware, including version, patches, hotfixes, service packs, and architecture. Adversaries may use this information to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions. This behavior is distinct from Local Storage Discovery which is an adversary's discovery of local drive, disks and/or volumes.\nTools such as Systeminfo can be used to gather detailed system information. If running with privileged access, a breakdown of system data can be gathered through the systemsetup configuration tool on macOS. Adversaries may leverage a Network Device CLI on network devices to gather detailed system information (e.g. show version). On ESXi servers, threat actors may gather system information from various esxcli utilities, such as system hostname get and system version get.\nInfrastructure as a Service (IaaS) cloud providers such as AWS, GCP, and Azure allow access to instance and virtual machine information via APIs. Successful authenticated API calls can return data such as the operating system platform and status of a particular instance or the model view of a virtual machine.\nSystem Information Discovery combined with information gathered from other forms of discovery and reconnaissance can drive payload development and concealment. ",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Checks available memory",
                  "match_data": [
                    "pid: 6356",
                    "pid: 6140",
                    "pid: 3192",
                    "pid: 496",
                    "pid: 6788"
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0011",
          "name": "Command and Control",
          "link": "https://attack.mitre.org/tactics/TA0011/",
          "description": "The adversary is trying to communicate with compromised systems to control them.\n\nCommand and Control consists of techniques that adversaries may use to communicate with systems under their control within a victim network. Adversaries commonly attempt to mimic normal, expected traffic to avoid detection. There are many ways an adversary can establish command and control with various levels of stealth depending on the victim’s network structure and defenses.",
          "techniques": [
            {
              "id": "T1071",
              "name": "Application Layer Protocol",
              "link": "https://attack.mitre.org/techniques/T1071/",
              "description": "Adversaries may communicate using OSI application layer protocols to avoid detection/network filtering by blending in with existing traffic. Commands to the remote system, and often the results of those commands, will be embedded within the protocol traffic between the client and server. \nAdversaries may utilize many different protocols, including those used for web browsing, transferring files, electronic mail, DNS, or publishing/subscribing. For connections that occur internally within an enclave (such as those between a proxy or pivot node and other nodes), commonly used protocols are SMB, SSH, or RDP. ",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Anomalous binary characteristics",
                  "match_data": [
                    "Entrypoint of binary is located outside of any mapped sections"
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "Performs some HTTP requests",
                  "match_data": [
                    "http://ocsp.digicert.com/MFEwTzBNMEswSTAJBgUrDgMCGgUABBQ50otx%2Fh0Ztl%2Bz8SiPI7wEWVxDlQQUTiJUIBiV5uNu5g%2F6%2BrkS7QYXjzkCEApDqVCbATUviZV57HIIulA%3D",
                    "http://x1.c.lencr.org/"
                  ]
                },
                {
                  "severity": "MEDIUM",
                  "description": "Yara detections observed in process dumps, payloads or dropped files",
                  "match_data": [
                    "PID 6024 triggered the Yara rule 'shellcode_get_eip' with data '['{ E8 00 00 00 00 59 }']'",
                    "PID 5472 triggered the Yara rule 'shellcode_get_eip' with data '['{ E8 00 00 00 00 59 }']'",
                    "PID 3680 triggered the Yara rule 'shellcode_get_eip' with data '['{ E8 00 00 00 00 59 }']'",
                    "PID 1140 triggered the Yara rule 'shellcode_get_eip' with data '['{ E8 00 00 00 00 59 }']'",
                    "PID  triggered the Yara rule 'INDICATOR_SUSPICIOUS_EXE_NoneWindowsUA' with data '['M\\x00o\\x00z\\x00i\\x00l\\x00l\\x00a\\x00/\\x005\\x00.\\x000\\x00 \\x00(\\x00i\\x00P\\x00h\\x00o\\x00n\\x00e\\x00;\\x00 \\x00C\\x00P\\x00U\\x00 \\x00i\\x00P\\x00h\\x00o\\x00n\\x00e\\x00 \\x00O\\x00S\\x00']'"
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0040",
          "name": "Impact",
          "link": "https://attack.mitre.org/tactics/TA0040/",
          "description": "The adversary is trying to manipulate, interrupt, or destroy your systems and data.\n \nImpact consists of techniques that adversaries use to disrupt availability or compromise integrity by manipulating business and operational processes. Techniques used for impact can include destroying or tampering with data. In some cases, business processes can look fine, but may have been altered to benefit the adversaries’ goals. These techniques might be used by adversaries to follow through on their end goal or to provide cover for a confidentiality breach.",
          "techniques": [
            {
              "id": "T1496",
              "name": "Resource Hijacking",
              "link": "https://attack.mitre.org/techniques/T1496/",
              "description": "Adversaries may leverage the resources of co-opted systems to complete resource-intensive tasks, which may impact system and/or hosted service availability. \nResource hijacking may take a number of different forms. For example, adversaries may:\n\nLeverage compute resources in order to mine cryptocurrency\nSell network bandwidth to proxy networks\nGenerate SMS traffic for profit\nAbuse cloud-based messaging services to send large quantities of spam messages\n\nIn some cases, adversaries may leverage multiple types of Resource Hijacking at once.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Connects to crypto currency mining pool"
                }
              ]
            }
          ]
        }
      ]
    },
    "VMRay": {
      "tactics": [
        {
          "id": "TA0005",
          "name": "Defense Evasion",
          "link": "https://attack.mitre.org/tactics/TA0005/",
          "description": "The adversary is trying to avoid being detected.\n\nDefense Evasion consists of techniques that adversaries use to avoid detection throughout their compromise. Techniques used for defense evasion include uninstalling/disabling security software or obfuscating/encrypting data and scripts. Adversaries also leverage and abuse trusted processes to hide and masquerade their malware. Other tactics’ techniques are cross-listed here when those techniques include the added benefit of subverting defenses. ",
          "techniques": [
            {
              "id": "T1027",
              "name": "Obfuscated Files or Information",
              "link": "https://attack.mitre.org/techniques/T1027/",
              "description": "Adversaries may attempt to make an executable or file difficult to discover or analyze by encrypting, encoding, or otherwise obfuscating its contents on the system or in transit. This is common behavior that can be used across different platforms and the network to evade defenses. \nPayloads may be compressed, archived, or encrypted in order to avoid detection. These payloads may be used during Initial Access or later to mitigate detection. Sometimes a user's action may be required to open and Deobfuscate/Decode Files or Information for User Execution. The user may also be required to input a password to open a password protected compressed/encrypted file that was provided by the adversary.  Adversaries may also use compressed or archived scripts, such as JavaScript. \nPortions of files can also be encoded to hide the plain-text strings that would otherwise help defenders with discovery.  Payloads may also be split into separate, seemingly benign files that only reveal malicious functionality when reassembled. \nAdversaries may also abuse Command Obfuscation to obscure commands executed from payloads or directly via Command and Scripting Interpreter. Environment variables, aliases, characters, and other platform/language specific semantics can be used to evade signature based detections and application control mechanisms.   "
            },
            {
              "id": "T1027.002",
              "name": "Software Packing",
              "link": "https://attack.mitre.org/techniques/T1027/002/",
              "description": "Adversaries may perform software packing or virtual machine software protection to conceal their code. Software packing is a method of compressing or encrypting an executable. Packing an executable changes the file signature in an attempt to avoid signature-based detection. Most decompression techniques decompress the executable code in memory. Virtual machine software protection translates an executable's original code into a special format that only a special virtual machine can run. A virtual machine is then called to run this code. \nUtilities used to perform software packing are called packers. Example packers are MPRESS and UPX. A more comprehensive list of known packers is available, but adversaries may create their own packing techniques that do not leave the same artifacts as well-known packers to evade defenses.  ",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Resolves API functions dynamically",
                  "match_data": [
                    "(Process #3) as.exe resolves 59 API functions by name.",
                    "(Process #6) xclient.exe resolves 52 API functions by name.",
                    "(Process #5) whwhwhwh.exe resolves 52 API functions by name.",
                    "(Process #4) hahawh.exe resolves 52 API functions by name.",
                    "(Process #7) wwwsss.exe resolves 52 API functions by name.",
                    "(Process #2) afsfasfasfas.exe resolves 52 API functions by name.",
                    "(Process #46) explorer.exe resolves 59 API functions by name.",
                    "(Process #47) explorer.exe resolves 52 API functions by name.",
                    "(Process #53) wmiprvse.exe resolves 34 API functions by name."
                  ]
                }
              ]
            },
            {
              "id": "T1070",
              "name": "Indicator Removal",
              "link": "https://attack.mitre.org/techniques/T1070/",
              "description": "Adversaries may delete or modify artifacts generated within systems to remove evidence of their presence or hinder defenses. Various artifacts may be created by an adversary or something that can be attributed to an adversary’s actions. Typically these artifacts are used as defensive indicators related to monitored events, such as strings from downloaded files, logs that are generated from user actions, and other data analyzed by defenders. Location, format, and type of artifact (such as command or login history) are often specific to each platform.\nRemoval of these indicators may interfere with event collection, reporting, or other processes used to detect intrusion activity. This may compromise the integrity of security solutions by causing notable events to go unreported. This activity may also impede forensic analysis and incident response, due to lack of sufficient data to determine what occurred."
            },
            {
              "id": "T1070.004",
              "name": "File Deletion",
              "link": "https://attack.mitre.org/techniques/T1070/004/",
              "description": "Adversaries may delete files left behind by the actions of their intrusion activity. Malware, tools, or other non-native files dropped or created on a system by an adversary (ex: Ingress Tool Transfer) may leave traces to indicate to what was done within a network and how. Removal of these files can occur during an intrusion, or as part of a post-intrusion process to minimize the adversary's footprint.\nThere are tools available from the host operating system to perform cleanup, but adversaries may use other tools as well. Examples of built-in Command and Scripting Interpreter functions include del on Windows, rm or unlink on Linux and macOS, and rm on ESXi.",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Deletes file after execution",
                  "match_data": [
                    "(Process #46) explorer.exe deletes executed executable \"C:\\Users\\kEecfMwgj\\explorer.exe\".",
                    "(Process #47) explorer.exe deletes executed executable \"C:\\Users\\kEecfMwgj\\AppData\\Local\\Temp\\explorer.exe\"."
                  ]
                }
              ]
            },
            {
              "id": "T1112",
              "name": "Modify Registry",
              "link": "https://attack.mitre.org/techniques/T1112/",
              "description": "Adversaries may interact with the Windows Registry as part of a variety of other techniques to aid in defense evasion, persistence, and execution.\nAccess to specific areas of the Registry depends on account permissions, with some keys requiring administrator-level access. The built-in Windows command-line utility Reg may be used for local or remote Registry modification. Other tools, such as remote access tools, may also contain functionality to interact with the Registry through the Windows API.\nThe Registry may be modified in order to hide configuration information or malicious payloads via Obfuscated Files or Information. The Registry may also be modified to Impair Defenses, such as by enabling macros for all Microsoft Office products, allowing privilege escalation without alerting the user, increasing the maximum number of allowed outbound requests, and/or modifying systems to store plaintext credentials in memory.\nThe Registry of a remote system may be modified to aid in execution of files as part of lateral movement. It requires the remote Registry service to be running on the target system. Often Valid Accounts are required, along with access to the remote system's SMB/Windows Admin Shares for RPC communication.\nFinally, Registry modifications may also include actions to hide keys, such as prepending key names with a null character, which will cause an error and/or be ignored when read via Reg or other utilities using the Win32 API. Adversaries may abuse these pseudo-hidden keys to conceal payloads/commands used to maintain persistence.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Installs system startup script or application",
                  "match_data": [
                    "(Process #3) as.exe adds \"C:\\Users\\KEECFM~1\\AppData\\Local\\Temp\\explorer.exe\" to Windows startup via registry.",
                    "(Process #6) xclient.exe adds \"C:\\Users\\kEecfMwgj\\AppData\\Roaming\\explorer.exe\" to Windows startup via registry.",
                    "(Process #4) hahawh.exe adds \"C:\\Users\\Public\\explorer.exe\" to Windows startup via registry.",
                    "(Process #2) afsfasfasfas.exe adds \"C:\\Users\\kEecfMwgj\\AppData\\Local\\explorer.exe\" to Windows startup via registry.",
                    "(Process #5) whwhwhwh.exe adds \"C:\\ProgramData\\explorer.exe\" to Windows startup via registry.",
                    "(Process #7) wwwsss.exe adds \"C:\\Users\\kEecfMwgj\\explorer.exe\" to Windows startup via registry.",
                    "(Process #47) explorer.exe adds \"C:\\Users\\KEECFM~1\\AppData\\Local\\Temp\\explorer.exe\" to Windows startup via registry.",
                    "(Process #46) explorer.exe adds \"C:\\Users\\kEecfMwgj\\explorer.exe\" to Windows startup via registry."
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "Writes an unusually large amount of data to the registry",
                  "match_data": [
                    "(Process #3) as.exe hides 9200 bytes in \"HKEY_CURRENT_USER\\Software\\8D2D7C3748F29B750460\\CC52384910CEE944DDBCC575A8E0177BFA6B16E3032438B207797164D5C94B34\"."
                  ]
                }
              ]
            },
            {
              "id": "T1134",
              "name": "Access Token Manipulation",
              "link": "https://attack.mitre.org/techniques/T1134/",
              "description": "Adversaries may modify access tokens to operate under a different user or system security context to perform actions and bypass access controls. Windows uses access tokens to determine the ownership of a running process. A user can manipulate access tokens to make a running process appear as though it is the child of a different process or belongs to someone other than the user that started the process. When this occurs, the process also takes on the security context associated with the new token.\nAn adversary can use built-in Windows API functions to copy access tokens from existing processes; this is known as token stealing. These token can then be applied to an existing process (i.e. Token Impersonation/Theft) or used to spawn a new process (i.e. Create Process with Token). An adversary must already be in a privileged user context (i.e. administrator) to steal a token. However, adversaries commonly use token stealing to elevate their security context from the administrator level to the SYSTEM level. An adversary can then use a token to authenticate to a remote system as the account for that token if the account has appropriate permissions on the remote system.\nAny standard user can use the runas command, and the Windows API functions, to create impersonation tokens; it does not require access to an administrator account. There are also other mechanisms, such as Active Directory fields, that can be used to modify access tokens.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Enables process privileges",
                  "match_data": [
                    "(Process #4) hahawh.exe enables process privilege \"SeDebugPrivilege\".",
                    "(Process #3) as.exe enables process privilege \"SeDebugPrivilege\".",
                    "(Process #2) afsfasfasfas.exe enables process privilege \"SeDebugPrivilege\".",
                    "(Process #6) xclient.exe enables process privilege \"SeDebugPrivilege\".",
                    "(Process #7) wwwsss.exe enables process privilege \"SeDebugPrivilege\".",
                    "(Process #5) whwhwhwh.exe enables process privilege \"SeDebugPrivilege\".",
                    "(Process #46) explorer.exe enables process privilege \"SeDebugPrivilege\".",
                    "(Process #47) explorer.exe enables process privilege \"SeDebugPrivilege\".",
                    "(Process #55) explorer.exe enables process privilege \"SeDebugPrivilege\".",
                    "(Process #56) explorer.exe enables process privilege \"SeDebugPrivilege\"."
                  ]
                }
              ]
            },
            {
              "id": "T1562",
              "name": "Impair Defenses",
              "link": "https://attack.mitre.org/techniques/T1562/",
              "description": "Adversaries may maliciously modify components of a victim environment in order to hinder or disable defensive mechanisms. This not only involves impairing preventative defenses, such as firewalls and anti-virus, but also detection capabilities that defenders can use to audit activity and identify malicious behavior. This may also span both native defenses as well as supplemental capabilities installed by users and administrators.\nAdversaries may also impair routine operations that contribute to defensive hygiene, such as blocking users from logging out, preventing a system from shutting down, or disabling or modifying the update process. Adversaries could also target event aggregation and analysis mechanisms, or otherwise disrupt these procedures by altering other system components. These restrictions can further enable malicious operations as well as the continued propagation of incidents."
            },
            {
              "id": "T1562.001",
              "name": "Disable or Modify Tools",
              "link": "https://attack.mitre.org/techniques/T1562/001/",
              "description": "Adversaries may modify and/or disable security tools to avoid possible detection of their malware/tools and activities. This may take many forms, such as killing security software processes or services, modifying / deleting Registry keys or configuration files so that tools do not operate properly, or other methods to interfere with security tools scanning or reporting information. Adversaries may also disable updates to prevent the latest security patches from reaching tools on victim systems.\nAdversaries may trigger a denial-of-service attack via legitimate system processes. It has been previously observed that the Windows Time Travel Debugging (TTD) monitor driver can be used to initiate a debugging session for a security tool (e.g., an EDR) and render the tool non-functional.  By hooking the debugger into the EDR process, all child processes from the EDR will be automatically suspended. The attacker can terminate any EDR helper processes (unprotected by Windows Protected Process Light) by abusing the Process Explorer driver. In combination this will halt any attempt to restart services and cause the tool to crash.\nAdversaries may also tamper with artifacts deployed and utilized by security tools. Security tools may make dynamic changes to system components in order to maintain visibility into specific events. For example, security products may load their own modules and/or modify those loaded by processes to facilitate data collection. Similar to Indicator Blocking, adversaries may unhook or otherwise modify these features added by tools (especially those that exist in userland or are otherwise potentially accessible to adversaries) to avoid detection. For example, adversaries may abuse the Windows process mitigation policy to block certain endpoint detection and response (EDR) products from loading their user-mode code via DLLs. By spawning a process with the PROCESS_CREATION_MITIGATION_POLICY_BLOCK_NON_MICROSOFT_BINARIES_ALWAYS_ON attribute using API calls like UpdateProcThreadAttribute, adversaries may evade detection by endpoint security solutions that rely on DLLs that are not signed by Microsoft. Alternatively, they may add new directories to an EDR tool’s exclusion list, enabling them to hide malicious files via File/Path Exclusions.\nAdversaries may also focus on specific applications such as Sysmon. For example, the “Start” and “Enable” values in HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\WMI\\Autologger\\EventLog-Microsoft-Windows-Sysmon-Operational may be modified to tamper with and potentially disable Sysmon logging. \nOn network devices, adversaries may attempt to skip digital signature verification checks by altering startup configuration files and effectively disabling firmware verification that typically occurs at boot.\nIn cloud environments, tools disabled by adversaries may include cloud monitoring agents that report back to services such as AWS CloudWatch or Google Cloud Monitor.\nFurthermore, although defensive tools may have anti-tampering mechanisms, adversaries may abuse tools such as legitimate rootkit removal kits to impair and/or disable these tools. For example, adversaries have used tools such as GMER to find and shut down hidden processes and antivirus software on infected systems.\nAdditionally, adversaries may exploit legitimate drivers from anti-virus software to gain access to kernel space (i.e. Exploitation for Privilege Escalation), which may lead to bypassing anti-tampering features.",
              "signatures": [
                {
                  "severity": "HIGH",
                  "description": "Modifies Windows Defender configuration",
                  "match_data": [
                    "(Process #6) xclient.exe uses (Process #8) powershell.exe to add \"C:\\Users\\kEecfMwgj\\Desktop\\XClient.exe\" to Windows Defender exclusions.",
                    "(Process #5) whwhwhwh.exe uses (Process #9) powershell.exe to add \"C:\\Users\\kEecfMwgj\\Desktop\\whwhwhwh.exe\" to Windows Defender exclusions.",
                    "(Process #7) wwwsss.exe uses (Process #10) powershell.exe to add \"C:\\Users\\kEecfMwgj\\Desktop\\wwwsss.exe\" to Windows Defender exclusions.",
                    "(Process #2) afsfasfasfas.exe uses (Process #11) powershell.exe to add \"C:\\Users\\kEecfMwgj\\Desktop\\afsfasfasfas.exe\" to Windows Defender exclusions.",
                    "(Process #3) as.exe uses (Process #12) powershell.exe to add \"C:\\Users\\kEecfMwgj\\Desktop\\as.exe\" to Windows Defender exclusions.",
                    "(Process #4) hahawh.exe uses (Process #13) powershell.exe to add \"C:\\Users\\kEecfMwgj\\Desktop\\hahawh.exe\" to Windows Defender exclusions.",
                    "(Process #5) whwhwhwh.exe uses (Process #14) powershell.exe to add process \"whwhwhwh.exe\" to Windows Defender exclusions.",
                    "(Process #7) wwwsss.exe uses (Process #15) powershell.exe to add process \"wwwsss.exe\" to Windows Defender exclusions.",
                    "(Process #6) xclient.exe uses (Process #16) powershell.exe to add process \"XClient.exe\" to Windows Defender exclusions.",
                    "(Process #3) as.exe uses (Process #17) powershell.exe to add process \"as.exe\" to Windows Defender exclusions."
                  ]
                }
              ]
            },
            {
              "id": "T1564",
              "name": "Hide Artifacts",
              "link": "https://attack.mitre.org/techniques/T1564/",
              "description": "Adversaries may attempt to hide artifacts associated with their behaviors to evade detection. Operating systems may have features to hide various artifacts, such as important system files and administrative task execution, to avoid disrupting user work environments and prevent users from changing files or features on the system. Adversaries may abuse these features to hide artifacts such as files, directories, user accounts, or other system activity to evade detection.\nAdversaries may also attempt to hide artifacts associated with malicious behavior by creating computing regions that are isolated from common security instrumentation, such as through the use of virtualization technology."
            },
            {
              "id": "T1564.003",
              "name": "Hidden Window",
              "link": "https://attack.mitre.org/techniques/T1564/003/",
              "description": "Adversaries may use hidden windows to conceal malicious activity from the plain sight of users. In some cases, windows that would typically be displayed when an application carries out an operation can be hidden. This may be utilized by system administrators to avoid disrupting user work environments when carrying out administrative tasks. \nAdversaries may abuse these functionalities to hide otherwise visible windows from users so as not to alert the user to adversary activity on the system.\nOn macOS, the configurations for how applications run are listed in property list (plist) files. One of the tags in these files can be apple.awt.UIElement, which allows for Java applications to prevent the application's icon from appearing in the Dock. A common use for this is when applications run in the system tray, but don't also want to show up in the Dock.\nSimilarly, on Windows there are a variety of features in scripting languages, such as PowerShell, Jscript, and Visual Basic to make windows hidden. One example of this is powershell.exe -WindowStyle Hidden.\nThe Windows Registry can also be edited to hide application windows from the current user. For example, by setting the WindowPosition subkey in the HKEY_CURRENT_USER\\Console\\%SystemRoot%_System32_WindowsPowerShell_v1.0_PowerShell.exe Registry key to a maximum value, PowerShell windows will open off screen and be hidden.\nIn addition, Windows supports the CreateDesktop() API that can create a hidden desktop window with its own corresponding explorer.exe process.  All applications running on the hidden desktop window, such as a hidden VNC (hVNC) session, will be invisible to other desktops windows.\nAdversaries may also leverage cmd.exe as a parent process, and then utilize a LOLBin, such as DeviceCredentialDeployment.exe, to hide windows.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Creates process with hidden window",
                  "match_data": [
                    "(Process #6) xclient.exe starts (process #8) powershell.exe with a hidden window.",
                    "(Process #7) wwwsss.exe starts (process #10) powershell.exe with a hidden window.",
                    "(Process #2) afsfasfasfas.exe starts (process #11) powershell.exe with a hidden window.",
                    "(Process #3) as.exe starts (process #12) powershell.exe with a hidden window.",
                    "(Process #5) whwhwhwh.exe starts (process #9) powershell.exe with a hidden window.",
                    "(Process #4) hahawh.exe starts (process #13) powershell.exe with a hidden window.",
                    "(Process #5) whwhwhwh.exe starts (process #14) powershell.exe with a hidden window.",
                    "(Process #7) wwwsss.exe starts (process #15) powershell.exe with a hidden window.",
                    "(Process #4) hahawh.exe starts (process #18) powershell.exe with a hidden window.",
                    "(Process #3) as.exe starts (process #17) powershell.exe with a hidden window."
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0002",
          "name": "Execution",
          "link": "https://attack.mitre.org/tactics/TA0002/",
          "description": "The adversary is trying to run malicious code.\n\nExecution consists of techniques that result in adversary-controlled code running on a local or remote system. Techniques that run malicious code are often paired with techniques from all other tactics to achieve broader goals, like exploring a network or stealing data. For example, an adversary might use a remote access tool to run a PowerShell script that does Remote System Discovery. ",
          "techniques": [
            {
              "id": "T1047",
              "name": "Windows Management Instrumentation",
              "link": "https://attack.mitre.org/techniques/T1047/",
              "description": "Adversaries may abuse Windows Management Instrumentation (WMI) to execute malicious commands and payloads. WMI is designed for programmers and is the infrastructure for management data and operations on Windows systems. WMI is an administration feature that provides a uniform environment to access Windows system components.\nThe WMI service enables both local and remote access, though the latter is facilitated by Remote Services such as Distributed Component Object Model and Windows Remote Management. Remote WMI over DCOM operates using port 135, whereas WMI over WinRM operates over port 5985 when using HTTP and 5986 for HTTPS. \nAn adversary can use WMI to interact with local and remote systems and use it as a means to execute various behaviors, such as gathering information for Discovery as well as Execution of commands and payloads. For example, wmic.exe can be abused by an adversary to delete shadow copies with the command wmic.exe Shadowcopy Delete (i.e., Inhibit System Recovery).\nNote: wmic.exe is deprecated as of January of 2024, with the WMIC feature being “disabled by default” on Windows 11+. WMIC will be removed from subsequent Windows releases and replaced by PowerShell as the primary WMI interface. In addition to PowerShell and tools like wbemtool.exe, COM APIs can also be used to programmatically interact with WMI via C++, .NET, VBScript, etc.",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Queries OS version via WMI",
                  "match_data": [
                    "(Process #6) xclient.exe queries OS version via WMI query: select * from Win32_OperatingSystem.",
                    "(Process #5) whwhwhwh.exe queries OS version via WMI query: select * from Win32_OperatingSystem.",
                    "(Process #3) as.exe queries OS version via WMI query: select * from Win32_OperatingSystem.",
                    "(Process #7) wwwsss.exe queries OS version via WMI query: select * from Win32_OperatingSystem.",
                    "(Process #4) hahawh.exe queries OS version via WMI query: select * from Win32_OperatingSystem.",
                    "(Process #2) afsfasfasfas.exe queries OS version via WMI query: select * from Win32_OperatingSystem.",
                    "(Process #47) explorer.exe queries OS version via WMI query: select * from Win32_OperatingSystem.",
                    "(Process #46) explorer.exe queries OS version via WMI query: select * from Win32_OperatingSystem."
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "Collects hardware properties",
                  "match_data": [
                    "(Process #6) xclient.exe queries hardware properties via WMI: SELECT * FROM Win32_VideoController.",
                    "(Process #5) whwhwhwh.exe queries hardware properties via WMI: SELECT * FROM Win32_VideoController.",
                    "(Process #3) as.exe queries hardware properties via WMI: SELECT * FROM Win32_VideoController.",
                    "(Process #7) wwwsss.exe queries hardware properties via WMI: SELECT * FROM Win32_VideoController.",
                    "(Process #4) hahawh.exe queries hardware properties via WMI: SELECT * FROM Win32_VideoController.",
                    "(Process #2) afsfasfasfas.exe queries hardware properties via WMI: SELECT * FROM Win32_VideoController.",
                    "(Process #47) explorer.exe queries hardware properties via WMI: SELECT * FROM Win32_VideoController.",
                    "(Process #46) explorer.exe queries hardware properties via WMI: SELECT * FROM Win32_VideoController."
                  ]
                },
                {
                  "severity": "MEDIUM",
                  "description": "Tries to detect the presence of antivirus software",
                  "match_data": [
                    "(Process #6) xclient.exe tries to detect antivirus software via WMI query: \"Select * from AntivirusProduct\".",
                    "(Process #5) whwhwhwh.exe tries to detect antivirus software via WMI query: \"Select * from AntivirusProduct\".",
                    "(Process #3) as.exe tries to detect antivirus software via WMI query: \"Select * from AntivirusProduct\".",
                    "(Process #7) wwwsss.exe tries to detect antivirus software via WMI query: \"Select * from AntivirusProduct\".",
                    "(Process #4) hahawh.exe tries to detect antivirus software via WMI query: \"Select * from AntivirusProduct\".",
                    "(Process #2) afsfasfasfas.exe tries to detect antivirus software via WMI query: \"Select * from AntivirusProduct\".",
                    "(Process #47) explorer.exe tries to detect antivirus software via WMI query: \"Select * from AntivirusProduct\".",
                    "(Process #46) explorer.exe tries to detect antivirus software via WMI query: \"Select * from AntivirusProduct\"."
                  ]
                }
              ]
            },
            {
              "id": "T1053",
              "name": "Scheduled Task/Job",
              "link": "https://attack.mitre.org/techniques/T1053/",
              "description": "Adversaries may abuse task scheduling functionality to facilitate initial or recurring execution of malicious code. Utilities exist within all major operating systems to schedule programs or scripts to be executed at a specified date and time. A task can also be scheduled on a remote system, provided the proper authentication is met (ex: RPC and file and printer sharing in Windows environments). Scheduling a task on a remote system typically may require being a member of an admin or otherwise privileged group on the remote system.\nAdversaries may use task scheduling to execute programs at system startup or on a scheduled basis for persistence. These mechanisms can also be abused to run a process under the context of a specified account (such as one with elevated permissions/privileges). Similar to System Binary Proxy Execution, adversaries have also abused task scheduling to potentially mask one-time execution under a trusted system process."
            },
            {
              "id": "T1053.005",
              "name": "Scheduled Task",
              "link": "https://attack.mitre.org/techniques/T1053/005/",
              "description": "Adversaries may abuse the Windows Task Scheduler to perform task scheduling for initial or recurring execution of malicious code. There are multiple ways to access the Task Scheduler in Windows. The schtasks utility can be run directly on the command line, or the Task Scheduler can be opened through the GUI within the Administrator Tools section of the Control Panel. In some cases, adversaries have used a .NET wrapper for the Windows Task Scheduler, and alternatively, adversaries have used the Windows netapi32 library and Windows Management Instrumentation (WMI) to create a scheduled task. Adversaries may also utilize the Powershell Cmdlet Invoke-CimMethod, which leverages WMI class PS_ScheduledTask to create a scheduled task via an XML path.\nAn adversary may use Windows Task Scheduler to execute programs at system startup or on a scheduled basis for persistence. The Windows Task Scheduler can also be abused to conduct remote Execution as part of Lateral Movement and/or to run a process under the context of a specified account (such as SYSTEM). Similar to System Binary Proxy Execution, adversaries have also abused the Windows Task Scheduler to potentially mask one-time execution under signed/trusted system processes.\nAdversaries may also create \"hidden\" scheduled tasks (i.e. Hide Artifacts) that may not be visible to defender tools and manual queries used to enumerate tasks. Specifically, an adversary may hide a task from schtasks /query and the Task Scheduler by deleting the associated Security Descriptor (SD) registry value (where deletion of this value must be completed using SYSTEM permissions). Adversaries may also employ alternate methods to hide tasks, such as altering the metadata (e.g., Index value) within associated registry keys. ",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Schedules task",
                  "match_data": [
                    "Schedules task for command \"C:\\Users\\KEECFM~1\\AppData\\Local\\Temp\\explorer.exe\", to be triggered by TIME. Task has been rescheduled by the analyzer.",
                    "Schedules task for command \"C:\\Users\\kEecfMwgj\\AppData\\Roaming\\explorer.exe\", to be triggered by TIME. Task has been rescheduled by the analyzer.",
                    "Schedules task for command \"C:\\Users\\Public\\explorer.exe\", to be triggered by TIME. Task has been rescheduled by the analyzer.",
                    "Schedules task for command \"C:\\Users\\kEecfMwgj\\AppData\\Local\\explorer.exe\", to be triggered by TIME. Task has been rescheduled by the analyzer.",
                    "Schedules task for command \"C:\\ProgramData\\explorer.exe\", to be triggered by TIME. Task has been rescheduled by the analyzer.",
                    "Schedules task for command \"C:\\Users\\kEecfMwgj\\explorer.exe\", to be triggered by TIME. Task has been rescheduled by the analyzer."
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "Schedules task via schtasks",
                  "match_data": [
                    "Schedules task \"explorer\" via the schtasks command line utility."
                  ]
                }
              ]
            },
            {
              "id": "T1059",
              "name": "Command and Scripting Interpreter",
              "link": "https://attack.mitre.org/techniques/T1059/",
              "description": "Adversaries may abuse command and script interpreters to execute commands, scripts, or binaries. These interfaces and languages provide ways of interacting with computer systems and are a common feature across many different platforms. Most systems come with some built-in command-line interface and scripting capabilities, for example, macOS and Linux distributions include some flavor of Unix Shell while Windows installations include the Windows Command Shell and PowerShell.\nThere are also cross-platform interpreters such as Python, as well as those commonly associated with client applications such as JavaScript and Visual Basic.\nAdversaries may abuse these technologies in various ways as a means of executing arbitrary commands. Commands and scripts can be embedded in Initial Access payloads delivered to victims as lure documents or as secondary payloads downloaded from an existing C2. Adversaries may also execute commands through interactive terminals/shells, as well as utilize various Remote Services in order to achieve remote Execution."
            },
            {
              "id": "T1059.001",
              "name": "PowerShell",
              "link": "https://attack.mitre.org/techniques/T1059/001/",
              "description": "Adversaries may abuse PowerShell commands and scripts for execution. PowerShell is a powerful interactive command-line interface and scripting environment included in the Windows operating system. Adversaries can use PowerShell to perform a number of actions, including discovery of information and execution of code. Examples include the Start-Process cmdlet which can be used to run an executable and the Invoke-Command cmdlet which runs a command locally or on a remote computer (though administrator permissions are required to use PowerShell to connect to remote systems).\nPowerShell may also be used to download and run executables from the Internet, which can be executed from disk or in memory without touching disk.\nA number of PowerShell-based offensive testing tools are available, including Empire,  PowerSploit, PoshC2, and PSAttack.\nPowerShell commands/scripts can also be executed without directly invoking the powershell.exe binary through interfaces to PowerShell's underlying System.Management.Automation assembly DLL exposed through the .NET framework and Windows Common Language Interface (CLI).",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Bypasses PowerShell execution policy",
                  "match_data": [
                    "(Process #6) xclient.exe bypasses PowerShell execution policy via (Process #8) powershell.exe.",
                    "(Process #5) whwhwhwh.exe bypasses PowerShell execution policy via (Process #9) powershell.exe.",
                    "(Process #7) wwwsss.exe bypasses PowerShell execution policy via (Process #10) powershell.exe.",
                    "(Process #2) afsfasfasfas.exe bypasses PowerShell execution policy via (Process #11) powershell.exe.",
                    "(Process #3) as.exe bypasses PowerShell execution policy via (Process #12) powershell.exe.",
                    "(Process #4) hahawh.exe bypasses PowerShell execution policy via (Process #13) powershell.exe.",
                    "(Process #5) whwhwhwh.exe bypasses PowerShell execution policy via (Process #14) powershell.exe.",
                    "(Process #7) wwwsss.exe bypasses PowerShell execution policy via (Process #15) powershell.exe.",
                    "(Process #6) xclient.exe bypasses PowerShell execution policy via (Process #16) powershell.exe.",
                    "(Process #3) as.exe bypasses PowerShell execution policy via (Process #17) powershell.exe."
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0003",
          "name": "Persistence",
          "link": "https://attack.mitre.org/tactics/TA0003/",
          "description": "The adversary is trying to maintain their foothold.\n\nPersistence consists of techniques that adversaries use to keep access to systems across restarts, changed credentials, and other interruptions that could cut off their access. Techniques used for persistence include any access, action, or configuration changes that let them maintain their foothold on systems, such as replacing or hijacking legitimate code or adding startup code. ",
          "techniques": [
            {
              "id": "T1053",
              "name": "Scheduled Task/Job",
              "link": "https://attack.mitre.org/techniques/T1053/",
              "description": "Adversaries may abuse task scheduling functionality to facilitate initial or recurring execution of malicious code. Utilities exist within all major operating systems to schedule programs or scripts to be executed at a specified date and time. A task can also be scheduled on a remote system, provided the proper authentication is met (ex: RPC and file and printer sharing in Windows environments). Scheduling a task on a remote system typically may require being a member of an admin or otherwise privileged group on the remote system.\nAdversaries may use task scheduling to execute programs at system startup or on a scheduled basis for persistence. These mechanisms can also be abused to run a process under the context of a specified account (such as one with elevated permissions/privileges). Similar to System Binary Proxy Execution, adversaries have also abused task scheduling to potentially mask one-time execution under a trusted system process."
            },
            {
              "id": "T1053.005",
              "name": "Scheduled Task",
              "link": "https://attack.mitre.org/techniques/T1053/005/",
              "description": "Adversaries may abuse the Windows Task Scheduler to perform task scheduling for initial or recurring execution of malicious code. There are multiple ways to access the Task Scheduler in Windows. The schtasks utility can be run directly on the command line, or the Task Scheduler can be opened through the GUI within the Administrator Tools section of the Control Panel. In some cases, adversaries have used a .NET wrapper for the Windows Task Scheduler, and alternatively, adversaries have used the Windows netapi32 library and Windows Management Instrumentation (WMI) to create a scheduled task. Adversaries may also utilize the Powershell Cmdlet Invoke-CimMethod, which leverages WMI class PS_ScheduledTask to create a scheduled task via an XML path.\nAn adversary may use Windows Task Scheduler to execute programs at system startup or on a scheduled basis for persistence. The Windows Task Scheduler can also be abused to conduct remote Execution as part of Lateral Movement and/or to run a process under the context of a specified account (such as SYSTEM). Similar to System Binary Proxy Execution, adversaries have also abused the Windows Task Scheduler to potentially mask one-time execution under signed/trusted system processes.\nAdversaries may also create \"hidden\" scheduled tasks (i.e. Hide Artifacts) that may not be visible to defender tools and manual queries used to enumerate tasks. Specifically, an adversary may hide a task from schtasks /query and the Task Scheduler by deleting the associated Security Descriptor (SD) registry value (where deletion of this value must be completed using SYSTEM permissions). Adversaries may also employ alternate methods to hide tasks, such as altering the metadata (e.g., Index value) within associated registry keys. ",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Schedules task",
                  "match_data": [
                    "Schedules task for command \"C:\\Users\\KEECFM~1\\AppData\\Local\\Temp\\explorer.exe\", to be triggered by TIME. Task has been rescheduled by the analyzer.",
                    "Schedules task for command \"C:\\Users\\kEecfMwgj\\AppData\\Roaming\\explorer.exe\", to be triggered by TIME. Task has been rescheduled by the analyzer.",
                    "Schedules task for command \"C:\\Users\\Public\\explorer.exe\", to be triggered by TIME. Task has been rescheduled by the analyzer.",
                    "Schedules task for command \"C:\\Users\\kEecfMwgj\\AppData\\Local\\explorer.exe\", to be triggered by TIME. Task has been rescheduled by the analyzer.",
                    "Schedules task for command \"C:\\ProgramData\\explorer.exe\", to be triggered by TIME. Task has been rescheduled by the analyzer.",
                    "Schedules task for command \"C:\\Users\\kEecfMwgj\\explorer.exe\", to be triggered by TIME. Task has been rescheduled by the analyzer."
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "Schedules task via schtasks",
                  "match_data": [
                    "Schedules task \"explorer\" via the schtasks command line utility."
                  ]
                }
              ]
            },
            {
              "id": "T1112",
              "name": "Modify Registry",
              "link": "https://attack.mitre.org/techniques/T1112/",
              "description": "Adversaries may interact with the Windows Registry as part of a variety of other techniques to aid in defense evasion, persistence, and execution.\nAccess to specific areas of the Registry depends on account permissions, with some keys requiring administrator-level access. The built-in Windows command-line utility Reg may be used for local or remote Registry modification. Other tools, such as remote access tools, may also contain functionality to interact with the Registry through the Windows API.\nThe Registry may be modified in order to hide configuration information or malicious payloads via Obfuscated Files or Information. The Registry may also be modified to Impair Defenses, such as by enabling macros for all Microsoft Office products, allowing privilege escalation without alerting the user, increasing the maximum number of allowed outbound requests, and/or modifying systems to store plaintext credentials in memory.\nThe Registry of a remote system may be modified to aid in execution of files as part of lateral movement. It requires the remote Registry service to be running on the target system. Often Valid Accounts are required, along with access to the remote system's SMB/Windows Admin Shares for RPC communication.\nFinally, Registry modifications may also include actions to hide keys, such as prepending key names with a null character, which will cause an error and/or be ignored when read via Reg or other utilities using the Win32 API. Adversaries may abuse these pseudo-hidden keys to conceal payloads/commands used to maintain persistence.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Installs system startup script or application",
                  "match_data": [
                    "(Process #3) as.exe adds \"C:\\Users\\KEECFM~1\\AppData\\Local\\Temp\\explorer.exe\" to Windows startup via registry.",
                    "(Process #6) xclient.exe adds \"C:\\Users\\kEecfMwgj\\AppData\\Roaming\\explorer.exe\" to Windows startup via registry.",
                    "(Process #4) hahawh.exe adds \"C:\\Users\\Public\\explorer.exe\" to Windows startup via registry.",
                    "(Process #2) afsfasfasfas.exe adds \"C:\\Users\\kEecfMwgj\\AppData\\Local\\explorer.exe\" to Windows startup via registry.",
                    "(Process #5) whwhwhwh.exe adds \"C:\\ProgramData\\explorer.exe\" to Windows startup via registry.",
                    "(Process #7) wwwsss.exe adds \"C:\\Users\\kEecfMwgj\\explorer.exe\" to Windows startup via registry.",
                    "(Process #47) explorer.exe adds \"C:\\Users\\KEECFM~1\\AppData\\Local\\Temp\\explorer.exe\" to Windows startup via registry.",
                    "(Process #46) explorer.exe adds \"C:\\Users\\kEecfMwgj\\explorer.exe\" to Windows startup via registry."
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "Writes an unusually large amount of data to the registry",
                  "match_data": [
                    "(Process #3) as.exe hides 9200 bytes in \"HKEY_CURRENT_USER\\Software\\8D2D7C3748F29B750460\\CC52384910CEE944DDBCC575A8E0177BFA6B16E3032438B207797164D5C94B34\"."
                  ]
                }
              ]
            },
            {
              "id": "T1547",
              "name": "Boot or Logon Autostart Execution",
              "link": "https://attack.mitre.org/techniques/T1547/",
              "description": "Adversaries may configure system settings to automatically execute a program during system boot or logon to maintain persistence or gain higher-level privileges on compromised systems. Operating systems may have mechanisms for automatically running a program on system boot or account logon. These mechanisms may include automatically executing programs that are placed in specially designated directories or are referenced by repositories that store configuration information, such as the Windows Registry. An adversary may achieve the same goal by modifying or extending features of the kernel.\nSince some boot or logon autostart programs run with higher privileges, an adversary may leverage these to elevate privileges."
            },
            {
              "id": "T1547.001",
              "name": "Registry Run Keys / Startup Folder",
              "link": "https://attack.mitre.org/techniques/T1547/001/",
              "description": "Adversaries may achieve persistence by adding a program to a startup folder or referencing it with a Registry run key. Adding an entry to the \"run keys\" in the Registry or startup folder will cause the program referenced to be executed when a user logs in. These programs will be executed under the context of the user and will have the account's associated permissions level.\nThe following run keys are created by default on Windows systems:\n\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnce\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnce\n\nRun keys may exist under multiple hives. The HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnceEx is also available but is not created by default on Windows Vista and newer. Registry run key entries can reference programs directly or list them as a dependency. For example, it is possible to load a DLL at logon using a \"Depend\" key with RunOnceEx: reg add HKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\RunOnceEx\\0001\\Depend /v 1 /d \"C:\\temp\\evil[.]dll\" \nPlacing a program within a startup folder will also cause that program to execute when a user logs in. There is a startup folder location for individual user accounts as well as a system-wide startup folder that will be checked regardless of which user account logs in. The startup folder path for the current user is C:\\Users\\[Username]\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup. The startup folder path for all users is C:\\ProgramData\\Microsoft\\Windows\\Start Menu\\Programs\\StartUp.\nThe following Registry keys can be used to set startup folder items for persistence:\n\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell Folders\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Shell Folders\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Shell Folders\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell Folders\n\nThe following Registry keys can control automatic startup of services during boot:\n\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServicesOnce\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServicesOnce\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServices\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServices\n\nUsing policy settings to specify startup programs creates corresponding values in either of two Registry keys:\n\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer\\Run\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer\\Run\n\nPrograms listed in the load value of the registry key HKEY_CURRENT_USER\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Windows run automatically for the currently logged-on user.\nBy default, the multistring BootExecute value of the registry key HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\Session Manager is set to autocheck autochk *. This value causes Windows, at startup, to check the file-system integrity of the hard disks if the system has been shut down abnormally. Adversaries can add other programs or processes to this registry value which will automatically launch at boot.\nAdversaries can use these configuration locations to execute malware, such as remote access tools, to maintain persistence through system reboots. Adversaries may also use Masquerading to make the Registry entries look as if they are associated with legitimate programs.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Installs system startup script or application",
                  "match_data": [
                    "(Process #3) as.exe adds \"C:\\Users\\KEECFM~1\\AppData\\Local\\Temp\\explorer.exe\" to Windows startup via registry.",
                    "(Process #6) xclient.exe adds \"C:\\Users\\kEecfMwgj\\AppData\\Roaming\\explorer.exe\" to Windows startup via registry.",
                    "(Process #4) hahawh.exe adds \"C:\\Users\\Public\\explorer.exe\" to Windows startup via registry.",
                    "(Process #2) afsfasfasfas.exe adds \"C:\\Users\\kEecfMwgj\\AppData\\Local\\explorer.exe\" to Windows startup via registry.",
                    "(Process #5) whwhwhwh.exe adds \"C:\\ProgramData\\explorer.exe\" to Windows startup via registry.",
                    "(Process #7) wwwsss.exe adds \"C:\\Users\\kEecfMwgj\\explorer.exe\" to Windows startup via registry.",
                    "(Process #47) explorer.exe adds \"C:\\Users\\KEECFM~1\\AppData\\Local\\Temp\\explorer.exe\" to Windows startup via registry.",
                    "(Process #46) explorer.exe adds \"C:\\Users\\kEecfMwgj\\explorer.exe\" to Windows startup via registry.",
                    "Adds \"C:\\Users\\kEecfMwgj\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup\\explorer.lnk\" to Windows startup folder."
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0004",
          "name": "Privilege Escalation",
          "link": "https://attack.mitre.org/tactics/TA0004/",
          "description": "The adversary is trying to gain higher-level permissions.\n\nPrivilege Escalation consists of techniques that adversaries use to gain higher-level permissions on a system or network. Adversaries can often enter and explore a network with unprivileged access but require elevated permissions to follow through on their objectives. Common approaches are to take advantage of system weaknesses, misconfigurations, and vulnerabilities. Examples of elevated access include: \n\n* SYSTEM/root level\n* local administrator\n* user account with admin-like access \n* user accounts with access to specific system or perform specific function\n\nThese techniques often overlap with Persistence techniques, as OS features that let an adversary persist can execute in an elevated context.  ",
          "techniques": [
            {
              "id": "T1053",
              "name": "Scheduled Task/Job",
              "link": "https://attack.mitre.org/techniques/T1053/",
              "description": "Adversaries may abuse task scheduling functionality to facilitate initial or recurring execution of malicious code. Utilities exist within all major operating systems to schedule programs or scripts to be executed at a specified date and time. A task can also be scheduled on a remote system, provided the proper authentication is met (ex: RPC and file and printer sharing in Windows environments). Scheduling a task on a remote system typically may require being a member of an admin or otherwise privileged group on the remote system.\nAdversaries may use task scheduling to execute programs at system startup or on a scheduled basis for persistence. These mechanisms can also be abused to run a process under the context of a specified account (such as one with elevated permissions/privileges). Similar to System Binary Proxy Execution, adversaries have also abused task scheduling to potentially mask one-time execution under a trusted system process."
            },
            {
              "id": "T1053.005",
              "name": "Scheduled Task",
              "link": "https://attack.mitre.org/techniques/T1053/005/",
              "description": "Adversaries may abuse the Windows Task Scheduler to perform task scheduling for initial or recurring execution of malicious code. There are multiple ways to access the Task Scheduler in Windows. The schtasks utility can be run directly on the command line, or the Task Scheduler can be opened through the GUI within the Administrator Tools section of the Control Panel. In some cases, adversaries have used a .NET wrapper for the Windows Task Scheduler, and alternatively, adversaries have used the Windows netapi32 library and Windows Management Instrumentation (WMI) to create a scheduled task. Adversaries may also utilize the Powershell Cmdlet Invoke-CimMethod, which leverages WMI class PS_ScheduledTask to create a scheduled task via an XML path.\nAn adversary may use Windows Task Scheduler to execute programs at system startup or on a scheduled basis for persistence. The Windows Task Scheduler can also be abused to conduct remote Execution as part of Lateral Movement and/or to run a process under the context of a specified account (such as SYSTEM). Similar to System Binary Proxy Execution, adversaries have also abused the Windows Task Scheduler to potentially mask one-time execution under signed/trusted system processes.\nAdversaries may also create \"hidden\" scheduled tasks (i.e. Hide Artifacts) that may not be visible to defender tools and manual queries used to enumerate tasks. Specifically, an adversary may hide a task from schtasks /query and the Task Scheduler by deleting the associated Security Descriptor (SD) registry value (where deletion of this value must be completed using SYSTEM permissions). Adversaries may also employ alternate methods to hide tasks, such as altering the metadata (e.g., Index value) within associated registry keys. ",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Schedules task",
                  "match_data": [
                    "Schedules task for command \"C:\\Users\\KEECFM~1\\AppData\\Local\\Temp\\explorer.exe\", to be triggered by TIME. Task has been rescheduled by the analyzer.",
                    "Schedules task for command \"C:\\Users\\kEecfMwgj\\AppData\\Roaming\\explorer.exe\", to be triggered by TIME. Task has been rescheduled by the analyzer.",
                    "Schedules task for command \"C:\\Users\\Public\\explorer.exe\", to be triggered by TIME. Task has been rescheduled by the analyzer.",
                    "Schedules task for command \"C:\\Users\\kEecfMwgj\\AppData\\Local\\explorer.exe\", to be triggered by TIME. Task has been rescheduled by the analyzer.",
                    "Schedules task for command \"C:\\ProgramData\\explorer.exe\", to be triggered by TIME. Task has been rescheduled by the analyzer.",
                    "Schedules task for command \"C:\\Users\\kEecfMwgj\\explorer.exe\", to be triggered by TIME. Task has been rescheduled by the analyzer."
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "Schedules task via schtasks",
                  "match_data": [
                    "Schedules task \"explorer\" via the schtasks command line utility."
                  ]
                }
              ]
            },
            {
              "id": "T1134",
              "name": "Access Token Manipulation",
              "link": "https://attack.mitre.org/techniques/T1134/",
              "description": "Adversaries may modify access tokens to operate under a different user or system security context to perform actions and bypass access controls. Windows uses access tokens to determine the ownership of a running process. A user can manipulate access tokens to make a running process appear as though it is the child of a different process or belongs to someone other than the user that started the process. When this occurs, the process also takes on the security context associated with the new token.\nAn adversary can use built-in Windows API functions to copy access tokens from existing processes; this is known as token stealing. These token can then be applied to an existing process (i.e. Token Impersonation/Theft) or used to spawn a new process (i.e. Create Process with Token). An adversary must already be in a privileged user context (i.e. administrator) to steal a token. However, adversaries commonly use token stealing to elevate their security context from the administrator level to the SYSTEM level. An adversary can then use a token to authenticate to a remote system as the account for that token if the account has appropriate permissions on the remote system.\nAny standard user can use the runas command, and the Windows API functions, to create impersonation tokens; it does not require access to an administrator account. There are also other mechanisms, such as Active Directory fields, that can be used to modify access tokens.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Enables process privileges",
                  "match_data": [
                    "(Process #4) hahawh.exe enables process privilege \"SeDebugPrivilege\".",
                    "(Process #3) as.exe enables process privilege \"SeDebugPrivilege\".",
                    "(Process #2) afsfasfasfas.exe enables process privilege \"SeDebugPrivilege\".",
                    "(Process #6) xclient.exe enables process privilege \"SeDebugPrivilege\".",
                    "(Process #7) wwwsss.exe enables process privilege \"SeDebugPrivilege\".",
                    "(Process #5) whwhwhwh.exe enables process privilege \"SeDebugPrivilege\".",
                    "(Process #46) explorer.exe enables process privilege \"SeDebugPrivilege\".",
                    "(Process #47) explorer.exe enables process privilege \"SeDebugPrivilege\".",
                    "(Process #55) explorer.exe enables process privilege \"SeDebugPrivilege\".",
                    "(Process #56) explorer.exe enables process privilege \"SeDebugPrivilege\"."
                  ]
                }
              ]
            },
            {
              "id": "T1547",
              "name": "Boot or Logon Autostart Execution",
              "link": "https://attack.mitre.org/techniques/T1547/",
              "description": "Adversaries may configure system settings to automatically execute a program during system boot or logon to maintain persistence or gain higher-level privileges on compromised systems. Operating systems may have mechanisms for automatically running a program on system boot or account logon. These mechanisms may include automatically executing programs that are placed in specially designated directories or are referenced by repositories that store configuration information, such as the Windows Registry. An adversary may achieve the same goal by modifying or extending features of the kernel.\nSince some boot or logon autostart programs run with higher privileges, an adversary may leverage these to elevate privileges."
            },
            {
              "id": "T1547.001",
              "name": "Registry Run Keys / Startup Folder",
              "link": "https://attack.mitre.org/techniques/T1547/001/",
              "description": "Adversaries may achieve persistence by adding a program to a startup folder or referencing it with a Registry run key. Adding an entry to the \"run keys\" in the Registry or startup folder will cause the program referenced to be executed when a user logs in. These programs will be executed under the context of the user and will have the account's associated permissions level.\nThe following run keys are created by default on Windows systems:\n\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnce\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnce\n\nRun keys may exist under multiple hives. The HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnceEx is also available but is not created by default on Windows Vista and newer. Registry run key entries can reference programs directly or list them as a dependency. For example, it is possible to load a DLL at logon using a \"Depend\" key with RunOnceEx: reg add HKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\RunOnceEx\\0001\\Depend /v 1 /d \"C:\\temp\\evil[.]dll\" \nPlacing a program within a startup folder will also cause that program to execute when a user logs in. There is a startup folder location for individual user accounts as well as a system-wide startup folder that will be checked regardless of which user account logs in. The startup folder path for the current user is C:\\Users\\[Username]\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup. The startup folder path for all users is C:\\ProgramData\\Microsoft\\Windows\\Start Menu\\Programs\\StartUp.\nThe following Registry keys can be used to set startup folder items for persistence:\n\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell Folders\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Shell Folders\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Shell Folders\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell Folders\n\nThe following Registry keys can control automatic startup of services during boot:\n\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServicesOnce\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServicesOnce\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServices\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServices\n\nUsing policy settings to specify startup programs creates corresponding values in either of two Registry keys:\n\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer\\Run\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer\\Run\n\nPrograms listed in the load value of the registry key HKEY_CURRENT_USER\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Windows run automatically for the currently logged-on user.\nBy default, the multistring BootExecute value of the registry key HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\Session Manager is set to autocheck autochk *. This value causes Windows, at startup, to check the file-system integrity of the hard disks if the system has been shut down abnormally. Adversaries can add other programs or processes to this registry value which will automatically launch at boot.\nAdversaries can use these configuration locations to execute malware, such as remote access tools, to maintain persistence through system reboots. Adversaries may also use Masquerading to make the Registry entries look as if they are associated with legitimate programs.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Installs system startup script or application",
                  "match_data": [
                    "(Process #3) as.exe adds \"C:\\Users\\KEECFM~1\\AppData\\Local\\Temp\\explorer.exe\" to Windows startup via registry.",
                    "(Process #6) xclient.exe adds \"C:\\Users\\kEecfMwgj\\AppData\\Roaming\\explorer.exe\" to Windows startup via registry.",
                    "(Process #4) hahawh.exe adds \"C:\\Users\\Public\\explorer.exe\" to Windows startup via registry.",
                    "(Process #2) afsfasfasfas.exe adds \"C:\\Users\\kEecfMwgj\\AppData\\Local\\explorer.exe\" to Windows startup via registry.",
                    "(Process #5) whwhwhwh.exe adds \"C:\\ProgramData\\explorer.exe\" to Windows startup via registry.",
                    "(Process #7) wwwsss.exe adds \"C:\\Users\\kEecfMwgj\\explorer.exe\" to Windows startup via registry.",
                    "(Process #47) explorer.exe adds \"C:\\Users\\KEECFM~1\\AppData\\Local\\Temp\\explorer.exe\" to Windows startup via registry.",
                    "(Process #46) explorer.exe adds \"C:\\Users\\kEecfMwgj\\explorer.exe\" to Windows startup via registry.",
                    "Adds \"C:\\Users\\kEecfMwgj\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup\\explorer.lnk\" to Windows startup folder."
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0006",
          "name": "Credential Access",
          "link": "https://attack.mitre.org/tactics/TA0006/",
          "description": "The adversary is trying to steal account names and passwords.\n\nCredential Access consists of techniques for stealing credentials like account names and passwords. Techniques used to get credentials include keylogging or credential dumping. Using legitimate credentials can give adversaries access to systems, make them harder to detect, and provide the opportunity to create more accounts to help achieve their goals.",
          "techniques": [
            {
              "id": "T1056",
              "name": "Input Capture",
              "link": "https://attack.mitre.org/techniques/T1056/",
              "description": "Adversaries may use methods of capturing user input to obtain credentials or collect information. During normal system usage, users often provide credentials to various different locations, such as login pages/portals or system dialog boxes. Input capture mechanisms may be transparent to the user (e.g. Credential API Hooking) or rely on deceiving the user into providing input into what they believe to be a genuine service (e.g. Web Portal Capture).",
              "signatures": [
                {
                  "severity": "HIGH",
                  "description": "Combination of other detections shows multiple input capture behaviors",
                  "match_data": [
                    "(Process #3) as.exe logs keys, takes screenshots and potentially exfiltrates data.",
                    "(Process #6) xclient.exe logs keys and potentially exfiltrates data.",
                    "(Process #5) whwhwhwh.exe logs keys and potentially exfiltrates data.",
                    "(Process #4) hahawh.exe logs keys and potentially exfiltrates data.",
                    "(Process #7) wwwsss.exe logs keys and potentially exfiltrates data.",
                    "(Process #2) afsfasfasfas.exe logs keys and potentially exfiltrates data.",
                    "(Process #47) explorer.exe logs keys and potentially exfiltrates data.",
                    "(Process #46) explorer.exe logs keys, takes screenshots and potentially exfiltrates data."
                  ]
                }
              ]
            },
            {
              "id": "T1056.001",
              "name": "Keylogging",
              "link": "https://attack.mitre.org/techniques/T1056/001/",
              "description": "Adversaries may log user keystrokes to intercept credentials as the user types them. Keylogging is likely to be used to acquire credentials for new access opportunities when OS Credential Dumping efforts are not effective, and may require an adversary to intercept keystrokes on a system for a substantial period of time before credentials can be successfully captured. In order to increase the likelihood of capturing credentials quickly, an adversary may also perform actions such as clearing browser cookies to force users to reauthenticate to systems.\nKeylogging is the most prevalent type of input capture, with many different ways of intercepting keystrokes. Some methods include:\n\nHooking API callbacks used for processing keystrokes. Unlike Credential API Hooking, this focuses solely on API functions intended for processing keystroke data.\nReading raw keystroke data from the hardware buffer.\nWindows Registry modifications.\nCustom drivers.\nModify System Image may provide adversaries with hooks into the operating system of network devices to read raw keystrokes for login sessions. \n",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Monitors keyboard input",
                  "match_data": [
                    "(Process #3) as.exe installs system wide \"WH_KEYBOARD_LL\" hook(s) to monitor keystrokes.",
                    "(Process #6) xclient.exe installs system wide \"WH_KEYBOARD_LL\" hook(s) to monitor keystrokes.",
                    "(Process #5) whwhwhwh.exe installs system wide \"WH_KEYBOARD_LL\" hook(s) to monitor keystrokes.",
                    "(Process #4) hahawh.exe installs system wide \"WH_KEYBOARD_LL\" hook(s) to monitor keystrokes.",
                    "(Process #7) wwwsss.exe installs system wide \"WH_KEYBOARD_LL\" hook(s) to monitor keystrokes.",
                    "(Process #2) afsfasfasfas.exe installs system wide \"WH_KEYBOARD_LL\" hook(s) to monitor keystrokes.",
                    "(Process #47) explorer.exe installs system wide \"WH_KEYBOARD_LL\" hook(s) to monitor keystrokes.",
                    "(Process #46) explorer.exe installs system wide \"WH_KEYBOARD_LL\" hook(s) to monitor keystrokes."
                  ]
                }
              ]
            },
            {
              "id": "T1056.004",
              "name": "Credential API Hooking",
              "link": "https://attack.mitre.org/techniques/T1056/004/",
              "description": "Adversaries may hook into Windows application programming interface (API) functions and Linux system functions to collect user credentials. Malicious hooking mechanisms may capture API or function calls that include parameters that reveal user authentication credentials. Unlike Keylogging, this technique focuses specifically on API functions that include parameters that reveal user credentials. \nIn Windows, hooking involves redirecting calls to these functions and can be implemented via:\n\nHooks procedures, which intercept and execute designated code in response to events such as messages, keystrokes, and mouse inputs.\nImport address table (IAT) hooking, which use modifications to a process’s IAT, where pointers to imported API functions are stored.\nInline hooking, which overwrites the first bytes in an API function to redirect code flow.\n\nIn Linux and macOS, adversaries may hook into system functions via the LD_PRELOAD (Linux) or DYLD_INSERT_LIBRARIES (macOS) environment variables, which enables loading shared libraries into a program’s address space. For example, an adversary may capture credentials by hooking into the libc read function leveraged by SSH or SCP.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Monitors keyboard input",
                  "match_data": [
                    "(Process #3) as.exe installs system wide \"WH_KEYBOARD_LL\" hook(s) to monitor keystrokes.",
                    "(Process #6) xclient.exe installs system wide \"WH_KEYBOARD_LL\" hook(s) to monitor keystrokes.",
                    "(Process #5) whwhwhwh.exe installs system wide \"WH_KEYBOARD_LL\" hook(s) to monitor keystrokes.",
                    "(Process #4) hahawh.exe installs system wide \"WH_KEYBOARD_LL\" hook(s) to monitor keystrokes.",
                    "(Process #7) wwwsss.exe installs system wide \"WH_KEYBOARD_LL\" hook(s) to monitor keystrokes.",
                    "(Process #2) afsfasfasfas.exe installs system wide \"WH_KEYBOARD_LL\" hook(s) to monitor keystrokes.",
                    "(Process #47) explorer.exe installs system wide \"WH_KEYBOARD_LL\" hook(s) to monitor keystrokes.",
                    "(Process #46) explorer.exe installs system wide \"WH_KEYBOARD_LL\" hook(s) to monitor keystrokes."
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0009",
          "name": "Collection",
          "link": "https://attack.mitre.org/tactics/TA0009/",
          "description": "The adversary is trying to gather data of interest to their goal.\n\nCollection consists of techniques adversaries may use to gather information and the sources information is collected from that are relevant to following through on the adversary's objectives. Frequently, the next goal after collecting data is to either steal (exfiltrate) the data or to use the data to gain more information about the target environment. Common target sources include various drive types, browsers, audio, video, and email. Common collection methods include capturing screenshots and keyboard input.",
          "techniques": [
            {
              "id": "T1056",
              "name": "Input Capture",
              "link": "https://attack.mitre.org/techniques/T1056/",
              "description": "Adversaries may use methods of capturing user input to obtain credentials or collect information. During normal system usage, users often provide credentials to various different locations, such as login pages/portals or system dialog boxes. Input capture mechanisms may be transparent to the user (e.g. Credential API Hooking) or rely on deceiving the user into providing input into what they believe to be a genuine service (e.g. Web Portal Capture).",
              "signatures": [
                {
                  "severity": "HIGH",
                  "description": "Combination of other detections shows multiple input capture behaviors",
                  "match_data": [
                    "(Process #3) as.exe logs keys, takes screenshots and potentially exfiltrates data.",
                    "(Process #6) xclient.exe logs keys and potentially exfiltrates data.",
                    "(Process #5) whwhwhwh.exe logs keys and potentially exfiltrates data.",
                    "(Process #4) hahawh.exe logs keys and potentially exfiltrates data.",
                    "(Process #7) wwwsss.exe logs keys and potentially exfiltrates data.",
                    "(Process #2) afsfasfasfas.exe logs keys and potentially exfiltrates data.",
                    "(Process #47) explorer.exe logs keys and potentially exfiltrates data.",
                    "(Process #46) explorer.exe logs keys, takes screenshots and potentially exfiltrates data."
                  ]
                }
              ]
            },
            {
              "id": "T1056.001",
              "name": "Keylogging",
              "link": "https://attack.mitre.org/techniques/T1056/001/",
              "description": "Adversaries may log user keystrokes to intercept credentials as the user types them. Keylogging is likely to be used to acquire credentials for new access opportunities when OS Credential Dumping efforts are not effective, and may require an adversary to intercept keystrokes on a system for a substantial period of time before credentials can be successfully captured. In order to increase the likelihood of capturing credentials quickly, an adversary may also perform actions such as clearing browser cookies to force users to reauthenticate to systems.\nKeylogging is the most prevalent type of input capture, with many different ways of intercepting keystrokes. Some methods include:\n\nHooking API callbacks used for processing keystrokes. Unlike Credential API Hooking, this focuses solely on API functions intended for processing keystroke data.\nReading raw keystroke data from the hardware buffer.\nWindows Registry modifications.\nCustom drivers.\nModify System Image may provide adversaries with hooks into the operating system of network devices to read raw keystrokes for login sessions. \n",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Monitors keyboard input",
                  "match_data": [
                    "(Process #3) as.exe installs system wide \"WH_KEYBOARD_LL\" hook(s) to monitor keystrokes.",
                    "(Process #6) xclient.exe installs system wide \"WH_KEYBOARD_LL\" hook(s) to monitor keystrokes.",
                    "(Process #5) whwhwhwh.exe installs system wide \"WH_KEYBOARD_LL\" hook(s) to monitor keystrokes.",
                    "(Process #4) hahawh.exe installs system wide \"WH_KEYBOARD_LL\" hook(s) to monitor keystrokes.",
                    "(Process #7) wwwsss.exe installs system wide \"WH_KEYBOARD_LL\" hook(s) to monitor keystrokes.",
                    "(Process #2) afsfasfasfas.exe installs system wide \"WH_KEYBOARD_LL\" hook(s) to monitor keystrokes.",
                    "(Process #47) explorer.exe installs system wide \"WH_KEYBOARD_LL\" hook(s) to monitor keystrokes.",
                    "(Process #46) explorer.exe installs system wide \"WH_KEYBOARD_LL\" hook(s) to monitor keystrokes."
                  ]
                }
              ]
            },
            {
              "id": "T1056.004",
              "name": "Credential API Hooking",
              "link": "https://attack.mitre.org/techniques/T1056/004/",
              "description": "Adversaries may hook into Windows application programming interface (API) functions and Linux system functions to collect user credentials. Malicious hooking mechanisms may capture API or function calls that include parameters that reveal user authentication credentials. Unlike Keylogging, this technique focuses specifically on API functions that include parameters that reveal user credentials. \nIn Windows, hooking involves redirecting calls to these functions and can be implemented via:\n\nHooks procedures, which intercept and execute designated code in response to events such as messages, keystrokes, and mouse inputs.\nImport address table (IAT) hooking, which use modifications to a process’s IAT, where pointers to imported API functions are stored.\nInline hooking, which overwrites the first bytes in an API function to redirect code flow.\n\nIn Linux and macOS, adversaries may hook into system functions via the LD_PRELOAD (Linux) or DYLD_INSERT_LIBRARIES (macOS) environment variables, which enables loading shared libraries into a program’s address space. For example, an adversary may capture credentials by hooking into the libc read function leveraged by SSH or SCP.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Monitors keyboard input",
                  "match_data": [
                    "(Process #3) as.exe installs system wide \"WH_KEYBOARD_LL\" hook(s) to monitor keystrokes.",
                    "(Process #6) xclient.exe installs system wide \"WH_KEYBOARD_LL\" hook(s) to monitor keystrokes.",
                    "(Process #5) whwhwhwh.exe installs system wide \"WH_KEYBOARD_LL\" hook(s) to monitor keystrokes.",
                    "(Process #4) hahawh.exe installs system wide \"WH_KEYBOARD_LL\" hook(s) to monitor keystrokes.",
                    "(Process #7) wwwsss.exe installs system wide \"WH_KEYBOARD_LL\" hook(s) to monitor keystrokes.",
                    "(Process #2) afsfasfasfas.exe installs system wide \"WH_KEYBOARD_LL\" hook(s) to monitor keystrokes.",
                    "(Process #47) explorer.exe installs system wide \"WH_KEYBOARD_LL\" hook(s) to monitor keystrokes.",
                    "(Process #46) explorer.exe installs system wide \"WH_KEYBOARD_LL\" hook(s) to monitor keystrokes."
                  ]
                }
              ]
            },
            {
              "id": "T1113",
              "name": "Screen Capture",
              "link": "https://attack.mitre.org/techniques/T1113/",
              "description": "Adversaries may attempt to take screen captures of the desktop to gather information over the course of an operation. Screen capturing functionality may be included as a feature of a remote access tool used in post-compromise operations. Taking a screenshot is also typically possible through native utilities or API calls, such as CopyFromScreen, xwd, or screencapture.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Takes screenshot",
                  "match_data": [
                    "(Process #3) as.exe takes a screenshot using BitBlt API.",
                    "(Process #46) explorer.exe takes a screenshot using BitBlt API."
                  ]
                }
              ]
            },
            {
              "id": "T1119",
              "name": "Automated Collection",
              "link": "https://attack.mitre.org/techniques/T1119/",
              "description": "Once established within a system or network, an adversary may use automated techniques for collecting internal data. Methods for performing this technique could include use of a Command and Scripting Interpreter to search for and copy information fitting set criteria such as file type, location, or name at specific time intervals. \nIn cloud-based environments, adversaries may also use cloud APIs, data pipelines, command line interfaces, or extract, transform, and load (ETL) services to automatically collect data. \nThis functionality could also be built into remote access tools. \nThis technique may incorporate use of other techniques such as File and Directory Discovery and Lateral Tool Transfer to identify and move files, as well as Cloud Service Dashboard and Cloud Storage Object Discovery to identify resources in cloud environments.",
              "signatures": [
                {
                  "severity": "HIGH",
                  "description": "Combination of other detections shows multiple input capture behaviors",
                  "match_data": [
                    "(Process #3) as.exe logs keys, takes screenshots and potentially exfiltrates data.",
                    "(Process #6) xclient.exe logs keys and potentially exfiltrates data.",
                    "(Process #5) whwhwhwh.exe logs keys and potentially exfiltrates data.",
                    "(Process #4) hahawh.exe logs keys and potentially exfiltrates data.",
                    "(Process #7) wwwsss.exe logs keys and potentially exfiltrates data.",
                    "(Process #2) afsfasfasfas.exe logs keys and potentially exfiltrates data.",
                    "(Process #47) explorer.exe logs keys and potentially exfiltrates data.",
                    "(Process #46) explorer.exe logs keys, takes screenshots and potentially exfiltrates data."
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0007",
          "name": "Discovery",
          "link": "https://attack.mitre.org/tactics/TA0007/",
          "description": "The adversary is trying to figure out your environment.\n\nDiscovery consists of techniques an adversary may use to gain knowledge about the system and internal network. These techniques help adversaries observe the environment and orient themselves before deciding how to act. They also allow adversaries to explore what they can control and what’s around their entry point in order to discover how it could benefit their current objective. Native operating system tools are often used toward this post-compromise information-gathering objective. ",
          "techniques": [
            {
              "id": "T1057",
              "name": "Process Discovery",
              "link": "https://attack.mitre.org/techniques/T1057/",
              "description": "Adversaries may attempt to get information about running processes on a system. Information obtained could be used to gain an understanding of common software/applications running on systems within the network. Administrator or otherwise elevated access may provide better process details. Adversaries may use the information from Process Discovery during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\nIn Windows environments, adversaries could obtain details on running processes using the Tasklist utility via cmd or Get-Process via PowerShell. Information about processes can also be extracted from the output of Native API calls such as CreateToolhelp32Snapshot. In Mac and Linux, this is accomplished with the ps command. Adversaries may also opt to enumerate processes via /proc. ESXi also supports use of the ps command, as well as esxcli system process list.\nOn network devices, Network Device CLI commands such as show processes can be used to display current running processes.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Enumerates running processes",
                  "match_data": [
                    "(Process #2) afsfasfasfas.exe enumerates running processes.",
                    "(Process #7) wwwsss.exe enumerates running processes.",
                    "(Process #4) hahawh.exe enumerates running processes.",
                    "(Process #5) whwhwhwh.exe enumerates running processes.",
                    "(Process #6) xclient.exe enumerates running processes.",
                    "(Process #3) as.exe enumerates running processes."
                  ]
                }
              ]
            },
            {
              "id": "T1082",
              "name": "System Information Discovery",
              "link": "https://attack.mitre.org/techniques/T1082/",
              "description": "An adversary may attempt to get detailed information about the operating system and hardware, including version, patches, hotfixes, service packs, and architecture. Adversaries may use this information to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions. This behavior is distinct from Local Storage Discovery which is an adversary's discovery of local drive, disks and/or volumes.\nTools such as Systeminfo can be used to gather detailed system information. If running with privileged access, a breakdown of system data can be gathered through the systemsetup configuration tool on macOS. Adversaries may leverage a Network Device CLI on network devices to gather detailed system information (e.g. show version). On ESXi servers, threat actors may gather system information from various esxcli utilities, such as system hostname get and system version get.\nInfrastructure as a Service (IaaS) cloud providers such as AWS, GCP, and Azure allow access to instance and virtual machine information via APIs. Successful authenticated API calls can return data such as the operating system platform and status of a particular instance or the model view of a virtual machine.\nSystem Information Discovery combined with information gathered from other forms of discovery and reconnaissance can drive payload development and concealment. ",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Queries OS version via WMI",
                  "match_data": [
                    "(Process #6) xclient.exe queries OS version via WMI query: select * from Win32_OperatingSystem.",
                    "(Process #5) whwhwhwh.exe queries OS version via WMI query: select * from Win32_OperatingSystem.",
                    "(Process #3) as.exe queries OS version via WMI query: select * from Win32_OperatingSystem.",
                    "(Process #7) wwwsss.exe queries OS version via WMI query: select * from Win32_OperatingSystem.",
                    "(Process #4) hahawh.exe queries OS version via WMI query: select * from Win32_OperatingSystem.",
                    "(Process #2) afsfasfasfas.exe queries OS version via WMI query: select * from Win32_OperatingSystem.",
                    "(Process #47) explorer.exe queries OS version via WMI query: select * from Win32_OperatingSystem.",
                    "(Process #46) explorer.exe queries OS version via WMI query: select * from Win32_OperatingSystem."
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "Collects hardware properties",
                  "match_data": [
                    "(Process #6) xclient.exe queries hardware properties via WMI: SELECT * FROM Win32_VideoController.",
                    "(Process #5) whwhwhwh.exe queries hardware properties via WMI: SELECT * FROM Win32_VideoController.",
                    "(Process #3) as.exe queries hardware properties via WMI: SELECT * FROM Win32_VideoController.",
                    "(Process #7) wwwsss.exe queries hardware properties via WMI: SELECT * FROM Win32_VideoController.",
                    "(Process #4) hahawh.exe queries hardware properties via WMI: SELECT * FROM Win32_VideoController.",
                    "(Process #2) afsfasfasfas.exe queries hardware properties via WMI: SELECT * FROM Win32_VideoController.",
                    "(Process #47) explorer.exe queries hardware properties via WMI: SELECT * FROM Win32_VideoController.",
                    "(Process #46) explorer.exe queries hardware properties via WMI: SELECT * FROM Win32_VideoController."
                  ]
                }
              ]
            },
            {
              "id": "T1518",
              "name": "Software Discovery",
              "link": "https://attack.mitre.org/techniques/T1518/",
              "description": "Adversaries may attempt to get a listing of software and software versions that are installed on a system or in a cloud environment. Adversaries may use the information from Software Discovery during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\nSuch software may be deployed widely across the environment for configuration management or security reasons, such as Software Deployment Tools, and may allow adversaries broad access to infect devices or move laterally.\nAdversaries may attempt to enumerate software for a variety of reasons, such as figuring out what security measures are present or if the compromised system has a version of software that is vulnerable to Exploitation for Privilege Escalation."
            },
            {
              "id": "T1518.001",
              "name": "Security Software Discovery",
              "link": "https://attack.mitre.org/techniques/T1518/001/",
              "description": "Adversaries may attempt to get a listing of security software, configurations, defensive tools, and sensors that are installed on a system or in a cloud environment. This may include things such as cloud monitoring agents and anti-virus. Adversaries may use the information from Security Software Discovery during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\nExample commands that can be used to obtain security software information are netsh, reg query with Reg, dir with cmd, and Tasklist, but other indicators of discovery behavior may be more specific to the type of software or security system the adversary is looking for. It is becoming more common to see macOS malware perform checks for LittleSnitch and KnockKnock software.\nAdversaries may also utilize the Cloud API to discover cloud-native security software installed on compute infrastructure, such as the AWS CloudWatch agent, Azure VM Agent, and Google Cloud Monitor agent. These agents  may collect  metrics and logs from the VM, which may be centrally aggregated in a cloud-based monitoring platform.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Tries to detect the presence of antivirus software",
                  "match_data": [
                    "(Process #6) xclient.exe tries to detect antivirus software via WMI query: \"Select * from AntivirusProduct\".",
                    "(Process #5) whwhwhwh.exe tries to detect antivirus software via WMI query: \"Select * from AntivirusProduct\".",
                    "(Process #3) as.exe tries to detect antivirus software via WMI query: \"Select * from AntivirusProduct\".",
                    "(Process #7) wwwsss.exe tries to detect antivirus software via WMI query: \"Select * from AntivirusProduct\".",
                    "(Process #4) hahawh.exe tries to detect antivirus software via WMI query: \"Select * from AntivirusProduct\".",
                    "(Process #2) afsfasfasfas.exe tries to detect antivirus software via WMI query: \"Select * from AntivirusProduct\".",
                    "(Process #47) explorer.exe tries to detect antivirus software via WMI query: \"Select * from AntivirusProduct\".",
                    "(Process #46) explorer.exe tries to detect antivirus software via WMI query: \"Select * from AntivirusProduct\"."
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0011",
          "name": "Command and Control",
          "link": "https://attack.mitre.org/tactics/TA0011/",
          "description": "The adversary is trying to communicate with compromised systems to control them.\n\nCommand and Control consists of techniques that adversaries may use to communicate with systems under their control within a victim network. Adversaries commonly attempt to mimic normal, expected traffic to avoid detection. There are many ways an adversary can establish command and control with various levels of stealth depending on the victim’s network structure and defenses.",
          "techniques": [
            {
              "id": "T1095",
              "name": "Non-Application Layer Protocol",
              "link": "https://attack.mitre.org/techniques/T1095/",
              "description": "Adversaries may use an OSI non-application layer protocol for communication between host and C2 server or among infected hosts within a network. The list of possible protocols is extensive. Specific examples include use of network layer protocols, such as the Internet Control Message Protocol (ICMP), transport layer protocols, such as the User Datagram Protocol (UDP), session layer protocols, such as Socket Secure (SOCKS), as well as redirected/tunneled protocols, such as Serial over LAN (SOL).\nICMP communication between hosts is one example. Because ICMP is part of the Internet Protocol Suite, it is required to be implemented by all IP-compatible hosts. However, it is not as commonly monitored as other Internet Protocols such as TCP or UDP and may be used by adversaries to hide communications.\nIn ESXi environments, adversaries may leverage the Virtual Machine Communication Interface (VMCI) for communication between guest virtual machines and the ESXi host. This traffic is similar to client-server communications on traditional network sockets but is localized to the physical machine running the ESXi host, meaning it does not traverse external networks (routers, switches). This results in communications that are invisible to external monitoring and standard networking tools like tcpdump, netstat, nmap, and Wireshark. By adding a VMCI backdoor to a compromised ESXi host, adversaries may persistently regain access from any guest VM to the compromised ESXi host’s backdoor, regardless of network segmentation or firewall rules in place.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Connects to remote host",
                  "match_data": [
                    "(Process #6) xclient.exe opens an outgoing TCP connection to host \"147.185.221.29:32655\".",
                    "(Process #2) afsfasfasfas.exe opens an outgoing TCP connection to host \"147.185.221.29:32655\".",
                    "(Process #47) explorer.exe opens an outgoing TCP connection to host \"147.185.221.29:32655\".",
                    "(Process #3) as.exe opens an outgoing TCP connection to host \"147.185.221.29:32655\".",
                    "(Process #4) hahawh.exe opens an outgoing TCP connection to host \"147.185.221.29:32655\".",
                    "(Process #7) wwwsss.exe opens an outgoing TCP connection to host \"147.185.221.29:32655\".",
                    "(Process #46) explorer.exe opens an outgoing TCP connection to host \"147.185.221.29:32655\".",
                    "(Process #5) whwhwhwh.exe opens an outgoing TCP connection to host \"147.185.221.29:32655\"."
                  ]
                }
              ]
            },
            {
              "id": "T1571",
              "name": "Non-Standard Port",
              "link": "https://attack.mitre.org/techniques/T1571/",
              "description": "Adversaries may communicate using a protocol and port pairing that are typically not associated. For example, HTTPS over port 8088 or port 587 as opposed to the traditional port 443. Adversaries may make changes to the standard port used by a protocol to bypass filtering or muddle analysis/parsing of network data.\nAdversaries may also make changes to victim systems to abuse non-standard ports. For example, Registry keys and other configuration settings can be used to modify protocol and port pairings.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Tries to connect using an uncommon port",
                  "match_data": [
                    "(Process #7) wwwsss.exe tries to connect to TCP port 32655 at 147.185.221.29."
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    "Yomi Hunter": {
      "tactics": [
        {
          "id": "TA0002",
          "name": "Execution",
          "link": "https://attack.mitre.org/tactics/TA0002/",
          "description": "The adversary is trying to run malicious code.\n\nExecution consists of techniques that result in adversary-controlled code running on a local or remote system. Techniques that run malicious code are often paired with techniques from all other tactics to achieve broader goals, like exploring a network or stealing data. For example, an adversary might use a remote access tool to run a PowerShell script that does Remote System Discovery. ",
          "techniques": [
            {
              "id": "T1129",
              "name": "Shared Modules",
              "link": "https://attack.mitre.org/techniques/T1129/",
              "description": "Adversaries may execute malicious payloads via loading shared modules. Shared modules are executable files that are loaded into processes to provide access to reusable code, such as specific custom functions or invoking OS API functions (i.e., Native API).\nAdversaries may use this functionality as a way to execute arbitrary payloads on a victim system. For example, adversaries can modularize functionality of their malware into shared objects that perform various functions such as managing C2 network communications or execution of specific actions on objective.\nThe Linux & macOS module loader can load and execute shared objects from arbitrary local paths. This functionality resides in dlfcn.h in functions such as dlopen and dlsym. Although macOS can execute .so files, common practice uses .dylib files.\nThe Windows module loader can be instructed to load DLLs from arbitrary local paths and arbitrary Universal Naming Convention (UNC) network paths. This functionality resides in NTDLL.dll and is part of the Windows Native API which is called from functions like LoadLibrary at run time.",
              "signatures": [
                {
                  "severity": "UNKNOWN",
                  "description": "The process attempted to dynamically load a malicious function"
                },
                {
                  "severity": "UNKNOWN",
                  "description": "The process tried to load dynamically one or more functions."
                },
                {
                  "severity": "UNKNOWN",
                  "description": "Detected the execution of a powershell command with one or more suspicious parameter"
                }
              ]
            },
            {
              "id": "T1086",
              "name": "PowerShell",
              "link": "https://attack.mitre.org/techniques/T1086/",
              "description": "PowerShell is a powerful interactive command-line interface and scripting environment included in the Windows operating system.  Adversaries can use PowerShell to perform a number of actions, including discovery of information and execution of code. Examples include the Start-Process cmdlet which can be used to run an executable and the Invoke-Command cmdlet which runs a command locally or on a remote computer. \nPowerShell may also be used to download and run executables from the Internet, which can be executed from disk or in memory without touching disk.\nAdministrator permissions are required to use PowerShell to connect to remote systems.\nA number of PowerShell-based offensive testing tools are available, including Empire,  PowerSploit,  and PSAttack. \nPowerShell commands/scripts can also be executed without directly invoking the powershell.exe binary through interfaces to PowerShell's underlying System.Management.Automation assembly exposed through the .NET framework and Windows Common Language Interface (CLI).  ",
              "signatures": [
                {
                  "severity": "UNKNOWN",
                  "description": "Detected the execution of a powershell command with one or more suspicious parameter"
                },
                {
                  "severity": "UNKNOWN",
                  "description": "Detected some PowerShell commands executions"
                }
              ]
            },
            {
              "id": "T1053",
              "name": "Scheduled Task/Job",
              "link": "https://attack.mitre.org/techniques/T1053/",
              "description": "Adversaries may abuse task scheduling functionality to facilitate initial or recurring execution of malicious code. Utilities exist within all major operating systems to schedule programs or scripts to be executed at a specified date and time. A task can also be scheduled on a remote system, provided the proper authentication is met (ex: RPC and file and printer sharing in Windows environments). Scheduling a task on a remote system typically may require being a member of an admin or otherwise privileged group on the remote system.\nAdversaries may use task scheduling to execute programs at system startup or on a scheduled basis for persistence. These mechanisms can also be abused to run a process under the context of a specified account (such as one with elevated permissions/privileges). Similar to System Binary Proxy Execution, adversaries have also abused task scheduling to potentially mask one-time execution under a trusted system process.",
              "signatures": [
                {
                  "severity": "UNKNOWN",
                  "description": "It creates a system task"
                }
              ]
            }
          ]
        },
        {
          "id": "TA0007",
          "name": "Discovery",
          "link": "https://attack.mitre.org/tactics/TA0007/",
          "description": "The adversary is trying to figure out your environment.\n\nDiscovery consists of techniques an adversary may use to gain knowledge about the system and internal network. These techniques help adversaries observe the environment and orient themselves before deciding how to act. They also allow adversaries to explore what they can control and what’s around their entry point in order to discover how it could benefit their current objective. Native operating system tools are often used toward this post-compromise information-gathering objective. ",
          "techniques": [
            {
              "id": "T1057",
              "name": "Process Discovery",
              "link": "https://attack.mitre.org/techniques/T1057/",
              "description": "Adversaries may attempt to get information about running processes on a system. Information obtained could be used to gain an understanding of common software/applications running on systems within the network. Administrator or otherwise elevated access may provide better process details. Adversaries may use the information from Process Discovery during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\nIn Windows environments, adversaries could obtain details on running processes using the Tasklist utility via cmd or Get-Process via PowerShell. Information about processes can also be extracted from the output of Native API calls such as CreateToolhelp32Snapshot. In Mac and Linux, this is accomplished with the ps command. Adversaries may also opt to enumerate processes via /proc. ESXi also supports use of the ps command, as well as esxcli system process list.\nOn network devices, Network Device CLI commands such as show processes can be used to display current running processes.",
              "signatures": [
                {
                  "severity": "UNKNOWN",
                  "description": "The process has tried to detect the debugger probing the use of page guards."
                },
                {
                  "severity": "UNKNOWN",
                  "description": "The process attempted to detect a running debugger using common APIs"
                }
              ]
            },
            {
              "id": "T1082",
              "name": "System Information Discovery",
              "link": "https://attack.mitre.org/techniques/T1082/",
              "description": "An adversary may attempt to get detailed information about the operating system and hardware, including version, patches, hotfixes, service packs, and architecture. Adversaries may use this information to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions. This behavior is distinct from Local Storage Discovery which is an adversary's discovery of local drive, disks and/or volumes.\nTools such as Systeminfo can be used to gather detailed system information. If running with privileged access, a breakdown of system data can be gathered through the systemsetup configuration tool on macOS. Adversaries may leverage a Network Device CLI on network devices to gather detailed system information (e.g. show version). On ESXi servers, threat actors may gather system information from various esxcli utilities, such as system hostname get and system version get.\nInfrastructure as a Service (IaaS) cloud providers such as AWS, GCP, and Azure allow access to instance and virtual machine information via APIs. Successful authenticated API calls can return data such as the operating system platform and status of a particular instance or the model view of a virtual machine.\nSystem Information Discovery combined with information gathered from other forms of discovery and reconnaissance can drive payload development and concealment. ",
              "signatures": [
                {
                  "severity": "UNKNOWN",
                  "description": "Queries for the computername"
                },
                {
                  "severity": "UNKNOWN",
                  "description": "The process tried to collect informations about the system reading some known registry keys"
                }
              ]
            },
            {
              "id": "T1012",
              "name": "Query Registry",
              "link": "https://attack.mitre.org/techniques/T1012/",
              "description": "Adversaries may interact with the Windows Registry to gather information about the system, configuration, and installed software.\nThe Registry contains a significant amount of information about the operating system, configuration, software, and security. Information can easily be queried using the Reg utility, though other means to access the Registry exist. Some of the information may help adversaries to further their operation within a network. Adversaries may use the information from Query Registry during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.",
              "signatures": [
                {
                  "severity": "UNKNOWN",
                  "description": "The process tried to collect informations about the system reading some known registry keys"
                }
              ]
            }
          ]
        },
        {
          "id": "TA0005",
          "name": "Defense Evasion",
          "link": "https://attack.mitre.org/tactics/TA0005/",
          "description": "The adversary is trying to avoid being detected.\n\nDefense Evasion consists of techniques that adversaries use to avoid detection throughout their compromise. Techniques used for defense evasion include uninstalling/disabling security software or obfuscating/encrypting data and scripts. Adversaries also leverage and abuse trusted processes to hide and masquerade their malware. Other tactics’ techniques are cross-listed here when those techniques include the added benefit of subverting defenses. ",
          "techniques": [
            {
              "id": "T1140",
              "name": "Deobfuscate/Decode Files or Information",
              "link": "https://attack.mitre.org/techniques/T1140/",
              "description": "Adversaries may use Obfuscated Files or Information to hide artifacts of an intrusion from analysis. They may require separate mechanisms to decode or deobfuscate that information depending on how they intend to use it. Methods for doing that include built-in functionality of malware or by using utilities present on the system.\nOne such example is the use of certutil to decode a remote access tool portable executable file that has been hidden inside a certificate file. Another example is using the Windows copy /b or type command to reassemble binary fragments into a malicious payload.\nSometimes a user's action may be required to open it for deobfuscation or decryption as part of User Execution. The user may also be required to input a password to open a password protected compressed/encrypted file that was provided by the adversary.",
              "signatures": [
                {
                  "severity": "UNKNOWN",
                  "description": "Detected an attempt to pull out some data from the binary image"
                }
              ]
            },
            {
              "id": "T1564",
              "name": "Hide Artifacts",
              "link": "https://attack.mitre.org/techniques/T1564/",
              "description": "Adversaries may attempt to hide artifacts associated with their behaviors to evade detection. Operating systems may have features to hide various artifacts, such as important system files and administrative task execution, to avoid disrupting user work environments and prevent users from changing files or features on the system. Adversaries may abuse these features to hide artifacts such as files, directories, user accounts, or other system activity to evade detection.\nAdversaries may also attempt to hide artifacts associated with malicious behavior by creating computing regions that are isolated from common security instrumentation, such as through the use of virtualization technology."
            },
            {
              "id": "T1564.003",
              "name": "Hidden Window",
              "link": "https://attack.mitre.org/techniques/T1564/003/",
              "description": "Adversaries may use hidden windows to conceal malicious activity from the plain sight of users. In some cases, windows that would typically be displayed when an application carries out an operation can be hidden. This may be utilized by system administrators to avoid disrupting user work environments when carrying out administrative tasks. \nAdversaries may abuse these functionalities to hide otherwise visible windows from users so as not to alert the user to adversary activity on the system.\nOn macOS, the configurations for how applications run are listed in property list (plist) files. One of the tags in these files can be apple.awt.UIElement, which allows for Java applications to prevent the application's icon from appearing in the Dock. A common use for this is when applications run in the system tray, but don't also want to show up in the Dock.\nSimilarly, on Windows there are a variety of features in scripting languages, such as PowerShell, Jscript, and Visual Basic to make windows hidden. One example of this is powershell.exe -WindowStyle Hidden.\nThe Windows Registry can also be edited to hide application windows from the current user. For example, by setting the WindowPosition subkey in the HKEY_CURRENT_USER\\Console\\%SystemRoot%_System32_WindowsPowerShell_v1.0_PowerShell.exe Registry key to a maximum value, PowerShell windows will open off screen and be hidden.\nIn addition, Windows supports the CreateDesktop() API that can create a hidden desktop window with its own corresponding explorer.exe process.  All applications running on the hidden desktop window, such as a hidden VNC (hVNC) session, will be invisible to other desktops windows.\nAdversaries may also leverage cmd.exe as a parent process, and then utilize a LOLBin, such as DeviceCredentialDeployment.exe, to hide windows.",
              "signatures": [
                {
                  "severity": "UNKNOWN",
                  "description": "Detected the creation of a hidden window (common execution hiding technique)"
                }
              ]
            },
            {
              "id": "T1027",
              "name": "Obfuscated Files or Information",
              "link": "https://attack.mitre.org/techniques/T1027/",
              "description": "Adversaries may attempt to make an executable or file difficult to discover or analyze by encrypting, encoding, or otherwise obfuscating its contents on the system or in transit. This is common behavior that can be used across different platforms and the network to evade defenses. \nPayloads may be compressed, archived, or encrypted in order to avoid detection. These payloads may be used during Initial Access or later to mitigate detection. Sometimes a user's action may be required to open and Deobfuscate/Decode Files or Information for User Execution. The user may also be required to input a password to open a password protected compressed/encrypted file that was provided by the adversary.  Adversaries may also use compressed or archived scripts, such as JavaScript. \nPortions of files can also be encoded to hide the plain-text strings that would otherwise help defenders with discovery.  Payloads may also be split into separate, seemingly benign files that only reveal malicious functionality when reassembled. \nAdversaries may also abuse Command Obfuscation to obscure commands executed from payloads or directly via Command and Scripting Interpreter. Environment variables, aliases, characters, and other platform/language specific semantics can be used to evade signature based detections and application control mechanisms.   ",
              "signatures": [
                {
                  "severity": "UNKNOWN",
                  "description": "Detected the execution of a powershell command with one or more suspicious parameter"
                }
              ]
            },
            {
              "id": "T1027.009",
              "name": "Embedded Payloads",
              "link": "https://attack.mitre.org/techniques/T1027/009/",
              "description": "Adversaries may embed payloads within other files to conceal malicious content from defenses. Otherwise seemingly benign files (such as scripts and executables) may be abused to carry and obfuscate malicious payloads and content. In some cases, embedded payloads may also enable adversaries to Subvert Trust Controls by not impacting execution controls such as digital signatures and notarization tickets. \nAdversaries may embed payloads in various file formats to hide payloads. This is similar to Steganography, though does not involve weaving malicious content into specific bytes and patterns related to legitimate digital media formats. \nFor example, adversaries have been observed embedding payloads within or as an overlay of an otherwise benign binary. Adversaries have also been observed nesting payloads (such as executables and run-only scripts) inside a file of the same format. \nEmbedded content may also be used as Process Injection payloads used to infect benign system processes. These embedded then injected payloads may be used as part of the modules of malware designed to provide specific features such as encrypting C2 communications in support of an orchestrator module. For example, an embedded module may be injected into default browsers, allowing adversaries to then communicate via the network.",
              "signatures": [
                {
                  "severity": "UNKNOWN",
                  "description": "The process has executed a dropped binary"
                },
                {
                  "severity": "UNKNOWN",
                  "description": "Drops interesting files and uses them"
                }
              ]
            }
          ]
        },
        {
          "id": "TA0003",
          "name": "Persistence",
          "link": "https://attack.mitre.org/tactics/TA0003/",
          "description": "The adversary is trying to maintain their foothold.\n\nPersistence consists of techniques that adversaries use to keep access to systems across restarts, changed credentials, and other interruptions that could cut off their access. Techniques used for persistence include any access, action, or configuration changes that let them maintain their foothold on systems, such as replacing or hijacking legitimate code or adding startup code. ",
          "techniques": [
            {
              "id": "T1053",
              "name": "Scheduled Task/Job",
              "link": "https://attack.mitre.org/techniques/T1053/",
              "description": "Adversaries may abuse task scheduling functionality to facilitate initial or recurring execution of malicious code. Utilities exist within all major operating systems to schedule programs or scripts to be executed at a specified date and time. A task can also be scheduled on a remote system, provided the proper authentication is met (ex: RPC and file and printer sharing in Windows environments). Scheduling a task on a remote system typically may require being a member of an admin or otherwise privileged group on the remote system.\nAdversaries may use task scheduling to execute programs at system startup or on a scheduled basis for persistence. These mechanisms can also be abused to run a process under the context of a specified account (such as one with elevated permissions/privileges). Similar to System Binary Proxy Execution, adversaries have also abused task scheduling to potentially mask one-time execution under a trusted system process.",
              "signatures": [
                {
                  "severity": "UNKNOWN",
                  "description": "It creates a system task"
                }
              ]
            }
          ]
        },
        {
          "id": "TA0004",
          "name": "Privilege Escalation",
          "link": "https://attack.mitre.org/tactics/TA0004/",
          "description": "The adversary is trying to gain higher-level permissions.\n\nPrivilege Escalation consists of techniques that adversaries use to gain higher-level permissions on a system or network. Adversaries can often enter and explore a network with unprivileged access but require elevated permissions to follow through on their objectives. Common approaches are to take advantage of system weaknesses, misconfigurations, and vulnerabilities. Examples of elevated access include: \n\n* SYSTEM/root level\n* local administrator\n* user account with admin-like access \n* user accounts with access to specific system or perform specific function\n\nThese techniques often overlap with Persistence techniques, as OS features that let an adversary persist can execute in an elevated context.  ",
          "techniques": [
            {
              "id": "T1053",
              "name": "Scheduled Task/Job",
              "link": "https://attack.mitre.org/techniques/T1053/",
              "description": "Adversaries may abuse task scheduling functionality to facilitate initial or recurring execution of malicious code. Utilities exist within all major operating systems to schedule programs or scripts to be executed at a specified date and time. A task can also be scheduled on a remote system, provided the proper authentication is met (ex: RPC and file and printer sharing in Windows environments). Scheduling a task on a remote system typically may require being a member of an admin or otherwise privileged group on the remote system.\nAdversaries may use task scheduling to execute programs at system startup or on a scheduled basis for persistence. These mechanisms can also be abused to run a process under the context of a specified account (such as one with elevated permissions/privileges). Similar to System Binary Proxy Execution, adversaries have also abused task scheduling to potentially mask one-time execution under a trusted system process.",
              "signatures": [
                {
                  "severity": "UNKNOWN",
                  "description": "It creates a system task"
                }
              ]
            }
          ]
        }
      ]
    },
    "Zenbox": {
      "tactics": [
        {
          "id": "TA0002",
          "name": "Execution",
          "link": "https://attack.mitre.org/tactics/TA0002/",
          "description": "The adversary is trying to run malicious code.\n\nExecution consists of techniques that result in adversary-controlled code running on a local or remote system. Techniques that run malicious code are often paired with techniques from all other tactics to achieve broader goals, like exploring a network or stealing data. For example, an adversary might use a remote access tool to run a PowerShell script that does Remote System Discovery. ",
          "techniques": [
            {
              "id": "T1059",
              "name": "Command and Scripting Interpreter",
              "link": "https://attack.mitre.org/techniques/T1059/",
              "description": "Adversaries may abuse command and script interpreters to execute commands, scripts, or binaries. These interfaces and languages provide ways of interacting with computer systems and are a common feature across many different platforms. Most systems come with some built-in command-line interface and scripting capabilities, for example, macOS and Linux distributions include some flavor of Unix Shell while Windows installations include the Windows Command Shell and PowerShell.\nThere are also cross-platform interpreters such as Python, as well as those commonly associated with client applications such as JavaScript and Visual Basic.\nAdversaries may abuse these technologies in various ways as a means of executing arbitrary commands. Commands and scripts can be embedded in Initial Access payloads delivered to victims as lure documents or as secondary payloads downloaded from an existing C2. Adversaries may also execute commands through interactive terminals/shells, as well as utilize various Remote Services in order to achieve remote Execution."
            },
            {
              "id": "T1059.001",
              "name": "PowerShell",
              "link": "https://attack.mitre.org/techniques/T1059/001/",
              "description": "Adversaries may abuse PowerShell commands and scripts for execution. PowerShell is a powerful interactive command-line interface and scripting environment included in the Windows operating system. Adversaries can use PowerShell to perform a number of actions, including discovery of information and execution of code. Examples include the Start-Process cmdlet which can be used to run an executable and the Invoke-Command cmdlet which runs a command locally or on a remote computer (though administrator permissions are required to use PowerShell to connect to remote systems).\nPowerShell may also be used to download and run executables from the Internet, which can be executed from disk or in memory without touching disk.\nA number of PowerShell-based offensive testing tools are available, including Empire,  PowerSploit, PoshC2, and PSAttack.\nPowerShell commands/scripts can also be executed without directly invoking the powershell.exe binary through interfaces to PowerShell's underlying System.Management.Automation assembly DLL exposed through the .NET framework and Windows Common Language Interface (CLI).",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Bypasses PowerShell execution policy",
                  "match_data": [
                    "C:\\Windows\\System32\\WindowsPowerShell\\v1.0\\powershell.exe \"C:\\Windows\\System32\\WindowsPowerShell\\v1.0\\powershell.exe\" -ExecutionPolicy Bypass Add-MpPreference -ExclusionPath 'C:\\Users\\user\\Desktop\\afs"
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0003",
          "name": "Persistence",
          "link": "https://attack.mitre.org/tactics/TA0003/",
          "description": "The adversary is trying to maintain their foothold.\n\nPersistence consists of techniques that adversaries use to keep access to systems across restarts, changed credentials, and other interruptions that could cut off their access. Techniques used for persistence include any access, action, or configuration changes that let them maintain their foothold on systems, such as replacing or hijacking legitimate code or adding startup code. ",
          "techniques": [
            {
              "id": "T1574",
              "name": "Hijack Execution Flow",
              "link": "https://attack.mitre.org/techniques/T1574/",
              "description": "Adversaries may execute their own malicious payloads by hijacking the way operating systems run programs. Hijacking execution flow can be for the purposes of persistence, since this hijacked execution may reoccur over time. Adversaries may also use these mechanisms to elevate privileges or evade defenses, such as application control or other restrictions on execution.\nThere are many ways an adversary may hijack the flow of execution, including by manipulating how the operating system locates programs to be executed. How the operating system locates libraries to be used by a program can also be intercepted. Locations where the operating system looks for programs/resources, such as file directories and in the case of Windows the Registry, could also be poisoned to include malicious payloads."
            },
            {
              "id": "T1574.002",
              "name": "DLL Side-Loading",
              "link": "https://attack.mitre.org/techniques/T1574/002/",
              "description": "Adversaries may execute their own malicious payloads by side-loading DLLs. Similar to DLL, side-loading involves hijacking which DLL a program loads. But rather than just planting the DLL within the search order of a program then waiting for the victim application to be invoked, adversaries may directly side-load their payloads by planting then invoking a legitimate application that executes their payload(s).\nSide-loading takes advantage of the DLL search order used by the loader by positioning both the victim application and malicious payload(s) alongside each other. Adversaries likely use side-loading as a means of masking actions they perform under a legitimate, trusted, and potentially elevated system or software process. Benign executables used to side-load payloads may not be flagged during delivery and/or execution. Adversary payloads may also be encrypted/packed or otherwise obfuscated until loaded into the memory of the trusted process.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Tries to load missing DLLs",
                  "match_data": [
                    "mscoree.dll",
                    "apphelp.dll",
                    "kernel.appcore.dll",
                    "version.dll",
                    "vcruntime140_1_clr0400.dll",
                    "vcruntime140_clr0400.dll",
                    "ucrtbase_clr0400.dll",
                    "uxtheme.dll",
                    "bcrypt.dll",
                    "cryptsp.dll",
                    "rsaenh.dll",
                    "cryptbase.dll",
                    "windows.storage.dll",
                    "wintypes.dll",
                    "propsys.dll",
                    "dlnashext.dll",
                    "wpdshext.dll",
                    "cfgmgr32.dll",
                    "profapi.dll",
                    "edputil.dll",
                    "urlmon.dll",
                    "iertutil.dll",
                    "srvcli.dll",
                    "netutils.dll",
                    "windows.staterepositoryps.dll",
                    "sspicli.dll",
                    "virtdisk.dll",
                    "wldp.dll",
                    "smartscreenps.dll",
                    "shdocvw.dll",
                    "appresolver.dll",
                    "userenv.dll",
                    "bcp47langs.dll",
                    "onecoreuapcommonproxystub.dll",
                    "atl.dll",
                    "msasn1.dll",
                    "amsi.dll",
                    "gpapi.dll",
                    "appidapi.dll",
                    "srpapi.dll",
                    "secur32.dll",
                    "msisip.dll",
                    "wshext.dll",
                    "appxsip.dll",
                    "pwrshsip.dll",
                    "microsoft.management.infrastructure.native.unmanaged.dll",
                    "mi.dll",
                    "miutils.dll",
                    "wmidcom.dll",
                    "dpapi.dll",
                    "wbemcomn.dll",
                    "fastprox.dll",
                    "ncobjapi.dll",
                    "mpclient.dll",
                    "wmitomi.dll",
                    "qmgr.dll",
                    "bitsperf.dll",
                    "powrprof.dll",
                    "xmllite.dll",
                    "firewallapi.dll",
                    "esent.dll",
                    "umpdc.dll",
                    "fwbase.dll",
                    "ntmarta.dll",
                    "flightsettings.dll",
                    "policymanager.dll",
                    "msvcp110_win.dll",
                    "netprofm.dll",
                    "npmproxy.dll",
                    "bitsigd.dll",
                    "upnp.dll",
                    "winhttp.dll",
                    "ssdpapi.dll",
                    "iphlpapi.dll"
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0004",
          "name": "Privilege Escalation",
          "link": "https://attack.mitre.org/tactics/TA0004/",
          "description": "The adversary is trying to gain higher-level permissions.\n\nPrivilege Escalation consists of techniques that adversaries use to gain higher-level permissions on a system or network. Adversaries can often enter and explore a network with unprivileged access but require elevated permissions to follow through on their objectives. Common approaches are to take advantage of system weaknesses, misconfigurations, and vulnerabilities. Examples of elevated access include: \n\n* SYSTEM/root level\n* local administrator\n* user account with admin-like access \n* user accounts with access to specific system or perform specific function\n\nThese techniques often overlap with Persistence techniques, as OS features that let an adversary persist can execute in an elevated context.  ",
          "techniques": [
            {
              "id": "T1574",
              "name": "Hijack Execution Flow",
              "link": "https://attack.mitre.org/techniques/T1574/",
              "description": "Adversaries may execute their own malicious payloads by hijacking the way operating systems run programs. Hijacking execution flow can be for the purposes of persistence, since this hijacked execution may reoccur over time. Adversaries may also use these mechanisms to elevate privileges or evade defenses, such as application control or other restrictions on execution.\nThere are many ways an adversary may hijack the flow of execution, including by manipulating how the operating system locates programs to be executed. How the operating system locates libraries to be used by a program can also be intercepted. Locations where the operating system looks for programs/resources, such as file directories and in the case of Windows the Registry, could also be poisoned to include malicious payloads."
            },
            {
              "id": "T1574.002",
              "name": "DLL Side-Loading",
              "link": "https://attack.mitre.org/techniques/T1574/002/",
              "description": "Adversaries may execute their own malicious payloads by side-loading DLLs. Similar to DLL, side-loading involves hijacking which DLL a program loads. But rather than just planting the DLL within the search order of a program then waiting for the victim application to be invoked, adversaries may directly side-load their payloads by planting then invoking a legitimate application that executes their payload(s).\nSide-loading takes advantage of the DLL search order used by the loader by positioning both the victim application and malicious payload(s) alongside each other. Adversaries likely use side-loading as a means of masking actions they perform under a legitimate, trusted, and potentially elevated system or software process. Benign executables used to side-load payloads may not be flagged during delivery and/or execution. Adversary payloads may also be encrypted/packed or otherwise obfuscated until loaded into the memory of the trusted process.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Tries to load missing DLLs",
                  "match_data": [
                    "mscoree.dll",
                    "apphelp.dll",
                    "kernel.appcore.dll",
                    "version.dll",
                    "vcruntime140_1_clr0400.dll",
                    "vcruntime140_clr0400.dll",
                    "ucrtbase_clr0400.dll",
                    "uxtheme.dll",
                    "bcrypt.dll",
                    "cryptsp.dll",
                    "rsaenh.dll",
                    "cryptbase.dll",
                    "windows.storage.dll",
                    "wintypes.dll",
                    "propsys.dll",
                    "dlnashext.dll",
                    "wpdshext.dll",
                    "cfgmgr32.dll",
                    "profapi.dll",
                    "edputil.dll",
                    "urlmon.dll",
                    "iertutil.dll",
                    "srvcli.dll",
                    "netutils.dll",
                    "windows.staterepositoryps.dll",
                    "sspicli.dll",
                    "virtdisk.dll",
                    "wldp.dll",
                    "smartscreenps.dll",
                    "shdocvw.dll",
                    "appresolver.dll",
                    "userenv.dll",
                    "bcp47langs.dll",
                    "onecoreuapcommonproxystub.dll",
                    "atl.dll",
                    "msasn1.dll",
                    "amsi.dll",
                    "gpapi.dll",
                    "appidapi.dll",
                    "srpapi.dll",
                    "secur32.dll",
                    "msisip.dll",
                    "wshext.dll",
                    "appxsip.dll",
                    "pwrshsip.dll",
                    "microsoft.management.infrastructure.native.unmanaged.dll",
                    "mi.dll",
                    "miutils.dll",
                    "wmidcom.dll",
                    "dpapi.dll",
                    "wbemcomn.dll",
                    "fastprox.dll",
                    "ncobjapi.dll",
                    "mpclient.dll",
                    "wmitomi.dll",
                    "qmgr.dll",
                    "bitsperf.dll",
                    "powrprof.dll",
                    "xmllite.dll",
                    "firewallapi.dll",
                    "esent.dll",
                    "umpdc.dll",
                    "fwbase.dll",
                    "ntmarta.dll",
                    "flightsettings.dll",
                    "policymanager.dll",
                    "msvcp110_win.dll",
                    "netprofm.dll",
                    "npmproxy.dll",
                    "bitsigd.dll",
                    "upnp.dll",
                    "winhttp.dll",
                    "ssdpapi.dll",
                    "iphlpapi.dll"
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0005",
          "name": "Defense Evasion",
          "link": "https://attack.mitre.org/tactics/TA0005/",
          "description": "The adversary is trying to avoid being detected.\n\nDefense Evasion consists of techniques that adversaries use to avoid detection throughout their compromise. Techniques used for defense evasion include uninstalling/disabling security software or obfuscating/encrypting data and scripts. Adversaries also leverage and abuse trusted processes to hide and masquerade their malware. Other tactics’ techniques are cross-listed here when those techniques include the added benefit of subverting defenses. ",
          "techniques": [
            {
              "id": "T1574",
              "name": "Hijack Execution Flow",
              "link": "https://attack.mitre.org/techniques/T1574/",
              "description": "Adversaries may execute their own malicious payloads by hijacking the way operating systems run programs. Hijacking execution flow can be for the purposes of persistence, since this hijacked execution may reoccur over time. Adversaries may also use these mechanisms to elevate privileges or evade defenses, such as application control or other restrictions on execution.\nThere are many ways an adversary may hijack the flow of execution, including by manipulating how the operating system locates programs to be executed. How the operating system locates libraries to be used by a program can also be intercepted. Locations where the operating system looks for programs/resources, such as file directories and in the case of Windows the Registry, could also be poisoned to include malicious payloads."
            },
            {
              "id": "T1574.002",
              "name": "DLL Side-Loading",
              "link": "https://attack.mitre.org/techniques/T1574/002/",
              "description": "Adversaries may execute their own malicious payloads by side-loading DLLs. Similar to DLL, side-loading involves hijacking which DLL a program loads. But rather than just planting the DLL within the search order of a program then waiting for the victim application to be invoked, adversaries may directly side-load their payloads by planting then invoking a legitimate application that executes their payload(s).\nSide-loading takes advantage of the DLL search order used by the loader by positioning both the victim application and malicious payload(s) alongside each other. Adversaries likely use side-loading as a means of masking actions they perform under a legitimate, trusted, and potentially elevated system or software process. Benign executables used to side-load payloads may not be flagged during delivery and/or execution. Adversary payloads may also be encrypted/packed or otherwise obfuscated until loaded into the memory of the trusted process.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Tries to load missing DLLs",
                  "match_data": [
                    "mscoree.dll",
                    "apphelp.dll",
                    "kernel.appcore.dll",
                    "version.dll",
                    "vcruntime140_1_clr0400.dll",
                    "vcruntime140_clr0400.dll",
                    "ucrtbase_clr0400.dll",
                    "uxtheme.dll",
                    "bcrypt.dll",
                    "cryptsp.dll",
                    "rsaenh.dll",
                    "cryptbase.dll",
                    "windows.storage.dll",
                    "wintypes.dll",
                    "propsys.dll",
                    "dlnashext.dll",
                    "wpdshext.dll",
                    "cfgmgr32.dll",
                    "profapi.dll",
                    "edputil.dll",
                    "urlmon.dll",
                    "iertutil.dll",
                    "srvcli.dll",
                    "netutils.dll",
                    "windows.staterepositoryps.dll",
                    "sspicli.dll",
                    "virtdisk.dll",
                    "wldp.dll",
                    "smartscreenps.dll",
                    "shdocvw.dll",
                    "appresolver.dll",
                    "userenv.dll",
                    "bcp47langs.dll",
                    "onecoreuapcommonproxystub.dll",
                    "atl.dll",
                    "msasn1.dll",
                    "amsi.dll",
                    "gpapi.dll",
                    "appidapi.dll",
                    "srpapi.dll",
                    "secur32.dll",
                    "msisip.dll",
                    "wshext.dll",
                    "appxsip.dll",
                    "pwrshsip.dll",
                    "microsoft.management.infrastructure.native.unmanaged.dll",
                    "mi.dll",
                    "miutils.dll",
                    "wmidcom.dll",
                    "dpapi.dll",
                    "wbemcomn.dll",
                    "fastprox.dll",
                    "ncobjapi.dll",
                    "mpclient.dll",
                    "wmitomi.dll",
                    "qmgr.dll",
                    "bitsperf.dll",
                    "powrprof.dll",
                    "xmllite.dll",
                    "firewallapi.dll",
                    "esent.dll",
                    "umpdc.dll",
                    "fwbase.dll",
                    "ntmarta.dll",
                    "flightsettings.dll",
                    "policymanager.dll",
                    "msvcp110_win.dll",
                    "netprofm.dll",
                    "npmproxy.dll",
                    "bitsigd.dll",
                    "upnp.dll",
                    "winhttp.dll",
                    "ssdpapi.dll",
                    "iphlpapi.dll"
                  ]
                }
              ]
            },
            {
              "id": "T1036",
              "name": "Masquerading",
              "link": "https://attack.mitre.org/techniques/T1036/",
              "description": "Adversaries may attempt to manipulate features of their artifacts to make them appear legitimate or benign to users and/or security tools. Masquerading occurs when the name or location of an object, legitimate or malicious, is manipulated or abused for the sake of evading defenses and observation. This may include manipulating file metadata, tricking users into misidentifying the file type, and giving legitimate task or service names.\nRenaming abusable system utilities to evade security monitoring is also a form of Masquerading.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Creates files inside the user directory",
                  "match_data": [
                    "C:\\Users\\user\\Desktop\\afsfasfasfas.exe"
                  ]
                }
              ]
            },
            {
              "id": "T1562",
              "name": "Impair Defenses",
              "link": "https://attack.mitre.org/techniques/T1562/",
              "description": "Adversaries may maliciously modify components of a victim environment in order to hinder or disable defensive mechanisms. This not only involves impairing preventative defenses, such as firewalls and anti-virus, but also detection capabilities that defenders can use to audit activity and identify malicious behavior. This may also span both native defenses as well as supplemental capabilities installed by users and administrators.\nAdversaries may also impair routine operations that contribute to defensive hygiene, such as blocking users from logging out, preventing a system from shutting down, or disabling or modifying the update process. Adversaries could also target event aggregation and analysis mechanisms, or otherwise disrupt these procedures by altering other system components. These restrictions can further enable malicious operations as well as the continued propagation of incidents."
            },
            {
              "id": "T1562.001",
              "name": "Disable or Modify Tools",
              "link": "https://attack.mitre.org/techniques/T1562/001/",
              "description": "Adversaries may modify and/or disable security tools to avoid possible detection of their malware/tools and activities. This may take many forms, such as killing security software processes or services, modifying / deleting Registry keys or configuration files so that tools do not operate properly, or other methods to interfere with security tools scanning or reporting information. Adversaries may also disable updates to prevent the latest security patches from reaching tools on victim systems.\nAdversaries may trigger a denial-of-service attack via legitimate system processes. It has been previously observed that the Windows Time Travel Debugging (TTD) monitor driver can be used to initiate a debugging session for a security tool (e.g., an EDR) and render the tool non-functional.  By hooking the debugger into the EDR process, all child processes from the EDR will be automatically suspended. The attacker can terminate any EDR helper processes (unprotected by Windows Protected Process Light) by abusing the Process Explorer driver. In combination this will halt any attempt to restart services and cause the tool to crash.\nAdversaries may also tamper with artifacts deployed and utilized by security tools. Security tools may make dynamic changes to system components in order to maintain visibility into specific events. For example, security products may load their own modules and/or modify those loaded by processes to facilitate data collection. Similar to Indicator Blocking, adversaries may unhook or otherwise modify these features added by tools (especially those that exist in userland or are otherwise potentially accessible to adversaries) to avoid detection. For example, adversaries may abuse the Windows process mitigation policy to block certain endpoint detection and response (EDR) products from loading their user-mode code via DLLs. By spawning a process with the PROCESS_CREATION_MITIGATION_POLICY_BLOCK_NON_MICROSOFT_BINARIES_ALWAYS_ON attribute using API calls like UpdateProcThreadAttribute, adversaries may evade detection by endpoint security solutions that rely on DLLs that are not signed by Microsoft. Alternatively, they may add new directories to an EDR tool’s exclusion list, enabling them to hide malicious files via File/Path Exclusions.\nAdversaries may also focus on specific applications such as Sysmon. For example, the “Start” and “Enable” values in HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\WMI\\Autologger\\EventLog-Microsoft-Windows-Sysmon-Operational may be modified to tamper with and potentially disable Sysmon logging. \nOn network devices, adversaries may attempt to skip digital signature verification checks by altering startup configuration files and effectively disabling firmware verification that typically occurs at boot.\nIn cloud environments, tools disabled by adversaries may include cloud monitoring agents that report back to services such as AWS CloudWatch or Google Cloud Monitor.\nFurthermore, although defensive tools may have anti-tampering mechanisms, adversaries may abuse tools such as legitimate rootkit removal kits to impair and/or disable these tools. For example, adversaries have used tools such as GMER to find and shut down hidden processes and antivirus software on infected systems.\nAdditionally, adversaries may exploit legitimate drivers from anti-virus software to gain access to kernel space (i.e. Exploitation for Privilege Escalation), which may lead to bypassing anti-tampering features.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Creates guard pages, often used to prevent reverse engineering and debugging",
                  "match_data": [
                    "page read and write | page guard"
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "Adds a directory exclusion to Windows Defender",
                  "match_data": [
                    "C:\\Windows\\System32\\WindowsPowerShell\\v1.0\\powershell.exe \"C:\\Windows\\System32\\WindowsPowerShell\\v1.0\\powershell.exe\" -ExecutionPolicy Bypass Add-MpPreference -ExclusionPath 'C:\\Users\\user\\Desktop\\afs",
                    "C:\\Windows\\System32\\WindowsPowerShell\\v1.0\\powershell.exe \"C:\\Windows\\System32\\WindowsPowerShell\\v1.0\\powershell.exe\" -ExecutionPolicy Bypass Add-MpPreference -ExclusionPath 'C:\\Users\\user\\Desktop\\as.",
                    "C:\\Windows\\System32\\WindowsPowerShell\\v1.0\\powershell.exe \"C:\\Windows\\System32\\WindowsPowerShell\\v1.0\\powershell.exe\" -ExecutionPolicy Bypass Add-MpPreference -ExclusionPath 'C:\\Users\\user\\Desktop\\hah",
                    "C:\\Windows\\System32\\WindowsPowerShell\\v1.0\\powershell.exe \"C:\\Windows\\System32\\WindowsPowerShell\\v1.0\\powershell.exe\" -ExecutionPolicy Bypass Add-MpPreference -ExclusionPath 'C:\\Users\\user\\Desktop\\whw",
                    "C:\\Windows\\System32\\WindowsPowerShell\\v1.0\\powershell.exe \"C:\\Windows\\System32\\WindowsPowerShell\\v1.0\\powershell.exe\" -ExecutionPolicy Bypass Add-MpPreference -ExclusionPath 'C:\\Users\\user\\Desktop\\XCl",
                    "C:\\Windows\\System32\\WindowsPowerShell\\v1.0\\powershell.exe \"C:\\Windows\\System32\\WindowsPowerShell\\v1.0\\powershell.exe\" -ExecutionPolicy Bypass Add-MpPreference -ExclusionPath 'C:\\Users\\user\\Desktop\\www"
                  ]
                }
              ]
            },
            {
              "id": "T1497",
              "name": "Virtualization/Sandbox Evasion",
              "link": "https://attack.mitre.org/techniques/T1497/",
              "description": "Adversaries may employ various means to detect and avoid virtualization and analysis environments. This may include changing behaviors based on the results of checks for the presence of artifacts indicative of a virtual machine environment (VME) or sandbox. If the adversary detects a VME, they may alter their malware to disengage from the victim or conceal the core functions of the implant. They may also search for VME artifacts before dropping secondary or additional payloads. Adversaries may use the information learned from Virtualization/Sandbox Evasion during automated discovery to shape follow-on behaviors.\nAdversaries may use several methods to accomplish Virtualization/Sandbox Evasion such as checking for security monitoring tools (e.g., Sysinternals, Wireshark, etc.) or other system artifacts associated with analysis or virtualization. Adversaries may also check for legitimate user activity to help determine if it is in an analysis environment. Additional methods include use of sleep timers or loops within malware code to avoid operating within a temporary sandbox.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Contains medium sleeps (>= 30s)",
                  "match_data": [
                    "delay time: 922337203685477"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "Allocates memory with a write watch (potentially for evading sandboxes)",
                  "match_data": [
                    "1520000 memory reserve | memory write watch",
                    "1AF80000 memory reserve | memory write watch",
                    "1770000 memory reserve | memory write watch",
                    "1B3A0000 memory reserve | memory write watch",
                    "2290000 memory reserve | memory write watch",
                    "1A450000 memory reserve | memory write watch",
                    "1190000 memory reserve | memory write watch",
                    "1AD50000 memory reserve | memory write watch",
                    "1460000 memory reserve | memory write watch",
                    "1B030000 memory reserve | memory write watch",
                    "1590000 memory reserve | memory write watch",
                    "1B100000 memory reserve | memory write watch",
                    "17C0000 memory reserve | memory write watch",
                    "1B380000 memory reserve | memory write watch"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "Queries disk information (often used to detect virtual machines)",
                  "match_data": [
                    "PhysicalDrive0"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "Contains long sleeps (>= 3 min)",
                  "match_data": [
                    "delay time: 922337203685477"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "May sleep (evasive loops) to hinder dynamic analysis",
                  "match_data": [
                    "-922337203685477s >= -30000s",
                    "-5534023222112862s >= -30000s",
                    "2183 > 30",
                    "2156 > 30",
                    "1465 > 30",
                    "1890 > 30",
                    "-7378697629483816s >= -30000s",
                    "-1844674407370954s >= -30000s",
                    "-30000s >= -30000s"
                  ]
                }
              ]
            },
            {
              "id": "T1140",
              "name": "Deobfuscate/Decode Files or Information",
              "link": "https://attack.mitre.org/techniques/T1140/",
              "description": "Adversaries may use Obfuscated Files or Information to hide artifacts of an intrusion from analysis. They may require separate mechanisms to decode or deobfuscate that information depending on how they intend to use it. Methods for doing that include built-in functionality of malware or by using utilities present on the system.\nOne such example is the use of certutil to decode a remote access tool portable executable file that has been hidden inside a certificate file. Another example is using the Windows copy /b or type command to reassemble binary fragments into a malicious payload.\nSometimes a user's action may be required to open it for deobfuscation or decryption as part of User Execution. The user may also be required to input a password to open a password protected compressed/encrypted file that was provided by the adversary.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": ".NET source code contains calls to encryption/decryption functions",
                  "match_data": [
                    "'TransformFinalBlock'"
                  ]
                }
              ]
            },
            {
              "id": "T1027",
              "name": "Obfuscated Files or Information",
              "link": "https://attack.mitre.org/techniques/T1027/",
              "description": "Adversaries may attempt to make an executable or file difficult to discover or analyze by encrypting, encoding, or otherwise obfuscating its contents on the system or in transit. This is common behavior that can be used across different platforms and the network to evade defenses. \nPayloads may be compressed, archived, or encrypted in order to avoid detection. These payloads may be used during Initial Access or later to mitigate detection. Sometimes a user's action may be required to open and Deobfuscate/Decode Files or Information for User Execution. The user may also be required to input a password to open a password protected compressed/encrypted file that was provided by the adversary.  Adversaries may also use compressed or archived scripts, such as JavaScript. \nPortions of files can also be encoded to hide the plain-text strings that would otherwise help defenders with discovery.  Payloads may also be split into separate, seemingly benign files that only reveal malicious functionality when reassembled. \nAdversaries may also abuse Command Obfuscation to obscure commands executed from payloads or directly via Command and Scripting Interpreter. Environment variables, aliases, characters, and other platform/language specific semantics can be used to evade signature based detections and application control mechanisms.   ",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": ".NET source code contains long base64-encoded strings",
                  "match_data": [
                    "'rtVX2vlRPo1XXEVQSY5IlO15aOeOB9y3EPKD04DIpiRPcv1XjZbT7uaGF8KX2yOhxOKnguHbZW0QXFxM', 'jsVQaad7FVWt0AdiJTBOaen5cL2Jbx8R5hgohhnrhhAFlsRfijX6rdtGLNZIC0QhdN0GUDxhKRuYmCbR', 'SYM43a6QlEIG8QdWCrKJjwmD68cON3M",
                    "'hy4Nff3m3QOJPe9h3J8vIKEQqsPxiL7RdnVv8PQGuKshqv8ZsphJ5HrQs8onI9OwS7dDLKlgM8wuGhQN'",
                    "'NIqses4Z5Jkpb1tRer92FqBvWKlS5ClVMPRTJkYTXN6YDErrQixfL4bvcJStpyxubpDGLCOpWWWIRSpQ'",
                    "'iYfkUUsGUBcCA1VdRTVA1EQMHQ2X0Il3sskDiW02av6WimxwtxXCx6LC'",
                    "'IjqJAtwmhcXglEqAmlr5AKFb2Us60WNUQKcNon9EHz42UgJPWrwl7hKIic4XLh2ix7R8T9E2wMSkcy2kE2LP'"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "Binary may include packed or crypted data",
                  "match_data": [
                    "section name: .text entropy: 7.988314934316295"
                  ]
                }
              ]
            },
            {
              "id": "T1027.002",
              "name": "Software Packing",
              "link": "https://attack.mitre.org/techniques/T1027/002/",
              "description": "Adversaries may perform software packing or virtual machine software protection to conceal their code. Software packing is a method of compressing or encrypting an executable. Packing an executable changes the file signature in an attempt to avoid signature-based detection. Most decompression techniques decompress the executable code in memory. Virtual machine software protection translates an executable's original code into a special format that only a special virtual machine can run. A virtual machine is then called to run this code. \nUtilities used to perform software packing are called packers. Example packers are MPRESS and UPX. A more comprehensive list of known packers is available, but adversaries may create their own packing techniques that do not leave the same artifacts as well-known packers to evade defenses.  ",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "PE file has an executable .text section which is very likely to contain packed code (zlib compression ratio < 0.3)",
                  "match_data": [
                    "Section: .text IMAGE_SCN_CNT_CODE, IMAGE_SCN_MEM_EXECUTE, IMAGE_SCN_MEM_READ"
                  ]
                },
                {
                  "severity": "LOW",
                  "description": ".NET source code contains method to dynamically call methods (often used by packers)",
                  "match_data": [
                    "NewLateBinding.LateCall(obj, (Type)null, \"Invoke\", new object[2]{null,new object[5]{rYaosqj4kazSU0N.om1fYzBs7p8IXu0,rYaosqj4kazSU0N.eXzQIJ9MgYhs6TE,rYaosqj4kazSU0N.N2qWYyvkRieUm2h,rYaosqj4kazSU0N._6i6",
                    "NewLateBinding.LateCall(obj, (Type)null, \"Invoke\", new object[2]{null,new object[2]{_0Y1Ig3VsjNno2DJ0l0LSVuKi4q16Qc6GPOo2eF6yK65pknf[2],lRC9arV1tLhmHY0DPVNc6BpsILI4DOOQw.IkcPvh1yPkJOQq1iTyMK2LH3T7qOa2",
                    "NewLateBinding.LateCall(obj, (Type)null, \"Invoke\", new object[2]{null,new object[5]{lGN4N8vIS2zIiWXmyhAtgf1piGq4gPu8SreAy2N.YEphRwRkVvwdzwVykriaXkhBVYriWLBz5jRtG1j,lGN4N8vIS2zIiWXmyhAtgf1piGq4gPu8SreA",
                    "NewLateBinding.LateCall(obj, (Type)null, \"Invoke\", new object[2]{null,new object[2]{kJzoDH9UrLVYZ9QaQqTo7d0EA8ACza2UzMs1Y03[2],MGllpWLcnsEn0SGCuxLyjddM7o0CTlmJf4jZmfk1QDnjsh0RgGn95rkB0H8Rqrx9MABnSQJ.k",
                    "NewLateBinding.LateCall(obj, (Type)null, \"Invoke\", new object[2]{null,new object[5]{_5ojHNantzeGy5dS7RVqDAgrD1.Fgclz8tahcVHu3rZdfUWFgluY,_5ojHNantzeGy5dS7RVqDAgrD1.o1dWRJnPqKO40hW8BnluwDQDB,_5ojHNantz",
                    "NewLateBinding.LateCall(obj, (Type)null, \"Invoke\", new object[2]{null,new object[2]{dfQXuHHNj9w[2],M2AxF9H1zvS.mXzcCEpuMCf(Convert.FromBase64String(dfQXuHHNj9w[3]))}}, (string[])null, (Type[])null, (b",
                    "NewLateBinding.LateCall(obj, (Type)null, \"Invoke\", new object[2]{null,new object[5]{feLHaeHzWnyhpygiWUvr1B0gNSyDLwBIFvrOTTdnCGOPSDPQ3DAamApaaUFRMWb4XEtSN8rDibk6kLiHNQAnV0SHjCfx2xbFEo.q6TXHM37xMfZNvf8S",
                    "NewLateBinding.LateCall(obj, (Type)null, \"Invoke\", new object[2]{null,new object[2]{WR7Ss1XXEiw4TF7cY0rJkJOV7bgd6HYUhR66GAkC[2],aG5JnuJzXnUYRHl2B8kYiqyShnaItFKeTIv7kUAtQq3X92RXiqXhA9BwzB.UfSi3YRlVPW5g",
                    "NewLateBinding.LateCall(obj, (Type)null, \"Invoke\", new object[2]{null,new object[5]{_0gvUQH8AUyhknHmPxBmxNTMOyDC.u1lzxaeEc8m5cPvCT9SuH1ZnQL5oWEvzzgWwP4RfT5O6gJGGVyIOmxXNSBAV,_0gvUQH8AUyhknHmPxBmxNTMOy",
                    "NewLateBinding.LateCall(obj, (Type)null, \"Invoke\", new object[2]{null,new object[2]{d6DjSlfY79lQ6yYvI6neNPCSLcguNKJFOyyxC8oPRECGU[2],F4fPhTkQgqHf2C8Mgw80mvyNpCLZqNQdRo69Gw9BELNQ3Quzwa5xBFxHZ0tjcEa2nX0",
                    "NewLateBinding.LateCall(obj, (Type)null, \"Invoke\", new object[2]{null,new object[5]{_7Ti3ip6z9WjGaacWd7ErYIDb9eC0W9wbc9.Kx3dt5np21sswhQMDHdOSqp2ggPEsPRS9x,_7Ti3ip6z9WjGaacWd7ErYIDb9eC0W9wbc9.sBVfjba8T",
                    "NewLateBinding.LateCall(obj, (Type)null, \"Invoke\", new object[2]{null,new object[2]{Pm6qLMBhnBETHxxmIaKOjGt9G7GWIl3zqKpGfQvZX3e3Gv5oK4cZvGQVFPQzwkwHvfb[2],TMecyuB3Hfe4W8gMqqZbxF28pVHSziJ8gJwoucJoeiioR"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "Binary may include packed or crypted data",
                  "match_data": [
                    "section name: .text entropy: 7.988314934316295"
                  ]
                },
                {
                  "severity": "LOW",
                  "description": ".NET source code contains potential unpacker",
                  "match_data": [
                    "SZFePSJUg0uZaeWO2ZIGUi5CmrB0BBDVD8SJjaeBd6Tw4wk System.AppDomain.Load(byte[])",
                    "eHRJULe2UBrOkke0cpOVY94WrvtnB5BtY8DcFvAP0QAaF4h System.AppDomain.Load(byte[])",
                    "eHRJULe2UBrOkke0cpOVY94WrvtnB5BtY8DcFvAP0QAaF4h",
                    "_9xo8QdMu3SK1BIsOdZzG4voSAn2O0CQazX7nd78 System.AppDomain.Load(byte[])",
                    "BMApPRR3iMV1UwKm8y0xMOB6avmznBXIf0nq6XG System.AppDomain.Load(byte[])",
                    "BMApPRR3iMV1UwKm8y0xMOB6avmznBXIf0nq6XG",
                    "txitLghE1b4 System.AppDomain.Load(byte[])",
                    "_9UutZTJN4Zf System.AppDomain.Load(byte[])",
                    "_9UutZTJN4Zf",
                    "H8KvrKFkElQc7cnuFXZMqT7RkgIKqNyLgAdxQ50C System.AppDomain.Load(byte[])",
                    "rMq1XXpy3lDpZ0oN4cTQs3b5A17g33d8sJnmSgOs System.AppDomain.Load(byte[])",
                    "rMq1XXpy3lDpZ0oN4cTQs3b5A17g33d8sJnmSgOs",
                    "KlbJWlbheLSZXd04DWJNzCOvkrCRNfNee0BTcG0TD3Y8G System.AppDomain.Load(byte[])",
                    "jjlI9CkMoOk2S6qNpyZgh35TEgLcCG7h4xP9baJRQHjBD System.AppDomain.Load(byte[])",
                    "jjlI9CkMoOk2S6qNpyZgh35TEgLcCG7h4xP9baJRQHjBD",
                    "BLwOtLiPPqNwMIAhcXwVSfYb9XWUMF9zs7 System.AppDomain.Load(byte[])",
                    "XZT5f6OxAuyEIUxohtVOPZbtUWHafPLOKjF5wErEBOf9vJoMM26UdZIcWL3R8a7pTLP System.AppDomain.Load(byte[])",
                    "XZT5f6OxAuyEIUxohtVOPZbtUWHafPLOKjF5wErEBOf9vJoMM26UdZIcWL3R8a7pTLP"
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0007",
          "name": "Discovery",
          "link": "https://attack.mitre.org/tactics/TA0007/",
          "description": "The adversary is trying to figure out your environment.\n\nDiscovery consists of techniques an adversary may use to gain knowledge about the system and internal network. These techniques help adversaries observe the environment and orient themselves before deciding how to act. They also allow adversaries to explore what they can control and what’s around their entry point in order to discover how it could benefit their current objective. Native operating system tools are often used toward this post-compromise information-gathering objective. ",
          "techniques": [
            {
              "id": "T1497",
              "name": "Virtualization/Sandbox Evasion",
              "link": "https://attack.mitre.org/techniques/T1497/",
              "description": "Adversaries may employ various means to detect and avoid virtualization and analysis environments. This may include changing behaviors based on the results of checks for the presence of artifacts indicative of a virtual machine environment (VME) or sandbox. If the adversary detects a VME, they may alter their malware to disengage from the victim or conceal the core functions of the implant. They may also search for VME artifacts before dropping secondary or additional payloads. Adversaries may use the information learned from Virtualization/Sandbox Evasion during automated discovery to shape follow-on behaviors.\nAdversaries may use several methods to accomplish Virtualization/Sandbox Evasion such as checking for security monitoring tools (e.g., Sysinternals, Wireshark, etc.) or other system artifacts associated with analysis or virtualization. Adversaries may also check for legitimate user activity to help determine if it is in an analysis environment. Additional methods include use of sleep timers or loops within malware code to avoid operating within a temporary sandbox.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Contains medium sleeps (>= 30s)",
                  "match_data": [
                    "delay time: 922337203685477"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "Allocates memory with a write watch (potentially for evading sandboxes)",
                  "match_data": [
                    "1520000 memory reserve | memory write watch",
                    "1AF80000 memory reserve | memory write watch",
                    "1770000 memory reserve | memory write watch",
                    "1B3A0000 memory reserve | memory write watch",
                    "2290000 memory reserve | memory write watch",
                    "1A450000 memory reserve | memory write watch",
                    "1190000 memory reserve | memory write watch",
                    "1AD50000 memory reserve | memory write watch",
                    "1460000 memory reserve | memory write watch",
                    "1B030000 memory reserve | memory write watch",
                    "1590000 memory reserve | memory write watch",
                    "1B100000 memory reserve | memory write watch",
                    "17C0000 memory reserve | memory write watch",
                    "1B380000 memory reserve | memory write watch"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "Queries disk information (often used to detect virtual machines)",
                  "match_data": [
                    "PhysicalDrive0"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "Contains long sleeps (>= 3 min)",
                  "match_data": [
                    "delay time: 922337203685477"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "May sleep (evasive loops) to hinder dynamic analysis",
                  "match_data": [
                    "-922337203685477s >= -30000s",
                    "-5534023222112862s >= -30000s",
                    "2183 > 30",
                    "2156 > 30",
                    "1465 > 30",
                    "1890 > 30",
                    "-7378697629483816s >= -30000s",
                    "-1844674407370954s >= -30000s",
                    "-30000s >= -30000s"
                  ]
                }
              ]
            },
            {
              "id": "T1518",
              "name": "Software Discovery",
              "link": "https://attack.mitre.org/techniques/T1518/",
              "description": "Adversaries may attempt to get a listing of software and software versions that are installed on a system or in a cloud environment. Adversaries may use the information from Software Discovery during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\nSuch software may be deployed widely across the environment for configuration management or security reasons, such as Software Deployment Tools, and may allow adversaries broad access to infect devices or move laterally.\nAdversaries may attempt to enumerate software for a variety of reasons, such as figuring out what security measures are present or if the compromised system has a version of software that is vulnerable to Exploitation for Privilege Escalation."
            },
            {
              "id": "T1518.001",
              "name": "Security Software Discovery",
              "link": "https://attack.mitre.org/techniques/T1518/001/",
              "description": "Adversaries may attempt to get a listing of security software, configurations, defensive tools, and sensors that are installed on a system or in a cloud environment. This may include things such as cloud monitoring agents and anti-virus. Adversaries may use the information from Security Software Discovery during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\nExample commands that can be used to obtain security software information are netsh, reg query with Reg, dir with cmd, and Tasklist, but other indicators of discovery behavior may be more specific to the type of software or security system the adversary is looking for. It is becoming more common to see macOS malware perform checks for LittleSnitch and KnockKnock software.\nAdversaries may also utilize the Cloud API to discover cloud-native security software installed on compute infrastructure, such as the AWS CloudWatch agent, Azure VM Agent, and Google Cloud Monitor agent. These agents  may collect  metrics and logs from the VM, which may be centrally aggregated in a cloud-based monitoring platform.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Queries disk information (often used to detect virtual machines)",
                  "match_data": [
                    "PhysicalDrive0"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "May try to detect the virtual machine to hinder analysis (VM artifact strings found in memory)",
                  "match_data": [
                    "Remove-NetEventVmNetworkAdapter",
                    "Add-NetEventVmNetworkAdapter",
                    "Get-NetEventVmNetworkAdapter"
                  ]
                }
              ]
            },
            {
              "id": "T1057",
              "name": "Process Discovery",
              "link": "https://attack.mitre.org/techniques/T1057/",
              "description": "Adversaries may attempt to get information about running processes on a system. Information obtained could be used to gain an understanding of common software/applications running on systems within the network. Administrator or otherwise elevated access may provide better process details. Adversaries may use the information from Process Discovery during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\nIn Windows environments, adversaries could obtain details on running processes using the Tasklist utility via cmd or Get-Process via PowerShell. Information about processes can also be extracted from the output of Native API calls such as CreateToolhelp32Snapshot. In Mac and Linux, this is accomplished with the ps command. Adversaries may also opt to enumerate processes via /proc. ESXi also supports use of the ps command, as well as esxcli system process list.\nOn network devices, Network Device CLI commands such as show processes can be used to display current running processes.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Queries a list of all running processes",
                  "match_data": [
                    "ProcessInformation"
                  ]
                }
              ]
            },
            {
              "id": "T1010",
              "name": "Application Window Discovery",
              "link": "https://attack.mitre.org/techniques/T1010/",
              "description": "Adversaries may attempt to get a listing of open application windows. Window listings could convey information about how the system is used. For example, information about application windows could be used identify potential data to collect as well as identifying security tooling (Security Software Discovery) to evade.\nAdversaries typically abuse system features for this type of enumeration. For example, they may gather information through native system features such as Command and Scripting Interpreter commands and Native API functions.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Sample monitors Window changes (e.g. starting applications), analyze the sample with the simulation cookbook"
                }
              ]
            },
            {
              "id": "T1083",
              "name": "File and Directory Discovery",
              "link": "https://attack.mitre.org/techniques/T1083/",
              "description": "Adversaries may enumerate files and directories or may search in specific locations of a host or network share for certain information within a file system. Adversaries may use the information from File and Directory Discovery during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\nMany command shell utilities can be used to obtain this information. Examples include dir, tree, ls, find, and locate. Custom tools may also be used to gather file and directory information and interact with the Native API. Adversaries may also leverage a Network Device CLI on network devices to gather file and directory information (e.g. dir, show flash, and/or nvram).\nSome files and directories may require elevated or specific user permissions to access.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Reads ini files",
                  "match_data": [
                    "C:\\Users\\desktop.ini"
                  ]
                }
              ]
            },
            {
              "id": "T1082",
              "name": "System Information Discovery",
              "link": "https://attack.mitre.org/techniques/T1082/",
              "description": "An adversary may attempt to get detailed information about the operating system and hardware, including version, patches, hotfixes, service packs, and architecture. Adversaries may use this information to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions. This behavior is distinct from Local Storage Discovery which is an adversary's discovery of local drive, disks and/or volumes.\nTools such as Systeminfo can be used to gather detailed system information. If running with privileged access, a breakdown of system data can be gathered through the systemsetup configuration tool on macOS. Adversaries may leverage a Network Device CLI on network devices to gather detailed system information (e.g. show version). On ESXi servers, threat actors may gather system information from various esxcli utilities, such as system hostname get and system version get.\nInfrastructure as a Service (IaaS) cloud providers such as AWS, GCP, and Azure allow access to instance and virtual machine information via APIs. Successful authenticated API calls can return data such as the operating system platform and status of a particular instance or the model view of a virtual machine.\nSystem Information Discovery combined with information gathered from other forms of discovery and reconnaissance can drive payload development and concealment. ",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Queries the cryptographic machine GUID",
                  "match_data": [
                    "HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Cryptography MachineGuid"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "Reads software policies",
                  "match_data": [
                    "HKEY_LOCAL_MACHINE\\Software\\Policies\\Microsoft\\Windows\\Safer\\CodeIdentifiers"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "Queries disk information (often used to detect virtual machines)",
                  "match_data": [
                    "PhysicalDrive0"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "Queries the volume information (name, serial number etc) of a device",
                  "match_data": [
                    "C:\\Users\\user\\Desktop\\Output.exe VolumeInformation",
                    "C:\\Users\\user\\Desktop\\afsfasfasfas.exe VolumeInformation",
                    "C:\\Users\\user\\Desktop\\as.exe VolumeInformation",
                    "C:\\Users\\user\\Desktop\\hahawh.exe VolumeInformation",
                    "C:\\Users\\user\\Desktop\\whwhwhwh.exe VolumeInformation",
                    "C:\\Users\\user\\Desktop\\XClient.exe VolumeInformation",
                    "C:\\Users\\user\\Desktop\\wwwsss.exe VolumeInformation",
                    "C:\\Windows\\System32\\CatRoot\\{F750E6C3-38EE-11D1-85E5-00C04FC295EE}\\Microsoft-Windows-Client-Features-WOW64-Package0011~31bf3856ad364e35~amd64~~10.0.22621.2428.cat VolumeInformation",
                    "C:\\Windows\\Microsoft.NET\\assembly\\GAC_64\\System.Data\\v4.0_4.0.0.0__b77a5c561934e089\\System.Data.dll VolumeInformation",
                    "C:\\Windows\\Microsoft.NET\\assembly\\GAC_64\\System.Transactions\\v4.0_4.0.0.0__b77a5c561934e089\\System.Transactions.dll VolumeInformation",
                    "C:\\Windows\\Microsoft.NET\\assembly\\GAC_MSIL\\System.Numerics\\v4.0_4.0.0.0__b77a5c561934e089\\System.Numerics.dll VolumeInformation",
                    "C:\\ VolumeInformation",
                    "C:\\ProgramData\\Microsoft\\Network\\Downloader\\edb.chk VolumeInformation",
                    "C:\\ProgramData\\Microsoft\\Network\\Downloader\\edb.log VolumeInformation",
                    "C:\\ProgramData\\Microsoft\\Network\\Downloader\\qmgr.db VolumeInformation",
                    "C:\\ProgramData\\Microsoft\\Network\\Downloader\\qmgr.jfm VolumeInformation"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "Checks the free space of harddrives",
                  "match_data": [
                    "C:\\ FullSizeInformation"
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0009",
          "name": "Collection",
          "link": "https://attack.mitre.org/tactics/TA0009/",
          "description": "The adversary is trying to gather data of interest to their goal.\n\nCollection consists of techniques adversaries may use to gather information and the sources information is collected from that are relevant to following through on the adversary's objectives. Frequently, the next goal after collecting data is to either steal (exfiltrate) the data or to use the data to gain more information about the target environment. Common target sources include various drive types, browsers, audio, video, and email. Common collection methods include capturing screenshots and keyboard input.",
          "techniques": [
            {
              "id": "T1560",
              "name": "Archive Collected Data",
              "link": "https://attack.mitre.org/techniques/T1560/",
              "description": "An adversary may compress and/or encrypt data that is collected prior to exfiltration. Compressing the data can help to obfuscate the collected data and minimize the amount of data sent over the network. Encryption can be used to hide information that is being exfiltrated from detection or make exfiltration less conspicuous upon inspection by a defender.\nBoth compression and encryption are done prior to exfiltration, and can be performed using a utility, 3rd party library, or custom method.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": ".NET source code contains calls to encryption/decryption functions",
                  "match_data": [
                    "'TransformFinalBlock'"
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0011",
          "name": "Command and Control",
          "link": "https://attack.mitre.org/tactics/TA0011/",
          "description": "The adversary is trying to communicate with compromised systems to control them.\n\nCommand and Control consists of techniques that adversaries may use to communicate with systems under their control within a victim network. Adversaries commonly attempt to mimic normal, expected traffic to avoid detection. There are many ways an adversary can establish command and control with various levels of stealth depending on the victim’s network structure and defenses.",
          "techniques": [
            {
              "id": "T1095",
              "name": "Non-Application Layer Protocol",
              "link": "https://attack.mitre.org/techniques/T1095/",
              "description": "Adversaries may use an OSI non-application layer protocol for communication between host and C2 server or among infected hosts within a network. The list of possible protocols is extensive. Specific examples include use of network layer protocols, such as the Internet Control Message Protocol (ICMP), transport layer protocols, such as the User Datagram Protocol (UDP), session layer protocols, such as Socket Secure (SOCKS), as well as redirected/tunneled protocols, such as Serial over LAN (SOL).\nICMP communication between hosts is one example. Because ICMP is part of the Internet Protocol Suite, it is required to be implemented by all IP-compatible hosts. However, it is not as commonly monitored as other Internet Protocols such as TCP or UDP and may be used by adversaries to hide communications.\nIn ESXi environments, adversaries may leverage the Virtual Machine Communication Interface (VMCI) for communication between guest virtual machines and the ESXi host. This traffic is similar to client-server communications on traditional network sockets but is localized to the physical machine running the ESXi host, meaning it does not traverse external networks (routers, switches). This results in communications that are invisible to external monitoring and standard networking tools like tcpdump, netstat, nmap, and Wireshark. By adding a VMCI backdoor to a compromised ESXi host, adversaries may persistently regain access from any guest VM to the compromised ESXi host’s backdoor, regardless of network segmentation or firewall rules in place.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Performs DNS lookups",
                  "match_data": [
                    "DNS query: www.msn.com",
                    "DNS query: api.msn.com"
                  ]
                }
              ]
            },
            {
              "id": "T1071",
              "name": "Application Layer Protocol",
              "link": "https://attack.mitre.org/techniques/T1071/",
              "description": "Adversaries may communicate using OSI application layer protocols to avoid detection/network filtering by blending in with existing traffic. Commands to the remote system, and often the results of those commands, will be embedded within the protocol traffic between the client and server. \nAdversaries may utilize many different protocols, including those used for web browsing, transferring files, electronic mail, DNS, or publishing/subscribing. For connections that occur internally within an enclave (such as those between a proxy or pivot node and other nodes), commonly used protocols are SMB, SSH, or RDP. ",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "C2 URLs / IPs found in malware configuration",
                  "match_data": [
                    "147.185.221.29"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "Performs DNS lookups",
                  "match_data": [
                    "DNS query: www.msn.com",
                    "DNS query: api.msn.com"
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  },
  "links": {
    "self": "https://www.virustotal.com/api/v3/files/84c876cae52d367197f6fb2dbbea95b84cbe6502f8189748fe85d16020e3af1e/behaviour_mitre_trees"
  }
}