{
  "data": {
    "CAPA": {
      "tactics": [
        {
          "id": "TA0005",
          "name": "Defense Evasion",
          "link": "https://attack.mitre.org/tactics/TA0005/",
          "description": "The adversary is trying to avoid being detected.\n\nDefense Evasion consists of techniques that adversaries use to avoid detection throughout their compromise. Techniques used for defense evasion include uninstalling/disabling security software or obfuscating/encrypting data and scripts. Adversaries also leverage and abuse trusted processes to hide and masquerade their malware. Other tactics’ techniques are cross-listed here when those techniques include the added benefit of subverting defenses. ",
          "techniques": [
            {
              "id": "T1620",
              "name": "Reflective Code Loading",
              "link": "https://attack.mitre.org/techniques/T1620/",
              "description": "Adversaries may reflectively load code into a process in order to conceal the execution of malicious payloads. Reflective loading involves allocating then executing payloads directly within the memory of the process, vice creating a thread or process backed by a file path on disk (e.g., Shared Modules).\nReflectively loaded payloads may be compiled binaries, anonymous files (only present in RAM), or just snubs of fileless executable code (ex: position-independent shellcode). For example, the Assembly.Load() method executed by PowerShell may be abused to load raw code into the running process.\nReflective code injection is very similar to Process Injection except that the “injection” loads code into the processes’ own memory instead of that of a separate process. Reflective loading may evade process-based detections since the execution of the arbitrary code may be masked within a legitimate or otherwise benign process. Reflectively loading payloads directly into memory may also avoid creating files or other artifacts on disk, while also enabling malware to keep these payloads encrypted (or otherwise obfuscated) until execution.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "invoke .NET assembly method",
                  "match_data": [
                    "api: System.Type::InvokeMember",
                    "api: System.Type::GetMethods"
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    "CAPE Sandbox": {
      "tactics": [
        {
          "id": "TA0006",
          "name": "Credential Access",
          "link": "https://attack.mitre.org/tactics/TA0006/",
          "description": "The adversary is trying to steal account names and passwords.\n\nCredential Access consists of techniques for stealing credentials like account names and passwords. Techniques used to get credentials include keylogging or credential dumping. Using legitimate credentials can give adversaries access to systems, make them harder to detect, and provide the opportunity to create more accounts to help achieve their goals.",
          "techniques": [
            {
              "id": "T1003",
              "name": "OS Credential Dumping",
              "link": "https://attack.mitre.org/techniques/T1003/",
              "description": "Adversaries may attempt to dump credentials to obtain account login and credential material, normally in the form of a hash or a clear text password. Credentials can be obtained from OS caches, memory, or structures. Credentials can then be used to perform Lateral Movement and access restricted information.\nSeveral of the tools mentioned in associated sub-techniques may be used by both adversaries and professional security testers. Additional custom tools likely exist as well.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Steals private information from local Internet browsers",
                  "match_data": [
                    "pid: 5252"
                  ]
                }
              ]
            },
            {
              "id": "T1555",
              "name": "Credentials from Password Stores",
              "link": "https://attack.mitre.org/techniques/T1555/",
              "description": "Adversaries may search for common password storage locations to obtain user credentials. Passwords are stored in several places on a system, depending on the operating system or application holding the credentials. There are also specific applications and services that store passwords to make them easier for users to manage and maintain, such as password managers and cloud secrets vaults. Once credentials are obtained, they can be used to perform lateral movement and access restricted information.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Steals private information from local Internet browsers",
                  "match_data": [
                    "pid: 5252"
                  ]
                }
              ]
            },
            {
              "id": "T1552",
              "name": "Unsecured Credentials",
              "link": "https://attack.mitre.org/techniques/T1552/",
              "description": "Adversaries may search compromised systems to find and obtain insecurely stored credentials. These credentials can be stored and/or misplaced in many locations on a system, including plaintext files (e.g. Shell History), operating system or application-specific repositories (e.g. Credentials in Registry),  or other specialized files/artifacts (e.g. Private Keys).",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Steals private information from local Internet browsers",
                  "match_data": [
                    "pid: 5252"
                  ]
                }
              ]
            },
            {
              "id": "T1555.003",
              "name": "Credentials from Web Browsers",
              "link": "https://attack.mitre.org/techniques/T1555/003/",
              "description": "Adversaries may acquire credentials from web browsers by reading files specific to the target browser. Web browsers commonly save credentials such as website usernames and passwords so that they do not need to be entered manually in the future. Web browsers typically store the credentials in an encrypted format within a credential store; however, methods exist to extract plaintext credentials from web browsers.\nFor example, on Windows systems, encrypted credentials may be obtained from Google Chrome by reading a database file, AppData\\Local\\Google\\Chrome\\User Data\\Default\\Login Data and executing a SQL query: SELECT action_url, username_value, password_value FROM logins;. The plaintext password can then be obtained by passing the encrypted credentials to the Windows API function CryptUnprotectData, which uses the victim’s cached logon credentials as the decryption key.\nAdversaries have executed similar procedures for common web browsers such as FireFox, Safari, Edge, etc. Windows stores Internet Explorer and Microsoft Edge credentials in Credential Lockers managed by the Windows Credential Manager.\nAdversaries may also acquire credentials by searching web browser process memory for patterns that commonly match credentials.\nAfter acquiring credentials from web browsers, adversaries may attempt to recycle the credentials across different systems and/or accounts in order to expand access. This can result in significantly furthering an adversary's objective in cases where credentials gained from web browsers overlap with privileged accounts (e.g. domain administrator).",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Steals private information from local Internet browsers",
                  "match_data": [
                    "pid: 5252"
                  ]
                }
              ]
            },
            {
              "id": "T1552.001",
              "name": "Credentials In Files",
              "link": "https://attack.mitre.org/techniques/T1552/001/",
              "description": "Adversaries may search local file systems and remote file shares for files containing insecurely stored credentials. These can be files created by users to store their own credentials, shared credential stores for a group of individuals, configuration files containing passwords for a system or service, or source code/binary files containing embedded passwords.\nIt is possible to extract passwords from backups or saved virtual machines through OS Credential Dumping. Passwords may also be obtained from Group Policy Preferences stored on the Windows Domain Controller.\nIn cloud and/or containerized environments, authenticated user and service account credentials are often stored in local configuration and credential files. They may also be found as parameters to deployment commands in container logs. In some cases, these files can be copied and reused on another machine or the contents can be read and then used to authenticate without needing to copy any files.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Steals private information from local Internet browsers",
                  "match_data": [
                    "pid: 5252"
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0005",
          "name": "Defense Evasion",
          "link": "https://attack.mitre.org/tactics/TA0005/",
          "description": "The adversary is trying to avoid being detected.\n\nDefense Evasion consists of techniques that adversaries use to avoid detection throughout their compromise. Techniques used for defense evasion include uninstalling/disabling security software or obfuscating/encrypting data and scripts. Adversaries also leverage and abuse trusted processes to hide and masquerade their malware. Other tactics’ techniques are cross-listed here when those techniques include the added benefit of subverting defenses. ",
          "techniques": [
            {
              "id": "T1564",
              "name": "Hide Artifacts",
              "link": "https://attack.mitre.org/techniques/T1564/",
              "description": "Adversaries may attempt to hide artifacts associated with their behaviors to evade detection. Operating systems may have features to hide various artifacts, such as important system files and administrative task execution, to avoid disrupting user work environments and prevent users from changing files or features on the system. Adversaries may abuse these features to hide artifacts such as files, directories, user accounts, or other system activity to evade detection.\nAdversaries may also attempt to hide artifacts associated with malicious behavior by creating computing regions that are isolated from common security instrumentation, such as through the use of virtualization technology.",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "A process created a hidden window",
                  "match_data": [
                    "systray.exe -> C:\\Windows\\SysWOW64\\cmd.exe",
                    "pid: 1428"
                  ]
                }
              ]
            },
            {
              "id": "T1202",
              "name": "Indirect Command Execution",
              "link": "https://attack.mitre.org/techniques/T1202/",
              "description": "Adversaries may abuse utilities that allow for command execution to bypass security restrictions that limit the use of command-line interpreters. Various Windows utilities may be used to execute commands, possibly without invoking cmd. For example, Forfiles, the Program Compatibility Assistant (pcalua.exe), components of the Windows Subsystem for Linux (WSL), Scriptrunner.exe, as well as other utilities may invoke the execution of programs and commands from a Command and Scripting Interpreter, Run window, or via scripts. Adversaries may also abuse the ssh.exe binary to execute malicious commands via the ProxyCommand and LocalCommand options, which can be invoked via the -o flag or by modifying the SSH config file.\nAdversaries may abuse these features for Defense Evasion, specifically to perform arbitrary execution while subverting detections and/or mitigation controls (such as Group Policy) that limit/prevent the usage of cmd or file extensions more commonly associated with malicious payloads.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Uses suspicious command line tools or Windows utilities",
                  "match_data": [
                    "/c del \"C:\\Users\\Bruno\\Desktop\\software.exe\"",
                    "C:\\Windows\\SysWOW64\\cmd.exe /c del \"C:\\Users\\Bruno\\Desktop\\software.exe\""
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "Uses Windows utilities for basic functionality",
                  "match_data": [
                    "C:\\Windows\\SysWOW64\\cmd.exe /c del \"C:\\Users\\Bruno\\Desktop\\software.exe\""
                  ]
                }
              ]
            },
            {
              "id": "T1036",
              "name": "Masquerading",
              "link": "https://attack.mitre.org/techniques/T1036/",
              "description": "Adversaries may attempt to manipulate features of their artifacts to make them appear legitimate or benign to users and/or security tools. Masquerading occurs when the name or location of an object, legitimate or malicious, is manipulated or abused for the sake of evading defenses and observation. This may include manipulating file metadata, tricking users into misidentifying the file type, and giving legitimate task or service names.\nRenaming abusable system utilities to evade security monitoring is also a form of Masquerading.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "A file was accessed within the Public folder.",
                  "match_data": [
                    "C:\\Users\\Public\\Desktop\\desktop.ini",
                    "C:\\Users\\Public\\Desktop"
                  ]
                }
              ]
            },
            {
              "id": "T1055",
              "name": "Process Injection",
              "link": "https://attack.mitre.org/techniques/T1055/",
              "description": "Adversaries may inject code into processes in order to evade process-based defenses as well as possibly elevate privileges. Process injection is a method of executing arbitrary code in the address space of a separate live process. Running code in the context of another process may allow access to the process's memory, system/network resources, and possibly elevated privileges. Execution via process injection may also evade detection from security products since the execution is masked under a legitimate process. \nThere are many different ways to inject code into a process, many of which abuse legitimate functionalities. These implementations exist for every major OS but are typically platform specific. \nMore sophisticated samples may perform multiple process injections to segment modules and further evade detection, utilizing named pipes or other inter-process communication (IPC) mechanisms as a communication channel. ",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Resumed a thread in another process",
                  "match_data": [
                    "Process explorer.exe with process ID 5252 resumed a thread in another process with the process ID 5252",
                    "pid: 5252",
                    "Process svchost.exe with process ID 3716 resumed a thread in another process with the process ID 3716",
                    "pid: 3716",
                    "Process svchost.exe with process ID 5296 resumed a thread in another process with the process ID 5296"
                  ]
                }
              ]
            },
            {
              "id": "T1548",
              "name": "Abuse Elevation Control Mechanism",
              "link": "https://attack.mitre.org/techniques/T1548/",
              "description": "Adversaries may circumvent mechanisms designed to control elevate privileges to gain higher-level permissions. Most modern systems contain native elevation control mechanisms that are intended to limit privileges that a user can perform on a machine. Authorization has to be granted to specific users in order to perform tasks that can be considered of higher risk. An adversary can perform several methods to take advantage of built-in control mechanisms in order to escalate privileges on a system.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "A file was accessed within the Public folder.",
                  "match_data": [
                    "C:\\Users\\Public\\Desktop\\desktop.ini",
                    "C:\\Users\\Public\\Desktop"
                  ]
                }
              ]
            },
            {
              "id": "T1070",
              "name": "Indicator Removal",
              "link": "https://attack.mitre.org/techniques/T1070/",
              "description": "Adversaries may delete or modify artifacts generated within systems to remove evidence of their presence or hinder defenses. Various artifacts may be created by an adversary or something that can be attributed to an adversary’s actions. Typically these artifacts are used as defensive indicators related to monitored events, such as strings from downloaded files, logs that are generated from user actions, and other data analyzed by defenders. Location, format, and type of artifact (such as command or login history) are often specific to each platform.\nRemoval of these indicators may interfere with event collection, reporting, or other processes used to detect intrusion activity. This may compromise the integrity of security solutions by causing notable events to go unreported. This activity may also impede forensic analysis and incident response, due to lack of sufficient data to determine what occurred.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Deletes executed files from disk",
                  "match_data": [
                    "C:\\Users\\Bruno\\Desktop\\software.exe"
                  ]
                }
              ]
            },
            {
              "id": "T1497",
              "name": "Virtualization/Sandbox Evasion",
              "link": "https://attack.mitre.org/techniques/T1497/",
              "description": "Adversaries may employ various means to detect and avoid virtualization and analysis environments. This may include changing behaviors based on the results of checks for the presence of artifacts indicative of a virtual machine environment (VME) or sandbox. If the adversary detects a VME, they may alter their malware to disengage from the victim or conceal the core functions of the implant. They may also search for VME artifacts before dropping secondary or additional payloads. Adversaries may use the information learned from Virtualization/Sandbox Evasion during automated discovery to shape follow-on behaviors.\nAdversaries may use several methods to accomplish Virtualization/Sandbox Evasion such as checking for security monitoring tools (e.g., Sysinternals, Wireshark, etc.) or other system artifacts associated with analysis or virtualization. Adversaries may also check for legitimate user activity to help determine if it is in an analysis environment. Additional methods include use of sleep timers or loops within malware code to avoid operating within a temporary sandbox.",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Checks for mouse movement",
                  "match_data": [
                    "pid: 5252"
                  ]
                },
                {
                  "severity": "MEDIUM",
                  "description": "Checks the system manufacturer, likely for anti-virtualization"
                }
              ]
            },
            {
              "id": "T1027",
              "name": "Obfuscated Files or Information",
              "link": "https://attack.mitre.org/techniques/T1027/",
              "description": "Adversaries may attempt to make an executable or file difficult to discover or analyze by encrypting, encoding, or otherwise obfuscating its contents on the system or in transit. This is common behavior that can be used across different platforms and the network to evade defenses. \nPayloads may be compressed, archived, or encrypted in order to avoid detection. These payloads may be used during Initial Access or later to mitigate detection. Sometimes a user's action may be required to open and Deobfuscate/Decode Files or Information for User Execution. The user may also be required to input a password to open a password protected compressed/encrypted file that was provided by the adversary.  Adversaries may also use compressed or archived scripts, such as JavaScript. \nPortions of files can also be encoded to hide the plain-text strings that would otherwise help defenders with discovery.  Payloads may also be split into separate, seemingly benign files that only reveal malicious functionality when reassembled. \nAdversaries may also abuse Command Obfuscation to obscure commands executed from payloads or directly via Command and Scripting Interpreter. Environment variables, aliases, characters, and other platform/language specific semantics can be used to evade signature based detections and application control mechanisms.   ",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "The binary likely contains encrypted or compressed data",
                  "match_data": [
                    ".text",
                    ".rsrc"
                  ]
                }
              ]
            },
            {
              "id": "T1564.003",
              "name": "Hidden Window",
              "link": "https://attack.mitre.org/techniques/T1564/003/",
              "description": "Adversaries may use hidden windows to conceal malicious activity from the plain sight of users. In some cases, windows that would typically be displayed when an application carries out an operation can be hidden. This may be utilized by system administrators to avoid disrupting user work environments when carrying out administrative tasks. \nAdversaries may abuse these functionalities to hide otherwise visible windows from users so as not to alert the user to adversary activity on the system.\nOn macOS, the configurations for how applications run are listed in property list (plist) files. One of the tags in these files can be apple.awt.UIElement, which allows for Java applications to prevent the application's icon from appearing in the Dock. A common use for this is when applications run in the system tray, but don't also want to show up in the Dock.\nSimilarly, on Windows there are a variety of features in scripting languages, such as PowerShell, Jscript, and Visual Basic to make windows hidden. One example of this is powershell.exe -WindowStyle Hidden.\nThe Windows Registry can also be edited to hide application windows from the current user. For example, by setting the WindowPosition subkey in the HKEY_CURRENT_USER\\Console\\%SystemRoot%_System32_WindowsPowerShell_v1.0_PowerShell.exe Registry key to a maximum value, PowerShell windows will open off screen and be hidden.\nIn addition, Windows supports the CreateDesktop() API that can create a hidden desktop window with its own corresponding explorer.exe process.  All applications running on the hidden desktop window, such as a hidden VNC (hVNC) session, will be invisible to other desktops windows.\nAdversaries may also leverage cmd.exe as a parent process, and then utilize a LOLBin, such as DeviceCredentialDeployment.exe, to hide windows.",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "A process created a hidden window",
                  "match_data": [
                    "systray.exe -> C:\\Windows\\SysWOW64\\cmd.exe",
                    "pid: 1428"
                  ]
                }
              ]
            },
            {
              "id": "T1027.002",
              "name": "Software Packing",
              "link": "https://attack.mitre.org/techniques/T1027/002/",
              "description": "Adversaries may perform software packing or virtual machine software protection to conceal their code. Software packing is a method of compressing or encrypting an executable. Packing an executable changes the file signature in an attempt to avoid signature-based detection. Most decompression techniques decompress the executable code in memory. Virtual machine software protection translates an executable's original code into a special format that only a special virtual machine can run. A virtual machine is then called to run this code. \nUtilities used to perform software packing are called packers. Example packers are MPRESS and UPX. A more comprehensive list of known packers is available, but adversaries may create their own packing techniques that do not leave the same artifacts as well-known packers to evade defenses.  ",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "The binary likely contains encrypted or compressed data",
                  "match_data": [
                    ".text",
                    ".rsrc"
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0004",
          "name": "Privilege Escalation",
          "link": "https://attack.mitre.org/tactics/TA0004/",
          "description": "The adversary is trying to gain higher-level permissions.\n\nPrivilege Escalation consists of techniques that adversaries use to gain higher-level permissions on a system or network. Adversaries can often enter and explore a network with unprivileged access but require elevated permissions to follow through on their objectives. Common approaches are to take advantage of system weaknesses, misconfigurations, and vulnerabilities. Examples of elevated access include: \n\n* SYSTEM/root level\n* local administrator\n* user account with admin-like access \n* user accounts with access to specific system or perform specific function\n\nThese techniques often overlap with Persistence techniques, as OS features that let an adversary persist can execute in an elevated context.  ",
          "techniques": [
            {
              "id": "T1055",
              "name": "Process Injection",
              "link": "https://attack.mitre.org/techniques/T1055/",
              "description": "Adversaries may inject code into processes in order to evade process-based defenses as well as possibly elevate privileges. Process injection is a method of executing arbitrary code in the address space of a separate live process. Running code in the context of another process may allow access to the process's memory, system/network resources, and possibly elevated privileges. Execution via process injection may also evade detection from security products since the execution is masked under a legitimate process. \nThere are many different ways to inject code into a process, many of which abuse legitimate functionalities. These implementations exist for every major OS but are typically platform specific. \nMore sophisticated samples may perform multiple process injections to segment modules and further evade detection, utilizing named pipes or other inter-process communication (IPC) mechanisms as a communication channel. ",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Resumed a thread in another process",
                  "match_data": [
                    "Process explorer.exe with process ID 5252 resumed a thread in another process with the process ID 5252",
                    "pid: 5252",
                    "Process svchost.exe with process ID 3716 resumed a thread in another process with the process ID 3716",
                    "pid: 3716",
                    "Process svchost.exe with process ID 5296 resumed a thread in another process with the process ID 5296"
                  ]
                }
              ]
            },
            {
              "id": "T1548",
              "name": "Abuse Elevation Control Mechanism",
              "link": "https://attack.mitre.org/techniques/T1548/",
              "description": "Adversaries may circumvent mechanisms designed to control elevate privileges to gain higher-level permissions. Most modern systems contain native elevation control mechanisms that are intended to limit privileges that a user can perform on a machine. Authorization has to be granted to specific users in order to perform tasks that can be considered of higher risk. An adversary can perform several methods to take advantage of built-in control mechanisms in order to escalate privileges on a system.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "A file was accessed within the Public folder.",
                  "match_data": [
                    "C:\\Users\\Public\\Desktop\\desktop.ini",
                    "C:\\Users\\Public\\Desktop"
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0007",
          "name": "Discovery",
          "link": "https://attack.mitre.org/tactics/TA0007/",
          "description": "The adversary is trying to figure out your environment.\n\nDiscovery consists of techniques an adversary may use to gain knowledge about the system and internal network. These techniques help adversaries observe the environment and orient themselves before deciding how to act. They also allow adversaries to explore what they can control and what’s around their entry point in order to discover how it could benefit their current objective. Native operating system tools are often used toward this post-compromise information-gathering objective. ",
          "techniques": [
            {
              "id": "T1497",
              "name": "Virtualization/Sandbox Evasion",
              "link": "https://attack.mitre.org/techniques/T1497/",
              "description": "Adversaries may employ various means to detect and avoid virtualization and analysis environments. This may include changing behaviors based on the results of checks for the presence of artifacts indicative of a virtual machine environment (VME) or sandbox. If the adversary detects a VME, they may alter their malware to disengage from the victim or conceal the core functions of the implant. They may also search for VME artifacts before dropping secondary or additional payloads. Adversaries may use the information learned from Virtualization/Sandbox Evasion during automated discovery to shape follow-on behaviors.\nAdversaries may use several methods to accomplish Virtualization/Sandbox Evasion such as checking for security monitoring tools (e.g., Sysinternals, Wireshark, etc.) or other system artifacts associated with analysis or virtualization. Adversaries may also check for legitimate user activity to help determine if it is in an analysis environment. Additional methods include use of sleep timers or loops within malware code to avoid operating within a temporary sandbox.",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Checks for mouse movement",
                  "match_data": [
                    "pid: 5252"
                  ]
                },
                {
                  "severity": "MEDIUM",
                  "description": "Checks the system manufacturer, likely for anti-virtualization"
                }
              ]
            },
            {
              "id": "T1082",
              "name": "System Information Discovery",
              "link": "https://attack.mitre.org/techniques/T1082/",
              "description": "An adversary may attempt to get detailed information about the operating system and hardware, including version, patches, hotfixes, service packs, and architecture. Adversaries may use this information to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions. This behavior is distinct from Local Storage Discovery which is an adversary's discovery of local drive, disks and/or volumes.\nTools such as Systeminfo can be used to gather detailed system information. If running with privileged access, a breakdown of system data can be gathered through the systemsetup configuration tool on macOS. Adversaries may leverage a Network Device CLI on network devices to gather detailed system information (e.g. show version). On ESXi servers, threat actors may gather system information from various esxcli utilities, such as system hostname get and system version get.\nInfrastructure as a Service (IaaS) cloud providers such as AWS, GCP, and Azure allow access to instance and virtual machine information via APIs. Successful authenticated API calls can return data such as the operating system platform and status of a particular instance or the model view of a virtual machine.\nSystem Information Discovery combined with information gathered from other forms of discovery and reconnaissance can drive payload development and concealment. ",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Checks available memory",
                  "match_data": [
                    "pid: 3644"
                  ]
                },
                {
                  "severity": "MEDIUM",
                  "description": "Checks the system manufacturer, likely for anti-virtualization"
                }
              ]
            },
            {
              "id": "T1057",
              "name": "Process Discovery",
              "link": "https://attack.mitre.org/techniques/T1057/",
              "description": "Adversaries may attempt to get information about running processes on a system. Information obtained could be used to gain an understanding of common software/applications running on systems within the network. Administrator or otherwise elevated access may provide better process details. Adversaries may use the information from Process Discovery during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\nIn Windows environments, adversaries could obtain details on running processes using the Tasklist utility via cmd or Get-Process via PowerShell. Information about processes can also be extracted from the output of Native API calls such as CreateToolhelp32Snapshot. In Mac and Linux, this is accomplished with the ps command. Adversaries may also opt to enumerate processes via /proc. ESXi also supports use of the ps command, as well as esxcli system process list.\nOn network devices, Network Device CLI commands such as show processes can be used to display current running processes.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Checks the system manufacturer, likely for anti-virtualization"
                }
              ]
            },
            {
              "id": "T1012",
              "name": "Query Registry",
              "link": "https://attack.mitre.org/techniques/T1012/",
              "description": "Adversaries may interact with the Windows Registry to gather information about the system, configuration, and installed software.\nThe Registry contains a significant amount of information about the operating system, configuration, software, and security. Information can easily be queried using the Reg utility, though other means to access the Registry exist. Some of the information may help adversaries to further their operation within a network. Adversaries may use the information from Query Registry during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Checks the system manufacturer, likely for anti-virtualization"
                }
              ]
            }
          ]
        },
        {
          "id": "TA0011",
          "name": "Command and Control",
          "link": "https://attack.mitre.org/tactics/TA0011/",
          "description": "The adversary is trying to communicate with compromised systems to control them.\n\nCommand and Control consists of techniques that adversaries may use to communicate with systems under their control within a victim network. Adversaries commonly attempt to mimic normal, expected traffic to avoid detection. There are many ways an adversary can establish command and control with various levels of stealth depending on the victim’s network structure and defenses.",
          "techniques": [
            {
              "id": "T1071",
              "name": "Application Layer Protocol",
              "link": "https://attack.mitre.org/techniques/T1071/",
              "description": "Adversaries may communicate using OSI application layer protocols to avoid detection/network filtering by blending in with existing traffic. Commands to the remote system, and often the results of those commands, will be embedded within the protocol traffic between the client and server. \nAdversaries may utilize many different protocols, including those used for web browsing, transferring files, electronic mail, DNS, or publishing/subscribing. For connections that occur internally within an enclave (such as those between a proxy or pivot node and other nodes), commonly used protocols are SMB, SSH, or RDP. ",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Performs some HTTP requests",
                  "match_data": [
                    "http://ocsp.digicert.com/MFEwTzBNMEswSTAJBgUrDgMCGgUABBQ50otx%2Fh0Ztl%2Bz8SiPI7wEWVxDlQQUTiJUIBiV5uNu5g%2F6%2BrkS7QYXjzkCEApDqVCbATUviZV57HIIulA%3D",
                    "http://x1.c.lencr.org/"
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "Resolves a suspicious Top Level Domain (TLD)",
                  "match_data": [
                    "www.ucnso.top"
                  ]
                },
                {
                  "severity": "MEDIUM",
                  "description": "Yara detections observed in process dumps, payloads or dropped files",
                  "match_data": [
                    "PID 5396 triggered the Yara rule 'shellcode_stack_strings' with data '['{ C7 45 D4 5C 00 65 00 C7 45 D8 78 00 70 00 C7 45 DC 6C 00 6F 00 C7 45 E0 72 00 65 00 C7 45 E4 72 00 2E 00 C7 45 E8 65 00 78 00 C7 45 EC 65 00 00 00 }', '{ C7 45 D8 78 00 70 00 C7 45 DC 6C 00 6F 00 C7 45 E0 72 00 65 00 C7 45 E4 72 00 2E 00 C7 45 E8 65 00 78 00 C7 45 EC 65 00 00 00 }', '{ C7 45 DC 6C 00 6F 00 C7 45 E0 72 00 65 00 C7 45 E4 72 00 2E 00 C7 45 E8 65 00 78 00 C7 45 EC 65 00 00 00 }', '{ C7 45 E0 72 00 65 00 C7 45 E4 72 00 2E 00 C7 45 E8 65 00 78 00 C7 45 EC 65 00 00 00 }', '{ C7 45 E4 72 00 2E 00 C7 45 E8 65 00 78 00 C7 45 EC 65 00 00 00 }', '{ C7 45 D0 2E 00 73 00 C7 45 D4 71 00 6C 00 C7 45 D8 69 00 74 00 C7 45 DC 65 00 00 00 }', '{ C7 45 D4 71 00 6C 00 C7 45 D8 69 00 74 00 C7 45 DC 65 00 00 00 }', '{ C7 45 C0 43 00 6C 00 C7 45 C4 69 00 70 00 C7 45 C8 62 00 6F 00 C7 45 CC 61 00 72 00 C7 45 D0 64 00 00 00 }', '{ C7 45 C4 69 00 70 00 C7 45 C8 62 00 6F 00 C7 45 CC 61 00 72 00 C7 45 D0 64 00 00 00 }', '{ C7 45 C8 62 00 6F 00 C7 45 CC 61 00 72 00 C7 45 D0 64 00 00 00 }', '{ C7 45 E0 55 00 6E 00 C7 45 E4 6B 00 6E 00 C7 45 E8 6F 00 77 00 C7 45 EC 6E 00 00 00 }', '{ C7 45 E4 6B 00 6E 00 C7 45 E8 6F 00 77 00 C7 45 EC 6E 00 00 00 }', '{ C7 45 E0 6C 00 6F 00 C7 45 E4 67 00 2E 00 C7 45 E8 69 00 6E 00 C7 45 EC 69 00 00 00 }', '{ C7 45 E4 67 00 2E 00 C7 45 E8 69 00 6E 00 C7 45 EC 69 00 00 00 }', '{ C7 45 F0 62 00 72 00 C7 45 F4 6F 00 77 00 C7 45 F8 73 00 65 00 C7 45 FC 72 00 00 00 }', '{ C7 45 F4 6F 00 77 00 C7 45 F8 73 00 65 00 C7 45 FC 72 00 00 00 }', '{ C7 45 F0 5B 00 45 00 C7 45 F4 73 00 63 00 C7 45 F8 5D 00 00 00 }', '{ C7 45 E4 5B 00 41 00 C7 45 E8 6C 00 74 00 C7 45 EC 5D 00 00 00 }', '{ C7 45 D8 5B 00 54 00 C7 45 DC 61 00 62 00 C7 45 E0 5D 00 00 00 }', '{ C7 45 B8 5B 00 45 00 C7 45 BC 6E 00 74 00 C7 45 C0 65 00 72 00 C7 45 C4 5D 00 00 00 }', '{ C7 45 BC 6E 00 74 00 C7 45 C0 65 00 72 00 C7 45 C4 5D 00 00 00 }', '{ C7 45 C8 5B 00 3C 00 C7 45 CC 2D 00 44 00 C7 45 D0 65 00 6C 00 C7 45 D4 5D 00 00 00 }', '{ C7 45 CC 2D 00 44 00 C7 45 D0 65 00 6C 00 C7 45 D4 5D 00 00 00 }', '{ C7 45 D0 69 00 6D 00 C7 45 D4 2E 00 6A 00 C7 45 D8 70 00 65 00 C7 45 DC 67 00 00 00 }', '{ C7 45 D4 2E 00 6A 00 C7 45 D8 70 00 65 00 C7 45 DC 67 00 00 00 }', '{ C7 45 F0 55 00 6E 00 C7 45 F4 6B 00 6E 00 C7 45 F8 6F 00 77 00 C7 45 FC 6E 00 00 00 }', '{ C7 45 F4 6B 00 6E 00 C7 45 F8 6F 00 77 00 C7 45 FC 6E 00 00 00 }', '{ C7 45 C0 50 00 72 00 C7 45 C4 6F 00 67 00 C7 45 C8 72 00 61 00 C7 45 CC 6D 00 20 00 C7 45 D0 46 00 69 00 C7 45 D4 6C 00 65 00 C7 45 D8 73 00 00 00 }', '{ C7 45 C4 6F 00 67 00 C7 45 C8 72 00 61 00 C7 45 CC 6D 00 20 00 C7 45 D0 46 00 69 00 C7 45 D4 6C 00 65 00 C7 45 D8 73 00 00 00 }', '{ C7 45 C8 72 00 61 00 C7 45 CC 6D 00 20 00 C7 45 D0 46 00 69 00 C7 45 D4 6C 00 65 00 C7 45 D8 73 00 00 00 }', '{ C7 45 CC 6D 00 20 00 C7 45 D0 46 00 69 00 C7 45 D4 6C 00 65 00 C7 45 D8 73 00 00 00 }', '{ C7 45 D0 46 00 69 00 C7 45 D4 6C 00 65 00 C7 45 D8 73 00 00 00 }', '{ C7 45 E8 5C 00 4D 00 C7 45 EC 61 00 69 00 C7 45 F0 6E 00 00 00 }', '{ C7 45 88 55 00 72 00 C7 45 8C 6C 00 3A 00 C7 45 90 09 00 00 00 }', '{ C7 45 80 72 00 6E 00 C7 45 84 65 00 74 00 C7 45 88 20 00 45 00 C7 45 8C 78 00 70 00 C7 45 90 6C 00 6F 00 C7 45 94 72 00 65 00 C7 45 98 72 00 5C 00 C7 45 9C 49 00 6E 00 C7 45 A0 74 00 65 00 C7 45 A4 6C 00 6C 00 C7 45 A8 69 00 46 00 C7 45 AC 6F 00 72 00 C7 45 B0 6D 00 73 00 C7 45 B4 5C 00 53 00 C7 45 B8 74 00 6F 00 C7 45 BC 72 00 61 00 C7 45 C0 67 00 65 00 C7 45 C4 32 00 00 00 }', '{ C7 45 84 65 00 74 00 C7 45 88 20 00 45 00 C7 45 8C 78 00 70 00 C7 45 90 6C 00 6F 00 C7 45 94 72 00 65 00 C7 45 98 72 00 5C 00 C7 45 9C 49 00 6E 00 C7 45 A0 74 00 65 00 C7 45 A4 6C 00 6C 00 C7 45 A8 69 00 46 00 C7 45 AC 6F 00 72 00 C7 45 B0 6D 00 73 00 C7 45 B4 5C 00 53 00 C7 45 B8 74 00 6F 00 C7 45 BC 72 00 61 00 C7 45 C0 67 00 65 00 C7 45 C4 32 00 00 00 }', '{ C7 45 88 20 00 45 00 C7 45 8C 78 00 70 00 C7 45 90 6C 00 6F 00 C7 45 94 72 00 65 00 C7 45 98 72 00 5C 00 C7 45 9C 49 00 6E 00 C7 45 A0 74 00 65 00 C7 45 A4 6C 00 6C 00 C7 45 A8 69 00 46 00 C7 45 AC 6F 00 72 00 C7 45 B0 6D 00 73 00 C7 45 B4 5C 00 53 00 C7 45 B8 74 00 6F 00 C7 45 BC 72 00 61 00 C7 45 C0 67 00 65 00 C7 45 C4 32 00 00 00 }', '{ C7 45 8C 78 00 70 00 C7 45 90 6C 00 6F 00 C7 45 94 72 00 65 00 C7 45 98 72 00 5C 00 C7 45 9C 49 00 6E 00 C7 45 A0 74 00 65 00 C7 45 A4 6C 00 6C 00 C7 45 A8 69 00 46 00 C7 45 AC 6F 00 72 00 C7 45 B0 6D 00 73 00 C7 45 B4 5C 00 53 00 C7 45 B8 74 00 6F 00 C7 45 BC 72 00 61 00 C7 45 C0 67 00 65 00 C7 45 C4 32 00 00 00 }', '{ C7 45 90 6C 00 6F 00 C7 45 94 72 00 65 00 C7 45 98 72 00 5C 00 C7 45 9C 49 00 6E 00 C7 45 A0 74 00 65 00 C7 45 A4 6C 00 6C 00 C7 45 A8 69 00 46 00 C7 45 AC 6F 00 72 00 C7 45 B0 6D 00 73 00 C7 45 B4 5C 00 53 00 C7 45 B8 74 00 6F 00 C7 45 BC 72 00 61 00 C7 45 C0 67 00 65 00 C7 45 C4 32 00 00 00 }', '{ C7 45 94 72 00 65 00 C7 45 98 72 00 5C 00 C7 45 9C 49 00 6E 00 C7 45 A0 74 00 65 00 C7 45 A4 6C 00 6C 00 C7 45 A8 69 00 46 00 C7 45 AC 6F 00 72 00 C7 45 B0 6D 00 73 00 C7 45 B4 5C 00 53 00 C7 45 B8 74 00 6F 00 C7 45 BC 72 00 61 00 C7 45 C0 67 00 65 00 C7 45 C4 32 00 00 00 }', '{ C7 45 98 72 00 5C 00 C7 45 9C 49 00 6E 00 C7 45 A0 74 00 65 00 C7 45 A4 6C 00 6C 00 C7 45 A8 69 00 46 00 C7 45 AC 6F 00 72 00 C7 45 B0 6D 00 73 00 C7 45 B4 5C 00 53 00 C7 45 B8 74 00 6F 00 C7 45 BC 72 00 61 00 C7 45 C0 67 00 65 00 C7 45 C4 32 00 00 00 }', '{ C7 45 9C 49 00 6E 00 C7 45 A0 74 00 65 00 C7 45 A4 6C 00 6C 00 C7 45 A8 69 00 46 00 C7 45 AC 6F 00 72 00 C7 45 B0 6D 00 73 00 C7 45 B4 5C 00 53 00 C7 45 B8 74 00 6F 00 C7 45 BC 72 00 61 00 C7 45 C0 67 00 65 00 C7 45 C4 32 00 00 00 }', '{ C7 45 A0 74 00 65 00 C7 45 A4 6C 00 6C 00 C7 45 A8 69 00 46 00 C7 45 AC 6F 00 72 00 C7 45 B0 6D 00 73 00 C7 45 B4 5C 00 53 00 C7 45 B8 74 00 6F 00 C7 45 BC 72 00 61 00 C7 45 C0 67 00 65 00 C7 45 C4 32 00 00 00 }', '{ C7 45 A4 6C 00 6C 00 C7 45 A8 69 00 46 00 C7 45 AC 6F 00 72 00 C7 45 B0 6D 00 73 00 C7 45 B4 5C 00 53 00 C7 45 B8 74 00 6F 00 C7 45 BC 72 00 61 00 C7 45 C0 67 00 65 00 C7 45 C4 32 00 00 00 }', '{ C7 45 A8 69 00 46 00 C7 45 AC 6F 00 72 00 C7 45 B0 6D 00 73 00 C7 45 B4 5C 00 53 00 C7 45 B8 74 00 6F 00 C7 45 BC 72 00 61 00 C7 45 C0 67 00 65 00 C7 45 C4 32 00 00 00 }', '{ C7 45 AC 6F 00 72 00 C7 45 B0 6D 00 73 00 C7 45 B4 5C 00 53 00 C7 45 B8 74 00 6F 00 C7 45 BC 72 00 61 00 C7 45 C0 67 00 65 00 C7 45 C4 32 00 00 00 }', '{ C7 45 B0 6D 00 73 00 C7 45 B4 5C 00 53 00 C7 45 B8 74 00 6F 00 C7 45 BC 72 00 61 00 C7 45 C0 67 00 65 00 C7 45 C4 32 00 00 00 }', '{ C7 45 B4 5C 00 53 00 C7 45 B8 74 00 6F 00 C7 45 BC 72 00 61 00 C7 45 C0 67 00 65 00 C7 45 C4 32 00 00 00 }', '{ C7 45 B8 74 00 6F 00 C7 45 BC 72 00 61 00 C7 45 C0 67 00 65 00 C7 45 C4 32 00 00 00 }', '{ C7 45 BC 72 00 61 00 C7 45 C0 67 00 65 00 C7 45 C4 32 00 00 00 }', '{ C7 45 80 5C 00 4F 00 C7 45 84 70 00 65 00 C7 45 88 72 00 61 00 C7 45 8C 20 00 53 00 C7 45 90 6F 00 66 00 C7 45 94 74 00 77 00 C7 45 98 61 00 72 00 C7 45 9C 65 00 5C 00 C7 45 A0 4F 00 70 00 C7 45 A4 65 00 72 00 C7 45 A8 61 00 20 00 C7 45 AC 53 00 74 00 C7 45 B0 61 00 62 00 C7 45 B4 6C 00 65 00 C7 45 B8 5C 00 4C 00 C7 45 BC 6F 00 67 00 C7 45 C0 69 00 6E 00 C7 45 C4 20 00 44 00 C7 45 C8 61 00 74 00 C7 45 CC 61 00 00 00 }', '{ C7 45 84 70 00 65 00 C7 45 88 72 00 61 00 C7 45 8C 20 00 53 00 C7 45 90 6F 00 66 00 C7 45 94 74 00 77 00 C7 45 98 61 00 72 00 C7 45 9C 65 00 5C 00 C7 45 A0 4F 00 70 00 C7 45 A4 65 00 72 00 C7 45 A8 61 00 20 00 C7 45 AC 53 00 74 00 C7 45 B0 61 00 62 00 C7 45 B4 6C 00 65 00 C7 45 B8 5C 00 4C 00 C7 45 BC 6F 00 67 00 C7 45 C0 69 00 6E 00 C7 45 C4 20 00 44 00 C7 45 C8 61 00 74 00 C7 45 CC 61 00 00 00 }', '{ C7 45 88 72 00 61 00 C7 45 8C 20 00 53 00 C7 45 90 6F 00 66 00 C7 45 94 74 00 77 00 C7 45 98 61 00 72 00 C7 45 9C 65 00 5C 00 C7 45 A0 4F 00 70 00 C7 45 A4 65 00 72 00 C7 45 A8 61 00 20 00 C7 45 AC 53 00 74 00 C7 45 B0 61 00 62 00 C7 45 B4 6C 00 65 00 C7 45 B8 5C 00 4C 00 C7 45 BC 6F 00 67 00 C7 45 C0 69 00 6E 00 C7 45 C4 20 00 44 00 C7 45 C8 61 00 74 00 C7 45 CC 61 00 00 00 }', '{ C7 45 8C 20 00 53 00 C7 45 90 6F 00 66 00 C7 45 94 74 00 77 00 C7 45 98 61 00 72 00 C7 45 9C 65 00 5C 00 C7 45 A0 4F 00 70 00 C7 45 A4 65 00 72 00 C7 45 A8 61 00 20 00 C7 45 AC 53 00 74 00 C7 45 B0 61 00 62 00 C7 45 B4 6C 00 65 00 C7 45 B8 5C 00 4C 00 C7 45 BC 6F 00 67 00 C7 45 C0 69 00 6E 00 C7 45 C4 20 00 44 00 C7 45 C8 61 00 74 00 C7 45 CC 61 00 00 00 }', '{ C7 45 90 6F 00 66 00 C7 45 94 74 00 77 00 C7 45 98 61 00 72 00 C7 45 9C 65 00 5C 00 C7 45 A0 4F 00 70 00 C7 45 A4 65 00 72 00 C7 45 A8 61 00 20 00 C7 45 AC 53 00 74 00 C7 45 B0 61 00 62 00 C7 45 B4 6C 00 65 00 C7 45 B8 5C 00 4C 00 C7 45 BC 6F 00 67 00 C7 45 C0 69 00 6E 00 C7 45 C4 20 00 44 00 C7 45 C8 61 00 74 00 C7 45 CC 61 00 00 00 }', '{ C7 45 94 74 00 77 00 C7 45 98 61 00 72 00 C7 45 9C 65 00 5C 00 C7 45 A0 4F 00 70 00 C7 45 A4 65 00 72 00 C7 45 A8 61 00 20 00 C7 45 AC 53 00 74 00 C7 45 B0 61 00 62 00 C7 45 B4 6C 00 65 00 C7 45 B8 5C 00 4C 00 C7 45 BC 6F 00 67 00 C7 45 C0 69 00 6E 00 C7 45 C4 20 00 44 00 C7 45 C8 61 00 74 00 C7 45 CC 61 00 00 00 }', '{ C7 45 98 61 00 72 00 C7 45 9C 65 00 5C 00 C7 45 A0 4F 00 70 00 C7 45 A4 65 00 72 00 C7 45 A8 61 00 20 00 C7 45 AC 53 00 74 00 C7 45 B0 61 00 62 00 C7 45 B4 6C 00 65 00 C7 45 B8 5C 00 4C 00 C7 45 BC 6F 00 67 00 C7 45 C0 69 00 6E 00 C7 45 C4 20 00 44 00 C7 45 C8 61 00 74 00 C7 45 CC 61 00 00 00 }', '{ C7 45 9C 65 00 5C 00 C7 45 A0 4F 00 70 00 C7 45 A4 65 00 72 00 C7 45 A8 61 00 20 00 C7 45 AC 53 00 74 00 C7 45 B0 61 00 62 00 C7 45 B4 6C 00 65 00 C7 45 B8 5C 00 4C 00 C7 45 BC 6F 00 67 00 C7 45 C0 69 00 6E 00 C7 45 C4 20 00 44 00 C7 45 C8 61 00 74 00 C7 45 CC 61 00 00 00 }', '{ C7 45 A0 4F 00 70 00 C7 45 A4 65 00 72 00 C7 45 A8 61 00 20 00 C7 45 AC 53 00 74 00 C7 45 B0 61 00 62 00 C7 45 B4 6C 00 65 00 C7 45 B8 5C 00 4C 00 C7 45 BC 6F 00 67 00 C7 45 C0 69 00 6E 00 C7 45 C4 20 00 44 00 C7 45 C8 61 00 74 00 C7 45 CC 61 00 00 00 }', '{ C7 45 A4 65 00 72 00 C7 45 A8 61 00 20 00 C7 45 AC 53 00 74 00 C7 45 B0 61 00 62 00 C7 45 B4 6C 00 65 00 C7 45 B8 5C 00 4C 00 C7 45 BC 6F 00 67 00 C7 45 C0 69 00 6E 00 C7 45 C4 20 00 44 00 C7 45 C8 61 00 74 00 C7 45 CC 61 00 00 00 }', '{ C7 45 A8 61 00 20 00 C7 45 AC 53 00 74 00 C7 45 B0 61 00 62 00 C7 45 B4 6C 00 65 00 C7 45 B8 5C 00 4C 00 C7 45 BC 6F 00 67 00 C7 45 C0 69 00 6E 00 C7 45 C4 20 00 44 00 C7 45 C8 61 00 74 00 C7 45 CC 61 00 00 00 }', '{ C7 45 AC 53 00 74 00 C7 45 B0 61 00 62 00 C7 45 B4 6C 00 65 00 C7 45 B8 5C 00 4C 00 C7 45 BC 6F 00 67 00 C7 45 C0 69 00 6E 00 C7 45 C4 20 00 44 00 C7 45 C8 61 00 74 00 C7 45 CC 61 00 00 00 }', '{ C7 45 B0 61 00 62 00 C7 45 B4 6C 00 65 00 C7 45 B8 5C 00 4C 00 C7 45 BC 6F 00 67 00 C7 45 C0 69 00 6E 00 C7 45 C4 20 00 44 00 C7 45 C8 61 00 74 00 C7 45 CC 61 00 00 00 }', '{ C7 45 B4 6C 00 65 00 C7 45 B8 5C 00 4C 00 C7 45 BC 6F 00 67 00 C7 45 C0 69 00 6E 00 C7 45 C4 20 00 44 00 C7 45 C8 61 00 74 00 C7 45 CC 61 00 00 00 }', '{ C7 45 B8 5C 00 4C 00 C7 45 BC 6F 00 67 00 C7 45 C0 69 00 6E 00 C7 45 C4 20 00 44 00 C7 45 C8 61 00 74 00 C7 45 CC 61 00 00 00 }', '{ C7 45 BC 6F 00 67 00 C7 45 C0 69 00 6E 00 C7 45 C4 20 00 44 00 C7 45 C8 61 00 74 00 C7 45 CC 61 00 00 00 }', '{ C7 45 C0 69 00 6E 00 C7 45 C4 20 00 44 00 C7 45 C8 61 00 74 00 C7 45 CC 61 00 00 00 }', '{ C7 45 C4 20 00 44 00 C7 45 C8 61 00 74 00 C7 45 CC 61 00 00 00 }', '{ C7 45 80 41 00 75 00 C7 45 84 74 00 3A 00 C7 45 88 09 00 00 00 }', '{ C7 45 C8 69 00 6D 00 C7 45 CC 2E 00 6A 00 C7 45 D0 70 00 65 00 C7 45 D4 67 00 00 00 }', '{ C7 45 CC 2E 00 6A 00 C7 45 D0 70 00 65 00 C7 45 D4 67 00 00 00 }']'",
                    "PID 5396 triggered the Yara rule 'Formbook' with data '['{ 33 56 04 8D 86 A4 0B 00 00 68 F0 00 00 00 50 89 56 10 E8 F1 0A 00 00 8B 16 6A 00 6A 04 8D 4D FC 51 6A 07 52 56 E8 CE EB FF FF 8B 45 FC 83 C4 20 3B }', '{ F7 E9 C1 FA 03 8B C2 C1 E8 1F 03 C2 8D 04 80 03 C0 03 C0 8B D1 2B D0 8A 04 3A 88 8C 0D FA FE FF FF 88 84 0D F8 FD FF FF 41 81 F9 00 01 00 00 7C }', '{ 8A 50 01 28 10 48 49 75 F7 83 FE 01 76 14 8B C7 8D 4E FF 8D 9B 00 00 00 00 8A 50 01 28 10 40 49 75 F7 }', '{ 33 C0 66 39 01 74 0B 8D 49 00 40 66 83 3C 41 00 75 F8 8B 55 0C 8D 44 00 02 50 52 51 E8 }', '{ 64 A1 18 00 00 00 8B 40 30 89 45 FC 8B 45 FC 8B 40 08 8B E5 5D C3 }', '{ 8B 7D 0C 6A 00 6A 00 68 11 01 00 00 57 FF D6 85 C0 75 1D 50 }']'",
                    "PID 1428 triggered the Yara rule 'shellcode_get_eip' with data '['{ E8 00 00 00 00 58 }', '{ E8 00 00 00 00 5B }', '{ E8 00 00 00 00 5A }']'",
                    "PID 1428 triggered the Yara rule 'shellcode_stack_strings' with data '['{ C7 45 D4 5C 00 65 00 C7 45 D8 78 00 70 00 C7 45 DC 6C 00 6F 00 C7 45 E0 72 00 65 00 C7 45 E4 72 00 2E 00 C7 45 E8 65 00 78 00 C7 45 EC 65 00 00 00 }', '{ C7 45 D8 78 00 70 00 C7 45 DC 6C 00 6F 00 C7 45 E0 72 00 65 00 C7 45 E4 72 00 2E 00 C7 45 E8 65 00 78 00 C7 45 EC 65 00 00 00 }', '{ C7 45 DC 6C 00 6F 00 C7 45 E0 72 00 65 00 C7 45 E4 72 00 2E 00 C7 45 E8 65 00 78 00 C7 45 EC 65 00 00 00 }', '{ C7 45 E0 72 00 65 00 C7 45 E4 72 00 2E 00 C7 45 E8 65 00 78 00 C7 45 EC 65 00 00 00 }', '{ C7 45 E4 72 00 2E 00 C7 45 E8 65 00 78 00 C7 45 EC 65 00 00 00 }', '{ C7 45 D0 2E 00 73 00 C7 45 D4 71 00 6C 00 C7 45 D8 69 00 74 00 C7 45 DC 65 00 00 00 }', '{ C7 45 D4 71 00 6C 00 C7 45 D8 69 00 74 00 C7 45 DC 65 00 00 00 }', '{ C7 45 C0 43 00 6C 00 C7 45 C4 69 00 70 00 C7 45 C8 62 00 6F 00 C7 45 CC 61 00 72 00 C7 45 D0 64 00 00 00 }', '{ C7 45 C4 69 00 70 00 C7 45 C8 62 00 6F 00 C7 45 CC 61 00 72 00 C7 45 D0 64 00 00 00 }', '{ C7 45 C8 62 00 6F 00 C7 45 CC 61 00 72 00 C7 45 D0 64 00 00 00 }', '{ C7 45 E0 55 00 6E 00 C7 45 E4 6B 00 6E 00 C7 45 E8 6F 00 77 00 C7 45 EC 6E 00 00 00 }', '{ C7 45 E4 6B 00 6E 00 C7 45 E8 6F 00 77 00 C7 45 EC 6E 00 00 00 }', '{ C7 45 E0 6C 00 6F 00 C7 45 E4 67 00 2E 00 C7 45 E8 69 00 6E 00 C7 45 EC 69 00 00 00 }', '{ C7 45 E4 67 00 2E 00 C7 45 E8 69 00 6E 00 C7 45 EC 69 00 00 00 }', '{ C7 45 F0 62 00 72 00 C7 45 F4 6F 00 77 00 C7 45 F8 73 00 65 00 C7 45 FC 72 00 00 00 }', '{ C7 45 F4 6F 00 77 00 C7 45 F8 73 00 65 00 C7 45 FC 72 00 00 00 }', '{ C7 45 F0 5B 00 45 00 C7 45 F4 73 00 63 00 C7 45 F8 5D 00 00 00 }', '{ C7 45 E4 5B 00 41 00 C7 45 E8 6C 00 74 00 C7 45 EC 5D 00 00 00 }', '{ C7 45 D8 5B 00 54 00 C7 45 DC 61 00 62 00 C7 45 E0 5D 00 00 00 }', '{ C7 45 B8 5B 00 45 00 C7 45 BC 6E 00 74 00 C7 45 C0 65 00 72 00 C7 45 C4 5D 00 00 00 }', '{ C7 45 BC 6E 00 74 00 C7 45 C0 65 00 72 00 C7 45 C4 5D 00 00 00 }', '{ C7 45 C8 5B 00 3C 00 C7 45 CC 2D 00 44 00 C7 45 D0 65 00 6C 00 C7 45 D4 5D 00 00 00 }', '{ C7 45 CC 2D 00 44 00 C7 45 D0 65 00 6C 00 C7 45 D4 5D 00 00 00 }', '{ C7 45 D0 69 00 6D 00 C7 45 D4 2E 00 6A 00 C7 45 D8 70 00 65 00 C7 45 DC 67 00 00 00 }', '{ C7 45 D4 2E 00 6A 00 C7 45 D8 70 00 65 00 C7 45 DC 67 00 00 00 }', '{ C7 45 F0 55 00 6E 00 C7 45 F4 6B 00 6E 00 C7 45 F8 6F 00 77 00 C7 45 FC 6E 00 00 00 }', '{ C7 45 F4 6B 00 6E 00 C7 45 F8 6F 00 77 00 C7 45 FC 6E 00 00 00 }', '{ C7 45 C0 50 00 72 00 C7 45 C4 6F 00 67 00 C7 45 C8 72 00 61 00 C7 45 CC 6D 00 20 00 C7 45 D0 46 00 69 00 C7 45 D4 6C 00 65 00 C7 45 D8 73 00 00 00 }', '{ C7 45 C4 6F 00 67 00 C7 45 C8 72 00 61 00 C7 45 CC 6D 00 20 00 C7 45 D0 46 00 69 00 C7 45 D4 6C 00 65 00 C7 45 D8 73 00 00 00 }', '{ C7 45 C8 72 00 61 00 C7 45 CC 6D 00 20 00 C7 45 D0 46 00 69 00 C7 45 D4 6C 00 65 00 C7 45 D8 73 00 00 00 }', '{ C7 45 CC 6D 00 20 00 C7 45 D0 46 00 69 00 C7 45 D4 6C 00 65 00 C7 45 D8 73 00 00 00 }', '{ C7 45 D0 46 00 69 00 C7 45 D4 6C 00 65 00 C7 45 D8 73 00 00 00 }', '{ C7 45 E8 5C 00 4D 00 C7 45 EC 61 00 69 00 C7 45 F0 6E 00 00 00 }', '{ C7 45 88 55 00 72 00 C7 45 8C 6C 00 3A 00 C7 45 90 09 00 00 00 }', '{ C7 45 80 72 00 6E 00 C7 45 84 65 00 74 00 C7 45 88 20 00 45 00 C7 45 8C 78 00 70 00 C7 45 90 6C 00 6F 00 C7 45 94 72 00 65 00 C7 45 98 72 00 5C 00 C7 45 9C 49 00 6E 00 C7 45 A0 74 00 65 00 C7 45 A4 6C 00 6C 00 C7 45 A8 69 00 46 00 C7 45 AC 6F 00 72 00 C7 45 B0 6D 00 73 00 C7 45 B4 5C 00 53 00 C7 45 B8 74 00 6F 00 C7 45 BC 72 00 61 00 C7 45 C0 67 00 65 00 C7 45 C4 32 00 00 00 }', '{ C7 45 84 65 00 74 00 C7 45 88 20 00 45 00 C7 45 8C 78 00 70 00 C7 45 90 6C 00 6F 00 C7 45 94 72 00 65 00 C7 45 98 72 00 5C 00 C7 45 9C 49 00 6E 00 C7 45 A0 74 00 65 00 C7 45 A4 6C 00 6C 00 C7 45 A8 69 00 46 00 C7 45 AC 6F 00 72 00 C7 45 B0 6D 00 73 00 C7 45 B4 5C 00 53 00 C7 45 B8 74 00 6F 00 C7 45 BC 72 00 61 00 C7 45 C0 67 00 65 00 C7 45 C4 32 00 00 00 }', '{ C7 45 88 20 00 45 00 C7 45 8C 78 00 70 00 C7 45 90 6C 00 6F 00 C7 45 94 72 00 65 00 C7 45 98 72 00 5C 00 C7 45 9C 49 00 6E 00 C7 45 A0 74 00 65 00 C7 45 A4 6C 00 6C 00 C7 45 A8 69 00 46 00 C7 45 AC 6F 00 72 00 C7 45 B0 6D 00 73 00 C7 45 B4 5C 00 53 00 C7 45 B8 74 00 6F 00 C7 45 BC 72 00 61 00 C7 45 C0 67 00 65 00 C7 45 C4 32 00 00 00 }', '{ C7 45 8C 78 00 70 00 C7 45 90 6C 00 6F 00 C7 45 94 72 00 65 00 C7 45 98 72 00 5C 00 C7 45 9C 49 00 6E 00 C7 45 A0 74 00 65 00 C7 45 A4 6C 00 6C 00 C7 45 A8 69 00 46 00 C7 45 AC 6F 00 72 00 C7 45 B0 6D 00 73 00 C7 45 B4 5C 00 53 00 C7 45 B8 74 00 6F 00 C7 45 BC 72 00 61 00 C7 45 C0 67 00 65 00 C7 45 C4 32 00 00 00 }', '{ C7 45 90 6C 00 6F 00 C7 45 94 72 00 65 00 C7 45 98 72 00 5C 00 C7 45 9C 49 00 6E 00 C7 45 A0 74 00 65 00 C7 45 A4 6C 00 6C 00 C7 45 A8 69 00 46 00 C7 45 AC 6F 00 72 00 C7 45 B0 6D 00 73 00 C7 45 B4 5C 00 53 00 C7 45 B8 74 00 6F 00 C7 45 BC 72 00 61 00 C7 45 C0 67 00 65 00 C7 45 C4 32 00 00 00 }', '{ C7 45 94 72 00 65 00 C7 45 98 72 00 5C 00 C7 45 9C 49 00 6E 00 C7 45 A0 74 00 65 00 C7 45 A4 6C 00 6C 00 C7 45 A8 69 00 46 00 C7 45 AC 6F 00 72 00 C7 45 B0 6D 00 73 00 C7 45 B4 5C 00 53 00 C7 45 B8 74 00 6F 00 C7 45 BC 72 00 61 00 C7 45 C0 67 00 65 00 C7 45 C4 32 00 00 00 }', '{ C7 45 98 72 00 5C 00 C7 45 9C 49 00 6E 00 C7 45 A0 74 00 65 00 C7 45 A4 6C 00 6C 00 C7 45 A8 69 00 46 00 C7 45 AC 6F 00 72 00 C7 45 B0 6D 00 73 00 C7 45 B4 5C 00 53 00 C7 45 B8 74 00 6F 00 C7 45 BC 72 00 61 00 C7 45 C0 67 00 65 00 C7 45 C4 32 00 00 00 }', '{ C7 45 9C 49 00 6E 00 C7 45 A0 74 00 65 00 C7 45 A4 6C 00 6C 00 C7 45 A8 69 00 46 00 C7 45 AC 6F 00 72 00 C7 45 B0 6D 00 73 00 C7 45 B4 5C 00 53 00 C7 45 B8 74 00 6F 00 C7 45 BC 72 00 61 00 C7 45 C0 67 00 65 00 C7 45 C4 32 00 00 00 }', '{ C7 45 A0 74 00 65 00 C7 45 A4 6C 00 6C 00 C7 45 A8 69 00 46 00 C7 45 AC 6F 00 72 00 C7 45 B0 6D 00 73 00 C7 45 B4 5C 00 53 00 C7 45 B8 74 00 6F 00 C7 45 BC 72 00 61 00 C7 45 C0 67 00 65 00 C7 45 C4 32 00 00 00 }', '{ C7 45 A4 6C 00 6C 00 C7 45 A8 69 00 46 00 C7 45 AC 6F 00 72 00 C7 45 B0 6D 00 73 00 C7 45 B4 5C 00 53 00 C7 45 B8 74 00 6F 00 C7 45 BC 72 00 61 00 C7 45 C0 67 00 65 00 C7 45 C4 32 00 00 00 }', '{ C7 45 A8 69 00 46 00 C7 45 AC 6F 00 72 00 C7 45 B0 6D 00 73 00 C7 45 B4 5C 00 53 00 C7 45 B8 74 00 6F 00 C7 45 BC 72 00 61 00 C7 45 C0 67 00 65 00 C7 45 C4 32 00 00 00 }', '{ C7 45 AC 6F 00 72 00 C7 45 B0 6D 00 73 00 C7 45 B4 5C 00 53 00 C7 45 B8 74 00 6F 00 C7 45 BC 72 00 61 00 C7 45 C0 67 00 65 00 C7 45 C4 32 00 00 00 }', '{ C7 45 B0 6D 00 73 00 C7 45 B4 5C 00 53 00 C7 45 B8 74 00 6F 00 C7 45 BC 72 00 61 00 C7 45 C0 67 00 65 00 C7 45 C4 32 00 00 00 }', '{ C7 45 B4 5C 00 53 00 C7 45 B8 74 00 6F 00 C7 45 BC 72 00 61 00 C7 45 C0 67 00 65 00 C7 45 C4 32 00 00 00 }', '{ C7 45 B8 74 00 6F 00 C7 45 BC 72 00 61 00 C7 45 C0 67 00 65 00 C7 45 C4 32 00 00 00 }', '{ C7 45 BC 72 00 61 00 C7 45 C0 67 00 65 00 C7 45 C4 32 00 00 00 }', '{ C7 45 80 5C 00 4F 00 C7 45 84 70 00 65 00 C7 45 88 72 00 61 00 C7 45 8C 20 00 53 00 C7 45 90 6F 00 66 00 C7 45 94 74 00 77 00 C7 45 98 61 00 72 00 C7 45 9C 65 00 5C 00 C7 45 A0 4F 00 70 00 C7 45 A4 65 00 72 00 C7 45 A8 61 00 20 00 C7 45 AC 53 00 74 00 C7 45 B0 61 00 62 00 C7 45 B4 6C 00 65 00 C7 45 B8 5C 00 4C 00 C7 45 BC 6F 00 67 00 C7 45 C0 69 00 6E 00 C7 45 C4 20 00 44 00 C7 45 C8 61 00 74 00 C7 45 CC 61 00 00 00 }', '{ C7 45 84 70 00 65 00 C7 45 88 72 00 61 00 C7 45 8C 20 00 53 00 C7 45 90 6F 00 66 00 C7 45 94 74 00 77 00 C7 45 98 61 00 72 00 C7 45 9C 65 00 5C 00 C7 45 A0 4F 00 70 00 C7 45 A4 65 00 72 00 C7 45 A8 61 00 20 00 C7 45 AC 53 00 74 00 C7 45 B0 61 00 62 00 C7 45 B4 6C 00 65 00 C7 45 B8 5C 00 4C 00 C7 45 BC 6F 00 67 00 C7 45 C0 69 00 6E 00 C7 45 C4 20 00 44 00 C7 45 C8 61 00 74 00 C7 45 CC 61 00 00 00 }', '{ C7 45 88 72 00 61 00 C7 45 8C 20 00 53 00 C7 45 90 6F 00 66 00 C7 45 94 74 00 77 00 C7 45 98 61 00 72 00 C7 45 9C 65 00 5C 00 C7 45 A0 4F 00 70 00 C7 45 A4 65 00 72 00 C7 45 A8 61 00 20 00 C7 45 AC 53 00 74 00 C7 45 B0 61 00 62 00 C7 45 B4 6C 00 65 00 C7 45 B8 5C 00 4C 00 C7 45 BC 6F 00 67 00 C7 45 C0 69 00 6E 00 C7 45 C4 20 00 44 00 C7 45 C8 61 00 74 00 C7 45 CC 61 00 00 00 }', '{ C7 45 8C 20 00 53 00 C7 45 90 6F 00 66 00 C7 45 94 74 00 77 00 C7 45 98 61 00 72 00 C7 45 9C 65 00 5C 00 C7 45 A0 4F 00 70 00 C7 45 A4 65 00 72 00 C7 45 A8 61 00 20 00 C7 45 AC 53 00 74 00 C7 45 B0 61 00 62 00 C7 45 B4 6C 00 65 00 C7 45 B8 5C 00 4C 00 C7 45 BC 6F 00 67 00 C7 45 C0 69 00 6E 00 C7 45 C4 20 00 44 00 C7 45 C8 61 00 74 00 C7 45 CC 61 00 00 00 }', '{ C7 45 90 6F 00 66 00 C7 45 94 74 00 77 00 C7 45 98 61 00 72 00 C7 45 9C 65 00 5C 00 C7 45 A0 4F 00 70 00 C7 45 A4 65 00 72 00 C7 45 A8 61 00 20 00 C7 45 AC 53 00 74 00 C7 45 B0 61 00 62 00 C7 45 B4 6C 00 65 00 C7 45 B8 5C 00 4C 00 C7 45 BC 6F 00 67 00 C7 45 C0 69 00 6E 00 C7 45 C4 20 00 44 00 C7 45 C8 61 00 74 00 C7 45 CC 61 00 00 00 }', '{ C7 45 94 74 00 77 00 C7 45 98 61 00 72 00 C7 45 9C 65 00 5C 00 C7 45 A0 4F 00 70 00 C7 45 A4 65 00 72 00 C7 45 A8 61 00 20 00 C7 45 AC 53 00 74 00 C7 45 B0 61 00 62 00 C7 45 B4 6C 00 65 00 C7 45 B8 5C 00 4C 00 C7 45 BC 6F 00 67 00 C7 45 C0 69 00 6E 00 C7 45 C4 20 00 44 00 C7 45 C8 61 00 74 00 C7 45 CC 61 00 00 00 }', '{ C7 45 98 61 00 72 00 C7 45 9C 65 00 5C 00 C7 45 A0 4F 00 70 00 C7 45 A4 65 00 72 00 C7 45 A8 61 00 20 00 C7 45 AC 53 00 74 00 C7 45 B0 61 00 62 00 C7 45 B4 6C 00 65 00 C7 45 B8 5C 00 4C 00 C7 45 BC 6F 00 67 00 C7 45 C0 69 00 6E 00 C7 45 C4 20 00 44 00 C7 45 C8 61 00 74 00 C7 45 CC 61 00 00 00 }', '{ C7 45 9C 65 00 5C 00 C7 45 A0 4F 00 70 00 C7 45 A4 65 00 72 00 C7 45 A8 61 00 20 00 C7 45 AC 53 00 74 00 C7 45 B0 61 00 62 00 C7 45 B4 6C 00 65 00 C7 45 B8 5C 00 4C 00 C7 45 BC 6F 00 67 00 C7 45 C0 69 00 6E 00 C7 45 C4 20 00 44 00 C7 45 C8 61 00 74 00 C7 45 CC 61 00 00 00 }', '{ C7 45 A0 4F 00 70 00 C7 45 A4 65 00 72 00 C7 45 A8 61 00 20 00 C7 45 AC 53 00 74 00 C7 45 B0 61 00 62 00 C7 45 B4 6C 00 65 00 C7 45 B8 5C 00 4C 00 C7 45 BC 6F 00 67 00 C7 45 C0 69 00 6E 00 C7 45 C4 20 00 44 00 C7 45 C8 61 00 74 00 C7 45 CC 61 00 00 00 }', '{ C7 45 A4 65 00 72 00 C7 45 A8 61 00 20 00 C7 45 AC 53 00 74 00 C7 45 B0 61 00 62 00 C7 45 B4 6C 00 65 00 C7 45 B8 5C 00 4C 00 C7 45 BC 6F 00 67 00 C7 45 C0 69 00 6E 00 C7 45 C4 20 00 44 00 C7 45 C8 61 00 74 00 C7 45 CC 61 00 00 00 }', '{ C7 45 A8 61 00 20 00 C7 45 AC 53 00 74 00 C7 45 B0 61 00 62 00 C7 45 B4 6C 00 65 00 C7 45 B8 5C 00 4C 00 C7 45 BC 6F 00 67 00 C7 45 C0 69 00 6E 00 C7 45 C4 20 00 44 00 C7 45 C8 61 00 74 00 C7 45 CC 61 00 00 00 }', '{ C7 45 AC 53 00 74 00 C7 45 B0 61 00 62 00 C7 45 B4 6C 00 65 00 C7 45 B8 5C 00 4C 00 C7 45 BC 6F 00 67 00 C7 45 C0 69 00 6E 00 C7 45 C4 20 00 44 00 C7 45 C8 61 00 74 00 C7 45 CC 61 00 00 00 }', '{ C7 45 B0 61 00 62 00 C7 45 B4 6C 00 65 00 C7 45 B8 5C 00 4C 00 C7 45 BC 6F 00 67 00 C7 45 C0 69 00 6E 00 C7 45 C4 20 00 44 00 C7 45 C8 61 00 74 00 C7 45 CC 61 00 00 00 }', '{ C7 45 B4 6C 00 65 00 C7 45 B8 5C 00 4C 00 C7 45 BC 6F 00 67 00 C7 45 C0 69 00 6E 00 C7 45 C4 20 00 44 00 C7 45 C8 61 00 74 00 C7 45 CC 61 00 00 00 }', '{ C7 45 B8 5C 00 4C 00 C7 45 BC 6F 00 67 00 C7 45 C0 69 00 6E 00 C7 45 C4 20 00 44 00 C7 45 C8 61 00 74 00 C7 45 CC 61 00 00 00 }', '{ C7 45 BC 6F 00 67 00 C7 45 C0 69 00 6E 00 C7 45 C4 20 00 44 00 C7 45 C8 61 00 74 00 C7 45 CC 61 00 00 00 }', '{ C7 45 C0 69 00 6E 00 C7 45 C4 20 00 44 00 C7 45 C8 61 00 74 00 C7 45 CC 61 00 00 00 }', '{ C7 45 C4 20 00 44 00 C7 45 C8 61 00 74 00 C7 45 CC 61 00 00 00 }', '{ C7 45 80 41 00 75 00 C7 45 84 74 00 3A 00 C7 45 88 09 00 00 00 }', '{ C7 45 C8 69 00 6D 00 C7 45 CC 2E 00 6A 00 C7 45 D0 70 00 65 00 C7 45 D4 67 00 00 00 }', '{ C7 45 CC 2E 00 6A 00 C7 45 D0 70 00 65 00 C7 45 D4 67 00 00 00 }', '{ C7 45 B4 65 00 72 00 C7 45 BA 32 00 2E 00 C7 45 BE 64 00 6C 00 C7 45 C2 6C 00 00 00 }', '{ C7 45 BA 32 00 2E 00 C7 45 BE 64 00 6C 00 C7 45 C2 6C 00 00 00 }', '{ C7 45 C8 73 00 73 00 C7 45 CC 70 00 69 00 C7 45 D0 63 00 6C 00 C7 45 D4 69 00 2E 00 C7 45 D8 64 00 6C 00 C7 45 DC 6C 00 00 00 }', '{ C7 45 CC 70 00 69 00 C7 45 D0 63 00 6C 00 C7 45 D4 69 00 2E 00 C7 45 D8 64 00 6C 00 C7 45 DC 6C 00 00 00 }', '{ C7 45 D0 63 00 6C 00 C7 45 D4 69 00 2E 00 C7 45 D8 64 00 6C 00 C7 45 DC 6C 00 00 00 }', '{ C7 45 D4 69 00 2E 00 C7 45 D8 64 00 6C 00 C7 45 DC 6C 00 00 00 }', '{ C7 45 E0 77 00 69 00 C7 45 E4 6E 00 69 00 C7 45 E8 6E 00 65 00 C7 45 EC 74 00 2E 00 C7 45 F0 64 00 6C 00 C7 45 F4 6C 00 00 00 }', '{ C7 45 E4 6E 00 69 00 C7 45 E8 6E 00 65 00 C7 45 EC 74 00 2E 00 C7 45 F0 64 00 6C 00 C7 45 F4 6C 00 00 00 }', '{ C7 45 E8 6E 00 65 00 C7 45 EC 74 00 2E 00 C7 45 F0 64 00 6C 00 C7 45 F4 6C 00 00 00 }', '{ C7 45 EC 74 00 2E 00 C7 45 F0 64 00 6C 00 C7 45 F4 6C 00 00 00 }', '{ C7 45 D0 55 00 6E 00 C7 45 D4 6B 00 6E 00 C7 45 D8 6F 00 77 00 C7 45 DC 6E 00 00 00 }', '{ C7 45 D4 6B 00 6E 00 C7 45 D8 6F 00 77 00 C7 45 DC 6E 00 00 00 }']'",
                    "PID 1428 triggered the Yara rule 'Formbook' with data '['{ 33 56 04 8D 86 A4 0B 00 00 68 F0 00 00 00 50 89 56 10 E8 F1 0A 00 00 8B 16 6A 00 6A 04 8D 4D FC 51 6A 07 52 56 E8 CE EB FF FF 8B 45 FC 83 C4 20 3B }', '{ F7 E9 C1 FA 03 8B C2 C1 E8 1F 03 C2 8D 04 80 03 C0 03 C0 8B D1 2B D0 8A 04 3A 88 8C 0D FA FE FF FF 88 84 0D F8 FD FF FF 41 81 F9 00 01 00 00 7C }', '{ 8A 50 01 28 10 48 49 75 F7 83 FE 01 76 14 8B C7 8D 4E FF 8D 9B 00 00 00 00 8A 50 01 28 10 40 49 75 F7 }', '{ 33 C0 66 39 01 74 0B 8D 49 00 40 66 83 3C 41 00 75 F8 8B 55 0C 8D 44 00 02 50 52 51 E8 }', '{ 64 A1 18 00 00 00 8B 40 30 89 45 FC 8B 45 FC 8B 40 08 8B E5 5D C3 }', '{ 8B 7D 0C 6A 00 6A 00 68 11 01 00 00 57 FF D6 85 C0 75 1D 50 }']'"
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "Reads from the memory of another process",
                  "match_data": [
                    "Process software.exe with process ID 3644 read from the memory of process handle 0x0000048c",
                    "pid: 3644"
                  ]
                },
                {
                  "severity": "MEDIUM",
                  "description": "Anomalous binary characteristics",
                  "match_data": [
                    "Entrypoint of binary is located outside of any mapped sections"
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "A process attempted to delay the analysis task.",
                  "match_data": [
                    "pid: 5252"
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "The PE file contains a suspicious PDB path",
                  "match_data": [
                    "the pdb path contains a reference to a development path or term that may suggest a non-enterprise environment development/compilation",
                    "C:\\Users\\Administrator\\Desktop\\Client\\Temp\\zSfpOepmYm\\src\\obj\\Debug\\YTdr.pdb"
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0002",
          "name": "Execution",
          "link": "https://attack.mitre.org/tactics/TA0002/",
          "description": "The adversary is trying to run malicious code.\n\nExecution consists of techniques that result in adversary-controlled code running on a local or remote system. Techniques that run malicious code are often paired with techniques from all other tactics to achieve broader goals, like exploring a network or stealing data. For example, an adversary might use a remote access tool to run a PowerShell script that does Remote System Discovery. ",
          "techniques": [
            {
              "id": "T1106",
              "name": "Native API",
              "link": "https://attack.mitre.org/techniques/T1106/",
              "description": "Adversaries may interact with the native OS application programming interface (API) to execute behaviors. Native APIs provide a controlled means of calling low-level OS services within the kernel, such as those involving hardware/devices, memory, and processes. These native APIs are leveraged by the OS during system boot (when other system components are not yet initialized) as well as carrying out tasks and requests during routine operations.\nAdversaries may abuse these OS API functions as a means of executing behaviors. Similar to Command and Scripting Interpreter, the native API and its hierarchy of interfaces provide mechanisms to interact with and utilize various components of a victimized system.\nNative API functions (such as NtCreateProcess) may be directed invoked via system calls / syscalls, but these features are also often exposed to user-mode applications via interfaces and libraries. For example, functions such as the Windows API CreateProcess() or GNU fork() will allow programs and scripts to start other processes. This may allow API callers to execute a binary, run a CLI command, load modules, etc. as thousands of similar API functions exist for various system operations.\nHigher level software frameworks, such as Microsoft .NET and macOS Cocoa, are also available to interact with native APIs. These frameworks typically provide language wrappers/abstractions to API functionalities and are designed for ease-of-use/portability of code.\nAdversaries may use assembly to directly or in-directly invoke syscalls in an attempt to subvert defensive sensors and detection signatures such as user mode API-hooks. Adversaries may also attempt to tamper with sensors and defensive tools associated with API monitoring, such as unhooking monitored functions via Disable or Modify Tools.",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Guard pages use detected - possible anti-debugging.",
                  "match_data": [
                    "pid: 3644"
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0009",
          "name": "Collection",
          "link": "https://attack.mitre.org/tactics/TA0009/",
          "description": "The adversary is trying to gather data of interest to their goal.\n\nCollection consists of techniques adversaries may use to gather information and the sources information is collected from that are relevant to following through on the adversary's objectives. Frequently, the next goal after collecting data is to either steal (exfiltrate) the data or to use the data to gain more information about the target environment. Common target sources include various drive types, browsers, audio, video, and email. Common collection methods include capturing screenshots and keyboard input.",
          "techniques": [
            {
              "id": "T1005",
              "name": "Data from Local System",
              "link": "https://attack.mitre.org/techniques/T1005/",
              "description": "Adversaries may search local system sources, such as file systems, configuration files, local databases, virtual machine files, or process memory, to find files of interest and sensitive data prior to Exfiltration.\nAdversaries may do this using a Command and Scripting Interpreter, such as cmd as well as a Network Device CLI, which have functionality to interact with the file system to gather information. Adversaries may also use Automated Collection on the local system.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Steals private information from local Internet browsers",
                  "match_data": [
                    "pid: 5252"
                  ]
                }
              ]
            },
            {
              "id": "T1074",
              "name": "Data Staged",
              "link": "https://attack.mitre.org/techniques/T1074/",
              "description": "Adversaries may stage collected data in a central location or directory prior to Exfiltration. Data may be kept in separate files or combined into one file through techniques such as Archive Collected Data. Interactive command shells may be used, and common functionality within cmd and bash may be used to copy data into a staging location.\nIn cloud environments, adversaries may stage data within a particular instance or virtual machine before exfiltration. An adversary may Create Cloud Instance and stage data in that instance.\nAdversaries may choose to stage data from a victim network in a centralized location prior to Exfiltration to minimize the number of connections made to their C2 server and better evade detection.",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Manipulates data from or to the Recycle Bin",
                  "match_data": [
                    "pid: 5252",
                    "C:\\$Recycle.Bin\\S-1-5-21-4005801669-2598574594-602355426-1001",
                    "C:\\$Recycle.Bin\\S-1-5-21-4005801669-2598574594-602355426-1001\\desktop.ini"
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    "VMRay": {
      "tactics": [
        {
          "id": "TA0009",
          "name": "Collection",
          "link": "https://attack.mitre.org/tactics/TA0009/",
          "description": "The adversary is trying to gather data of interest to their goal.\n\nCollection consists of techniques adversaries may use to gather information and the sources information is collected from that are relevant to following through on the adversary's objectives. Frequently, the next goal after collecting data is to either steal (exfiltrate) the data or to use the data to gain more information about the target environment. Common target sources include various drive types, browsers, audio, video, and email. Common collection methods include capturing screenshots and keyboard input.",
          "techniques": [
            {
              "id": "T1005",
              "name": "Data from Local System",
              "link": "https://attack.mitre.org/techniques/T1005/",
              "description": "Adversaries may search local system sources, such as file systems, configuration files, local databases, virtual machine files, or process memory, to find files of interest and sensitive data prior to Exfiltration.\nAdversaries may do this using a Command and Scripting Interpreter, such as cmd as well as a Network Device CLI, which have functionality to interact with the file system to gather information. Adversaries may also use Automated Collection on the local system.",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Reads sensitive browser data"
                }
              ]
            },
            {
              "id": "T1056",
              "name": "Input Capture",
              "link": "https://attack.mitre.org/techniques/T1056/",
              "description": "Adversaries may use methods of capturing user input to obtain credentials or collect information. During normal system usage, users often provide credentials to various different locations, such as login pages/portals or system dialog boxes. Input capture mechanisms may be transparent to the user (e.g. Credential API Hooking) or rely on deceiving the user into providing input into what they believe to be a genuine service (e.g. Web Portal Capture)."
            },
            {
              "id": "T1056.004",
              "name": "Credential API Hooking",
              "link": "https://attack.mitre.org/techniques/T1056/004/",
              "description": "Adversaries may hook into Windows application programming interface (API) functions and Linux system functions to collect user credentials. Malicious hooking mechanisms may capture API or function calls that include parameters that reveal user authentication credentials. Unlike Keylogging, this technique focuses specifically on API functions that include parameters that reveal user credentials. \nIn Windows, hooking involves redirecting calls to these functions and can be implemented via:\n\nHooks procedures, which intercept and execute designated code in response to events such as messages, keystrokes, and mouse inputs.\nImport address table (IAT) hooking, which use modifications to a process’s IAT, where pointers to imported API functions are stored.\nInline hooking, which overwrites the first bytes in an API function to redirect code flow.\n\nIn Linux and macOS, adversaries may hook into system functions via the LD_PRELOAD (Linux) or DYLD_INSERT_LIBRARIES (macOS) environment variables, which enables loading shared libraries into a program’s address space. For example, an adversary may capture credentials by hooking into the libc read function leveraged by SSH or SCP.",
              "signatures": [
                {
                  "severity": "HIGH",
                  "description": "Adds a hook to a web browser",
                  "match_data": [
                    "(Process #4) ipconfig.exe adds a hook to Internet Explorer for user32.dll:SendMessageA+0x5.",
                    "(Process #4) ipconfig.exe adds a hook to Internet Explorer for ntdll.dll:@RtlpAllocateHeap@24+0x5e0.",
                    "(Process #4) ipconfig.exe adds a hook to Internet Explorer for ntdll.dll:RtlFreeHeap+0x108.",
                    "(Process #4) ipconfig.exe adds a hook to Internet Explorer for ntdll.dll:RtlpLocateActivationContextSection+0xf0.",
                    "(Process #4) ipconfig.exe adds a hook to Internet Explorer for ntdll.dll:@RtlpReAllocateHeap@16+0xf46.",
                    "(Process #4) ipconfig.exe adds a hook to Internet Explorer for ntdll.dll:@RtlpReAllocateHeap@16+0xf4e.",
                    "(Process #4) ipconfig.exe adds a hook to Internet Explorer for ntdll.dll:@RtlpReAllocateHeap@16+0xf45.",
                    "(Process #4) ipconfig.exe adds a hook to Internet Explorer for ntdll.dll:RtlpHpFreeHeap+0x66.",
                    "(Process #4) ipconfig.exe adds a hook to Internet Explorer for ntdll.dll:RtlpGenerateInheritedAce+0x37.",
                    "(Process #4) ipconfig.exe adds a hook to Internet Explorer for ntdll.dll:@RtlpReAllocateHeap@16+0xf53."
                  ]
                }
              ]
            },
            {
              "id": "T1113",
              "name": "Screen Capture",
              "link": "https://attack.mitre.org/techniques/T1113/",
              "description": "Adversaries may attempt to take screen captures of the desktop to gather information over the course of an operation. Screen capturing functionality may be included as a feature of a remote access tool used in post-compromise operations. Taking a screenshot is also typically possible through native utilities or API calls, such as CopyFromScreen, xwd, or screencapture.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Takes screenshot"
                }
              ]
            },
            {
              "id": "T1119",
              "name": "Automated Collection",
              "link": "https://attack.mitre.org/techniques/T1119/",
              "description": "Once established within a system or network, an adversary may use automated techniques for collecting internal data. Methods for performing this technique could include use of a Command and Scripting Interpreter to search for and copy information fitting set criteria such as file type, location, or name at specific time intervals. \nIn cloud-based environments, adversaries may also use cloud APIs, data pipelines, command line interfaces, or extract, transform, and load (ETL) services to automatically collect data. \nThis functionality could also be built into remote access tools. \nThis technique may incorporate use of other techniques such as File and Directory Discovery and Lateral Tool Transfer to identify and move files, as well as Cloud Service Dashboard and Cloud Storage Object Discovery to identify resources in cloud environments.",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Reads sensitive browser data"
                }
              ]
            },
            {
              "id": "T1185",
              "name": "Browser Session Hijacking",
              "link": "https://attack.mitre.org/techniques/T1185/",
              "description": "Adversaries may take advantage of security vulnerabilities and inherent functionality in browser software to change content, modify user-behaviors, and intercept information as part of various browser session hijacking techniques.\nA specific example is when an adversary injects software into a browser that allows them to inherit cookies, HTTP sessions, and SSL client certificates of a user then use the browser as a way to pivot into an authenticated intranet. Executing browser-based behaviors such as pivoting may require specific process permissions, such as SeDebugPrivilege and/or high-integrity/administrator rights.\nAnother example involves pivoting browser traffic from the adversary's browser through the user's browser by setting up a proxy which will redirect web traffic. This does not alter the user's traffic in any way, and the proxy connection can be severed as soon as the browser is closed. The adversary assumes the security context of whichever browser process the proxy is injected into. Browsers typically create a new process for each tab that is opened and permissions and certificates are separated accordingly. With these permissions, an adversary could potentially browse to any resource on an intranet, such as Sharepoint or webmail, that is accessible through the browser and which the browser has sufficient permissions. Browser pivoting may also bypass security provided by 2-factor authentication.",
              "signatures": [
                {
                  "severity": "HIGH",
                  "description": "Adds a hook to a web browser",
                  "match_data": [
                    "(Process #4) ipconfig.exe adds a hook to Internet Explorer for user32.dll:SendMessageA+0x5.",
                    "(Process #4) ipconfig.exe adds a hook to Internet Explorer for ntdll.dll:@RtlpAllocateHeap@24+0x5e0.",
                    "(Process #4) ipconfig.exe adds a hook to Internet Explorer for ntdll.dll:RtlFreeHeap+0x108.",
                    "(Process #4) ipconfig.exe adds a hook to Internet Explorer for ntdll.dll:RtlpLocateActivationContextSection+0xf0.",
                    "(Process #4) ipconfig.exe adds a hook to Internet Explorer for ntdll.dll:@RtlpReAllocateHeap@16+0xf46.",
                    "(Process #4) ipconfig.exe adds a hook to Internet Explorer for ntdll.dll:@RtlpReAllocateHeap@16+0xf4e.",
                    "(Process #4) ipconfig.exe adds a hook to Internet Explorer for ntdll.dll:@RtlpReAllocateHeap@16+0xf45.",
                    "(Process #4) ipconfig.exe adds a hook to Internet Explorer for ntdll.dll:RtlpHpFreeHeap+0x66.",
                    "(Process #4) ipconfig.exe adds a hook to Internet Explorer for ntdll.dll:RtlpGenerateInheritedAce+0x37.",
                    "(Process #4) ipconfig.exe adds a hook to Internet Explorer for ntdll.dll:@RtlpReAllocateHeap@16+0xf53."
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0007",
          "name": "Discovery",
          "link": "https://attack.mitre.org/tactics/TA0007/",
          "description": "The adversary is trying to figure out your environment.\n\nDiscovery consists of techniques an adversary may use to gain knowledge about the system and internal network. These techniques help adversaries observe the environment and orient themselves before deciding how to act. They also allow adversaries to explore what they can control and what’s around their entry point in order to discover how it could benefit their current objective. Native operating system tools are often used toward this post-compromise information-gathering objective. ",
          "techniques": [
            {
              "id": "T1012",
              "name": "Query Registry",
              "link": "https://attack.mitre.org/techniques/T1012/",
              "description": "Adversaries may interact with the Windows Registry to gather information about the system, configuration, and installed software.\nThe Registry contains a significant amount of information about the operating system, configuration, software, and security. Information can easily be queried using the Reg utility, though other means to access the Registry exist. Some of the information may help adversaries to further their operation within a network. Adversaries may use the information from Query Registry during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Query OS Information",
                  "match_data": [
                    "(Process #4) ipconfig.exe reads product name from registry."
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "Possibly does reconnaissance"
                }
              ]
            },
            {
              "id": "T1082",
              "name": "System Information Discovery",
              "link": "https://attack.mitre.org/techniques/T1082/",
              "description": "An adversary may attempt to get detailed information about the operating system and hardware, including version, patches, hotfixes, service packs, and architecture. Adversaries may use this information to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions. This behavior is distinct from Local Storage Discovery which is an adversary's discovery of local drive, disks and/or volumes.\nTools such as Systeminfo can be used to gather detailed system information. If running with privileged access, a breakdown of system data can be gathered through the systemsetup configuration tool on macOS. Adversaries may leverage a Network Device CLI on network devices to gather detailed system information (e.g. show version). On ESXi servers, threat actors may gather system information from various esxcli utilities, such as system hostname get and system version get.\nInfrastructure as a Service (IaaS) cloud providers such as AWS, GCP, and Azure allow access to instance and virtual machine information via APIs. Successful authenticated API calls can return data such as the operating system platform and status of a particular instance or the model view of a virtual machine.\nSystem Information Discovery combined with information gathered from other forms of discovery and reconnaissance can drive payload development and concealment. ",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Query OS Information",
                  "match_data": [
                    "(Process #4) ipconfig.exe reads product name from registry."
                  ]
                }
              ]
            },
            {
              "id": "T1497",
              "name": "Virtualization/Sandbox Evasion",
              "link": "https://attack.mitre.org/techniques/T1497/",
              "description": "Adversaries may employ various means to detect and avoid virtualization and analysis environments. This may include changing behaviors based on the results of checks for the presence of artifacts indicative of a virtual machine environment (VME) or sandbox. If the adversary detects a VME, they may alter their malware to disengage from the victim or conceal the core functions of the implant. They may also search for VME artifacts before dropping secondary or additional payloads. Adversaries may use the information learned from Virtualization/Sandbox Evasion during automated discovery to shape follow-on behaviors.\nAdversaries may use several methods to accomplish Virtualization/Sandbox Evasion such as checking for security monitoring tools (e.g., Sysinternals, Wireshark, etc.) or other system artifacts associated with analysis or virtualization. Adversaries may also check for legitimate user activity to help determine if it is in an analysis environment. Additional methods include use of sleep timers or loops within malware code to avoid operating within a temporary sandbox."
            },
            {
              "id": "T1497.003",
              "name": "Time Based Checks",
              "link": "https://attack.mitre.org/techniques/T1497/003/",
              "description": "Adversaries may employ various time-based methods to detect virtualization and analysis environments, particularly those that attempt to manipulate time mechanisms to simulate longer elapses of time. This may include enumerating time-based properties, such as uptime or the system clock. \nAdversaries may use calls like GetTickCount and GetSystemTimeAsFileTime to discover if they are operating within a virtual machine or sandbox, or may be able to identify a sandbox accelerating time by sampling and calculating the expected value for an environment's timestamp before and after execution of a sleep function.",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Delays execution",
                  "match_data": [
                    "(Process #4) ipconfig.exe has a thread which sleeps more than 5 minutes."
                  ]
                }
              ]
            },
            {
              "id": "T1622",
              "name": "Debugger Evasion",
              "link": "https://attack.mitre.org/techniques/T1622/",
              "description": "Adversaries may employ various means to detect and avoid debuggers. Debuggers are typically used by defenders to trace and/or analyze the execution of potential malware payloads.\nDebugger evasion may include changing behaviors based on the results of the checks for the presence of artifacts indicative of a debugged environment. Similar to Virtualization/Sandbox Evasion, if the adversary detects a debugger, they may alter their malware to disengage from the victim or conceal the core functions of the implant. They may also search for debugger artifacts before dropping secondary or additional payloads.\nSpecific checks will vary based on the target and/or adversary. On Windows, this may involve Native API function calls such as IsDebuggerPresent() and  NtQueryInformationProcess(), or manually checking the BeingDebugged flag of the Process Environment Block (PEB). On Linux, this may involve querying /proc/self/status for the TracerPID field, which indicates whether or not the process is being traced by dynamic analysis tools. Other checks for debugging artifacts may also seek to enumerate hardware breakpoints, interrupt assembly opcodes, time checks, or measurements if exceptions are raised in the current process (assuming a present debugger would “swallow” or handle the potential error).\nMalware may also leverage Structured Exception Handling (SEH) to detect debuggers by throwing an exception and detecting whether the process is suspended. SEH handles both hardware and software expectations, providing control over the exceptions including support for debugging. If a debugger is present, the program’s control will be transferred to the debugger, and the execution of the code will be suspended. If the debugger is not present, control will be transferred to the SEH handler, which will automatically handle the exception and allow the program’s execution to continue.\nAdversaries may use the information learned from these debugger checks during automated discovery to shape follow-on behaviors. Debuggers can also be evaded by detaching the process or flooding debug logs with meaningless data via messages produced by looping Native API function calls such as OutputDebugStringW().",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Tries to detect kernel debugger"
                },
                {
                  "severity": "LOW",
                  "description": "Tries to detect debugger"
                }
              ]
            }
          ]
        },
        {
          "id": "TA0005",
          "name": "Defense Evasion",
          "link": "https://attack.mitre.org/tactics/TA0005/",
          "description": "The adversary is trying to avoid being detected.\n\nDefense Evasion consists of techniques that adversaries use to avoid detection throughout their compromise. Techniques used for defense evasion include uninstalling/disabling security software or obfuscating/encrypting data and scripts. Adversaries also leverage and abuse trusted processes to hide and masquerade their malware. Other tactics’ techniques are cross-listed here when those techniques include the added benefit of subverting defenses. ",
          "techniques": [
            {
              "id": "T1027",
              "name": "Obfuscated Files or Information",
              "link": "https://attack.mitre.org/techniques/T1027/",
              "description": "Adversaries may attempt to make an executable or file difficult to discover or analyze by encrypting, encoding, or otherwise obfuscating its contents on the system or in transit. This is common behavior that can be used across different platforms and the network to evade defenses. \nPayloads may be compressed, archived, or encrypted in order to avoid detection. These payloads may be used during Initial Access or later to mitigate detection. Sometimes a user's action may be required to open and Deobfuscate/Decode Files or Information for User Execution. The user may also be required to input a password to open a password protected compressed/encrypted file that was provided by the adversary.  Adversaries may also use compressed or archived scripts, such as JavaScript. \nPortions of files can also be encoded to hide the plain-text strings that would otherwise help defenders with discovery.  Payloads may also be split into separate, seemingly benign files that only reveal malicious functionality when reassembled. \nAdversaries may also abuse Command Obfuscation to obscure commands executed from payloads or directly via Command and Scripting Interpreter. Environment variables, aliases, characters, and other platform/language specific semantics can be used to evade signature based detections and application control mechanisms.   "
            },
            {
              "id": "T1027.002",
              "name": "Software Packing",
              "link": "https://attack.mitre.org/techniques/T1027/002/",
              "description": "Adversaries may perform software packing or virtual machine software protection to conceal their code. Software packing is a method of compressing or encrypting an executable. Packing an executable changes the file signature in an attempt to avoid signature-based detection. Most decompression techniques decompress the executable code in memory. Virtual machine software protection translates an executable's original code into a special format that only a special virtual machine can run. A virtual machine is then called to run this code. \nUtilities used to perform software packing are called packers. Example packers are MPRESS and UPX. A more comprehensive list of known packers is available, but adversaries may create their own packing techniques that do not leave the same artifacts as well-known packers to evade defenses.  ",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Creates a page with write and execute permissions"
                },
                {
                  "severity": "INFO",
                  "description": "Overwrites code",
                  "match_data": [
                    "(Process #35) iexplore.exe overwrites code to possibly hide behavior."
                  ]
                }
              ]
            },
            {
              "id": "T1055",
              "name": "Process Injection",
              "link": "https://attack.mitre.org/techniques/T1055/",
              "description": "Adversaries may inject code into processes in order to evade process-based defenses as well as possibly elevate privileges. Process injection is a method of executing arbitrary code in the address space of a separate live process. Running code in the context of another process may allow access to the process's memory, system/network resources, and possibly elevated privileges. Execution via process injection may also evade detection from security products since the execution is masked under a legitimate process. \nThere are many different ways to inject code into a process, many of which abuse legitimate functionalities. These implementations exist for every major OS but are typically platform specific. \nMore sophisticated samples may perform multiple process injections to segment modules and further evade detection, utilizing named pipes or other inter-process communication (IPC) mechanisms as a communication channel. ",
              "signatures": [
                {
                  "severity": "HIGH",
                  "description": "Writes into the memory of another process",
                  "match_data": [
                    "(Process #2) ordinazione d'acquisto pif.exe modifies memory of (process #3) explorer.exe.",
                    "(Process #4) ipconfig.exe modifies memory of (process #3) explorer.exe.",
                    "(Process #2) ordinazione d'acquisto pif.exe modifies memory of (process #4) ipconfig.exe.",
                    "(Process #4) ipconfig.exe modifies memory of (process #7) iexplore.exe.",
                    "(Process #4) ipconfig.exe modifies memory of (process #8) 3dftp.exe.",
                    "(Process #4) ipconfig.exe modifies memory of (process #9) absolutetelnet.exe.",
                    "(Process #4) ipconfig.exe modifies memory of (process #10) alftp.exe.",
                    "(Process #4) ipconfig.exe modifies memory of (process #11) barca.exe.",
                    "(Process #4) ipconfig.exe modifies memory of (process #12) bitkinex.exe.",
                    "(Process #4) ipconfig.exe modifies memory of (process #13) coreftp.exe."
                  ]
                },
                {
                  "severity": "HIGH",
                  "description": "Modifies control flow of another process",
                  "match_data": [
                    "(Process #4) ipconfig.exe alters context of (process #3) explorer.exe.",
                    "(Process #2) ordinazione d'acquisto pif.exe alters context of (process #3) explorer.exe.",
                    "(Process #4) ipconfig.exe alters context of (process #7) iexplore.exe.",
                    "(Process #4) ipconfig.exe alters context of (process #8) 3dftp.exe.",
                    "(Process #4) ipconfig.exe alters context of (process #9) absolutetelnet.exe.",
                    "(Process #4) ipconfig.exe alters context of (process #10) alftp.exe.",
                    "(Process #4) ipconfig.exe alters context of (process #11) barca.exe.",
                    "(Process #4) ipconfig.exe alters context of (process #12) bitkinex.exe.",
                    "(Process #4) ipconfig.exe alters context of (process #13) coreftp.exe.",
                    "(Process #4) ipconfig.exe alters context of (process #14) far.exe."
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "Modifies control flow of a process started from a created or modified executable",
                  "match_data": [
                    "(Process #1) ordinazione d'acquisto pif.exe alters context of (process #2) ordinazione d'acquisto pif.exe."
                  ]
                }
              ]
            },
            {
              "id": "T1055.012",
              "name": "Process Hollowing",
              "link": "https://attack.mitre.org/techniques/T1055/012/",
              "description": "Adversaries may inject malicious code into suspended and hollowed processes in order to evade process-based defenses. Process hollowing is a method of executing arbitrary code in the address space of a separate live process.  \nProcess hollowing is commonly performed by creating a process in a suspended state then unmapping/hollowing its memory, which can then be replaced with malicious code. A victim process can be created with native Windows API calls such as CreateProcess, which includes a flag to suspend the processes primary thread. At this point the process can be unmapped using APIs calls such as ZwUnmapViewOfSection or NtUnmapViewOfSection  before being written to, realigned to the injected code, and resumed via VirtualAllocEx, WriteProcessMemory, SetThreadContext, then ResumeThread respectively.\nThis is very similar to Thread Local Storage but creates a new process rather than targeting an existing process. This behavior will likely not result in elevated privileges since the injected process was spawned from (and thus inherits the security context) of the injecting process. However, execution via process hollowing may also evade detection from security products since the execution is masked under a legitimate process. ",
              "signatures": [
                {
                  "severity": "HIGH",
                  "description": "Process Hollowing",
                  "match_data": [
                    "(Process #1) ordinazione d'acquisto pif.exe hollows (process #2) ordinazione d'acquisto pif.exe."
                  ]
                }
              ]
            },
            {
              "id": "T1070",
              "name": "Indicator Removal",
              "link": "https://attack.mitre.org/techniques/T1070/",
              "description": "Adversaries may delete or modify artifacts generated within systems to remove evidence of their presence or hinder defenses. Various artifacts may be created by an adversary or something that can be attributed to an adversary’s actions. Typically these artifacts are used as defensive indicators related to monitored events, such as strings from downloaded files, logs that are generated from user actions, and other data analyzed by defenders. Location, format, and type of artifact (such as command or login history) are often specific to each platform.\nRemoval of these indicators may interfere with event collection, reporting, or other processes used to detect intrusion activity. This may compromise the integrity of security solutions by causing notable events to go unreported. This activity may also impede forensic analysis and incident response, due to lack of sufficient data to determine what occurred."
            },
            {
              "id": "T1070.004",
              "name": "File Deletion",
              "link": "https://attack.mitre.org/techniques/T1070/004/",
              "description": "Adversaries may delete files left behind by the actions of their intrusion activity. Malware, tools, or other non-native files dropped or created on a system by an adversary (ex: Ingress Tool Transfer) may leave traces to indicate to what was done within a network and how. Removal of these files can occur during an intrusion, or as part of a post-intrusion process to minimize the adversary's footprint.\nThere are tools available from the host operating system to perform cleanup, but adversaries may use other tools as well. Examples of built-in Command and Scripting Interpreter functions include del on Windows, rm or unlink on Linux and macOS, and rm on ESXi.",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Deletes file after execution",
                  "match_data": [
                    "(Process #5) cmd.exe deletes executed executable \"\\??\\C:\\Users\\RDhJ0CNFevzX\\Desktop\\Ordinazione d'acquisto pif.exe\"."
                  ]
                }
              ]
            },
            {
              "id": "T1112",
              "name": "Modify Registry",
              "link": "https://attack.mitre.org/techniques/T1112/",
              "description": "Adversaries may interact with the Windows Registry as part of a variety of other techniques to aid in defense evasion, persistence, and execution.\nAccess to specific areas of the Registry depends on account permissions, with some keys requiring administrator-level access. The built-in Windows command-line utility Reg may be used for local or remote Registry modification. Other tools, such as remote access tools, may also contain functionality to interact with the Registry through the Windows API.\nThe Registry may be modified in order to hide configuration information or malicious payloads via Obfuscated Files or Information. The Registry may also be modified to Impair Defenses, such as by enabling macros for all Microsoft Office products, allowing privilege escalation without alerting the user, increasing the maximum number of allowed outbound requests, and/or modifying systems to store plaintext credentials in memory.\nThe Registry of a remote system may be modified to aid in execution of files as part of lateral movement. It requires the remote Registry service to be running on the target system. Often Valid Accounts are required, along with access to the remote system's SMB/Windows Admin Shares for RPC communication.\nFinally, Registry modifications may also include actions to hide keys, such as prepending key names with a null character, which will cause an error and/or be ignored when read via Reg or other utilities using the Win32 API. Adversaries may abuse these pseudo-hidden keys to conceal payloads/commands used to maintain persistence.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Installs system startup script or application"
                }
              ]
            },
            {
              "id": "T1497",
              "name": "Virtualization/Sandbox Evasion",
              "link": "https://attack.mitre.org/techniques/T1497/",
              "description": "Adversaries may employ various means to detect and avoid virtualization and analysis environments. This may include changing behaviors based on the results of checks for the presence of artifacts indicative of a virtual machine environment (VME) or sandbox. If the adversary detects a VME, they may alter their malware to disengage from the victim or conceal the core functions of the implant. They may also search for VME artifacts before dropping secondary or additional payloads. Adversaries may use the information learned from Virtualization/Sandbox Evasion during automated discovery to shape follow-on behaviors.\nAdversaries may use several methods to accomplish Virtualization/Sandbox Evasion such as checking for security monitoring tools (e.g., Sysinternals, Wireshark, etc.) or other system artifacts associated with analysis or virtualization. Adversaries may also check for legitimate user activity to help determine if it is in an analysis environment. Additional methods include use of sleep timers or loops within malware code to avoid operating within a temporary sandbox."
            },
            {
              "id": "T1497.003",
              "name": "Time Based Checks",
              "link": "https://attack.mitre.org/techniques/T1497/003/",
              "description": "Adversaries may employ various time-based methods to detect virtualization and analysis environments, particularly those that attempt to manipulate time mechanisms to simulate longer elapses of time. This may include enumerating time-based properties, such as uptime or the system clock. \nAdversaries may use calls like GetTickCount and GetSystemTimeAsFileTime to discover if they are operating within a virtual machine or sandbox, or may be able to identify a sandbox accelerating time by sampling and calculating the expected value for an environment's timestamp before and after execution of a sleep function.",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Delays execution",
                  "match_data": [
                    "(Process #4) ipconfig.exe has a thread which sleeps more than 5 minutes."
                  ]
                }
              ]
            },
            {
              "id": "T1562",
              "name": "Impair Defenses",
              "link": "https://attack.mitre.org/techniques/T1562/",
              "description": "Adversaries may maliciously modify components of a victim environment in order to hinder or disable defensive mechanisms. This not only involves impairing preventative defenses, such as firewalls and anti-virus, but also detection capabilities that defenders can use to audit activity and identify malicious behavior. This may also span both native defenses as well as supplemental capabilities installed by users and administrators.\nAdversaries may also impair routine operations that contribute to defensive hygiene, such as blocking users from logging out, preventing a system from shutting down, or disabling or modifying the update process. Adversaries could also target event aggregation and analysis mechanisms, or otherwise disrupt these procedures by altering other system components. These restrictions can further enable malicious operations as well as the continued propagation of incidents."
            },
            {
              "id": "T1562.001",
              "name": "Disable or Modify Tools",
              "link": "https://attack.mitre.org/techniques/T1562/001/",
              "description": "Adversaries may modify and/or disable security tools to avoid possible detection of their malware/tools and activities. This may take many forms, such as killing security software processes or services, modifying / deleting Registry keys or configuration files so that tools do not operate properly, or other methods to interfere with security tools scanning or reporting information. Adversaries may also disable updates to prevent the latest security patches from reaching tools on victim systems.\nAdversaries may trigger a denial-of-service attack via legitimate system processes. It has been previously observed that the Windows Time Travel Debugging (TTD) monitor driver can be used to initiate a debugging session for a security tool (e.g., an EDR) and render the tool non-functional.  By hooking the debugger into the EDR process, all child processes from the EDR will be automatically suspended. The attacker can terminate any EDR helper processes (unprotected by Windows Protected Process Light) by abusing the Process Explorer driver. In combination this will halt any attempt to restart services and cause the tool to crash.\nAdversaries may also tamper with artifacts deployed and utilized by security tools. Security tools may make dynamic changes to system components in order to maintain visibility into specific events. For example, security products may load their own modules and/or modify those loaded by processes to facilitate data collection. Similar to Indicator Blocking, adversaries may unhook or otherwise modify these features added by tools (especially those that exist in userland or are otherwise potentially accessible to adversaries) to avoid detection. For example, adversaries may abuse the Windows process mitigation policy to block certain endpoint detection and response (EDR) products from loading their user-mode code via DLLs. By spawning a process with the PROCESS_CREATION_MITIGATION_POLICY_BLOCK_NON_MICROSOFT_BINARIES_ALWAYS_ON attribute using API calls like UpdateProcThreadAttribute, adversaries may evade detection by endpoint security solutions that rely on DLLs that are not signed by Microsoft. Alternatively, they may add new directories to an EDR tool’s exclusion list, enabling them to hide malicious files via File/Path Exclusions.\nAdversaries may also focus on specific applications such as Sysmon. For example, the “Start” and “Enable” values in HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\WMI\\Autologger\\EventLog-Microsoft-Windows-Sysmon-Operational may be modified to tamper with and potentially disable Sysmon logging. \nOn network devices, adversaries may attempt to skip digital signature verification checks by altering startup configuration files and effectively disabling firmware verification that typically occurs at boot.\nIn cloud environments, tools disabled by adversaries may include cloud monitoring agents that report back to services such as AWS CloudWatch or Google Cloud Monitor.\nFurthermore, although defensive tools may have anti-tampering mechanisms, adversaries may abuse tools such as legitimate rootkit removal kits to impair and/or disable these tools. For example, adversaries have used tools such as GMER to find and shut down hidden processes and antivirus software on infected systems.\nAdditionally, adversaries may exploit legitimate drivers from anti-virus software to gain access to kernel space (i.e. Exploitation for Privilege Escalation), which may lead to bypassing anti-tampering features.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Modifies native system functions",
                  "match_data": [
                    "(Process #35) iexplore.exe modifies native system functions, possibly to change control flow."
                  ]
                }
              ]
            },
            {
              "id": "T1564",
              "name": "Hide Artifacts",
              "link": "https://attack.mitre.org/techniques/T1564/",
              "description": "Adversaries may attempt to hide artifacts associated with their behaviors to evade detection. Operating systems may have features to hide various artifacts, such as important system files and administrative task execution, to avoid disrupting user work environments and prevent users from changing files or features on the system. Adversaries may abuse these features to hide artifacts such as files, directories, user accounts, or other system activity to evade detection.\nAdversaries may also attempt to hide artifacts associated with malicious behavior by creating computing regions that are isolated from common security instrumentation, such as through the use of virtualization technology."
            },
            {
              "id": "T1564.003",
              "name": "Hidden Window",
              "link": "https://attack.mitre.org/techniques/T1564/003/",
              "description": "Adversaries may use hidden windows to conceal malicious activity from the plain sight of users. In some cases, windows that would typically be displayed when an application carries out an operation can be hidden. This may be utilized by system administrators to avoid disrupting user work environments when carrying out administrative tasks. \nAdversaries may abuse these functionalities to hide otherwise visible windows from users so as not to alert the user to adversary activity on the system.\nOn macOS, the configurations for how applications run are listed in property list (plist) files. One of the tags in these files can be apple.awt.UIElement, which allows for Java applications to prevent the application's icon from appearing in the Dock. A common use for this is when applications run in the system tray, but don't also want to show up in the Dock.\nSimilarly, on Windows there are a variety of features in scripting languages, such as PowerShell, Jscript, and Visual Basic to make windows hidden. One example of this is powershell.exe -WindowStyle Hidden.\nThe Windows Registry can also be edited to hide application windows from the current user. For example, by setting the WindowPosition subkey in the HKEY_CURRENT_USER\\Console\\%SystemRoot%_System32_WindowsPowerShell_v1.0_PowerShell.exe Registry key to a maximum value, PowerShell windows will open off screen and be hidden.\nIn addition, Windows supports the CreateDesktop() API that can create a hidden desktop window with its own corresponding explorer.exe process.  All applications running on the hidden desktop window, such as a hidden VNC (hVNC) session, will be invisible to other desktops windows.\nAdversaries may also leverage cmd.exe as a parent process, and then utilize a LOLBin, such as DeviceCredentialDeployment.exe, to hide windows.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Creates process with hidden window",
                  "match_data": [
                    "(Process #1) ordinazione d'acquisto pif.exe starts (process #2) ordinazione d'acquisto pif.exe with a hidden window.",
                    "(Process #4) ipconfig.exe starts (process #5) cmd.exe with a hidden window.",
                    "(Process #3) explorer.exe starts (process #37) v2kdr06-.exe with a hidden window."
                  ]
                }
              ]
            },
            {
              "id": "T1622",
              "name": "Debugger Evasion",
              "link": "https://attack.mitre.org/techniques/T1622/",
              "description": "Adversaries may employ various means to detect and avoid debuggers. Debuggers are typically used by defenders to trace and/or analyze the execution of potential malware payloads.\nDebugger evasion may include changing behaviors based on the results of the checks for the presence of artifacts indicative of a debugged environment. Similar to Virtualization/Sandbox Evasion, if the adversary detects a debugger, they may alter their malware to disengage from the victim or conceal the core functions of the implant. They may also search for debugger artifacts before dropping secondary or additional payloads.\nSpecific checks will vary based on the target and/or adversary. On Windows, this may involve Native API function calls such as IsDebuggerPresent() and  NtQueryInformationProcess(), or manually checking the BeingDebugged flag of the Process Environment Block (PEB). On Linux, this may involve querying /proc/self/status for the TracerPID field, which indicates whether or not the process is being traced by dynamic analysis tools. Other checks for debugging artifacts may also seek to enumerate hardware breakpoints, interrupt assembly opcodes, time checks, or measurements if exceptions are raised in the current process (assuming a present debugger would “swallow” or handle the potential error).\nMalware may also leverage Structured Exception Handling (SEH) to detect debuggers by throwing an exception and detecting whether the process is suspended. SEH handles both hardware and software expectations, providing control over the exceptions including support for debugging. If a debugger is present, the program’s control will be transferred to the debugger, and the execution of the code will be suspended. If the debugger is not present, control will be transferred to the SEH handler, which will automatically handle the exception and allow the program’s execution to continue.\nAdversaries may use the information learned from these debugger checks during automated discovery to shape follow-on behaviors. Debuggers can also be evaded by detaching the process or flooding debug logs with meaningless data via messages produced by looping Native API function calls such as OutputDebugStringW().",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Tries to detect kernel debugger"
                },
                {
                  "severity": "LOW",
                  "description": "Tries to detect debugger"
                }
              ]
            }
          ]
        },
        {
          "id": "TA0004",
          "name": "Privilege Escalation",
          "link": "https://attack.mitre.org/tactics/TA0004/",
          "description": "The adversary is trying to gain higher-level permissions.\n\nPrivilege Escalation consists of techniques that adversaries use to gain higher-level permissions on a system or network. Adversaries can often enter and explore a network with unprivileged access but require elevated permissions to follow through on their objectives. Common approaches are to take advantage of system weaknesses, misconfigurations, and vulnerabilities. Examples of elevated access include: \n\n* SYSTEM/root level\n* local administrator\n* user account with admin-like access \n* user accounts with access to specific system or perform specific function\n\nThese techniques often overlap with Persistence techniques, as OS features that let an adversary persist can execute in an elevated context.  ",
          "techniques": [
            {
              "id": "T1055",
              "name": "Process Injection",
              "link": "https://attack.mitre.org/techniques/T1055/",
              "description": "Adversaries may inject code into processes in order to evade process-based defenses as well as possibly elevate privileges. Process injection is a method of executing arbitrary code in the address space of a separate live process. Running code in the context of another process may allow access to the process's memory, system/network resources, and possibly elevated privileges. Execution via process injection may also evade detection from security products since the execution is masked under a legitimate process. \nThere are many different ways to inject code into a process, many of which abuse legitimate functionalities. These implementations exist for every major OS but are typically platform specific. \nMore sophisticated samples may perform multiple process injections to segment modules and further evade detection, utilizing named pipes or other inter-process communication (IPC) mechanisms as a communication channel. ",
              "signatures": [
                {
                  "severity": "HIGH",
                  "description": "Writes into the memory of another process",
                  "match_data": [
                    "(Process #2) ordinazione d'acquisto pif.exe modifies memory of (process #3) explorer.exe.",
                    "(Process #4) ipconfig.exe modifies memory of (process #3) explorer.exe.",
                    "(Process #2) ordinazione d'acquisto pif.exe modifies memory of (process #4) ipconfig.exe.",
                    "(Process #4) ipconfig.exe modifies memory of (process #7) iexplore.exe.",
                    "(Process #4) ipconfig.exe modifies memory of (process #8) 3dftp.exe.",
                    "(Process #4) ipconfig.exe modifies memory of (process #9) absolutetelnet.exe.",
                    "(Process #4) ipconfig.exe modifies memory of (process #10) alftp.exe.",
                    "(Process #4) ipconfig.exe modifies memory of (process #11) barca.exe.",
                    "(Process #4) ipconfig.exe modifies memory of (process #12) bitkinex.exe.",
                    "(Process #4) ipconfig.exe modifies memory of (process #13) coreftp.exe."
                  ]
                },
                {
                  "severity": "HIGH",
                  "description": "Modifies control flow of another process",
                  "match_data": [
                    "(Process #4) ipconfig.exe alters context of (process #3) explorer.exe.",
                    "(Process #2) ordinazione d'acquisto pif.exe alters context of (process #3) explorer.exe.",
                    "(Process #4) ipconfig.exe alters context of (process #7) iexplore.exe.",
                    "(Process #4) ipconfig.exe alters context of (process #8) 3dftp.exe.",
                    "(Process #4) ipconfig.exe alters context of (process #9) absolutetelnet.exe.",
                    "(Process #4) ipconfig.exe alters context of (process #10) alftp.exe.",
                    "(Process #4) ipconfig.exe alters context of (process #11) barca.exe.",
                    "(Process #4) ipconfig.exe alters context of (process #12) bitkinex.exe.",
                    "(Process #4) ipconfig.exe alters context of (process #13) coreftp.exe.",
                    "(Process #4) ipconfig.exe alters context of (process #14) far.exe."
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "Modifies control flow of a process started from a created or modified executable",
                  "match_data": [
                    "(Process #1) ordinazione d'acquisto pif.exe alters context of (process #2) ordinazione d'acquisto pif.exe."
                  ]
                }
              ]
            },
            {
              "id": "T1055.012",
              "name": "Process Hollowing",
              "link": "https://attack.mitre.org/techniques/T1055/012/",
              "description": "Adversaries may inject malicious code into suspended and hollowed processes in order to evade process-based defenses. Process hollowing is a method of executing arbitrary code in the address space of a separate live process.  \nProcess hollowing is commonly performed by creating a process in a suspended state then unmapping/hollowing its memory, which can then be replaced with malicious code. A victim process can be created with native Windows API calls such as CreateProcess, which includes a flag to suspend the processes primary thread. At this point the process can be unmapped using APIs calls such as ZwUnmapViewOfSection or NtUnmapViewOfSection  before being written to, realigned to the injected code, and resumed via VirtualAllocEx, WriteProcessMemory, SetThreadContext, then ResumeThread respectively.\nThis is very similar to Thread Local Storage but creates a new process rather than targeting an existing process. This behavior will likely not result in elevated privileges since the injected process was spawned from (and thus inherits the security context) of the injecting process. However, execution via process hollowing may also evade detection from security products since the execution is masked under a legitimate process. ",
              "signatures": [
                {
                  "severity": "HIGH",
                  "description": "Process Hollowing",
                  "match_data": [
                    "(Process #1) ordinazione d'acquisto pif.exe hollows (process #2) ordinazione d'acquisto pif.exe."
                  ]
                }
              ]
            },
            {
              "id": "T1547",
              "name": "Boot or Logon Autostart Execution",
              "link": "https://attack.mitre.org/techniques/T1547/",
              "description": "Adversaries may configure system settings to automatically execute a program during system boot or logon to maintain persistence or gain higher-level privileges on compromised systems. Operating systems may have mechanisms for automatically running a program on system boot or account logon. These mechanisms may include automatically executing programs that are placed in specially designated directories or are referenced by repositories that store configuration information, such as the Windows Registry. An adversary may achieve the same goal by modifying or extending features of the kernel.\nSince some boot or logon autostart programs run with higher privileges, an adversary may leverage these to elevate privileges."
            },
            {
              "id": "T1547.001",
              "name": "Registry Run Keys / Startup Folder",
              "link": "https://attack.mitre.org/techniques/T1547/001/",
              "description": "Adversaries may achieve persistence by adding a program to a startup folder or referencing it with a Registry run key. Adding an entry to the \"run keys\" in the Registry or startup folder will cause the program referenced to be executed when a user logs in. These programs will be executed under the context of the user and will have the account's associated permissions level.\nThe following run keys are created by default on Windows systems:\n\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnce\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnce\n\nRun keys may exist under multiple hives. The HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnceEx is also available but is not created by default on Windows Vista and newer. Registry run key entries can reference programs directly or list them as a dependency. For example, it is possible to load a DLL at logon using a \"Depend\" key with RunOnceEx: reg add HKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\RunOnceEx\\0001\\Depend /v 1 /d \"C:\\temp\\evil[.]dll\" \nPlacing a program within a startup folder will also cause that program to execute when a user logs in. There is a startup folder location for individual user accounts as well as a system-wide startup folder that will be checked regardless of which user account logs in. The startup folder path for the current user is C:\\Users\\[Username]\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup. The startup folder path for all users is C:\\ProgramData\\Microsoft\\Windows\\Start Menu\\Programs\\StartUp.\nThe following Registry keys can be used to set startup folder items for persistence:\n\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell Folders\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Shell Folders\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Shell Folders\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell Folders\n\nThe following Registry keys can control automatic startup of services during boot:\n\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServicesOnce\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServicesOnce\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServices\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServices\n\nUsing policy settings to specify startup programs creates corresponding values in either of two Registry keys:\n\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer\\Run\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer\\Run\n\nPrograms listed in the load value of the registry key HKEY_CURRENT_USER\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Windows run automatically for the currently logged-on user.\nBy default, the multistring BootExecute value of the registry key HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\Session Manager is set to autocheck autochk *. This value causes Windows, at startup, to check the file-system integrity of the hard disks if the system has been shut down abnormally. Adversaries can add other programs or processes to this registry value which will automatically launch at boot.\nAdversaries can use these configuration locations to execute malware, such as remote access tools, to maintain persistence through system reboots. Adversaries may also use Masquerading to make the Registry entries look as if they are associated with legitimate programs.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Installs system startup script or application"
                }
              ]
            }
          ]
        },
        {
          "id": "TA0006",
          "name": "Credential Access",
          "link": "https://attack.mitre.org/tactics/TA0006/",
          "description": "The adversary is trying to steal account names and passwords.\n\nCredential Access consists of techniques for stealing credentials like account names and passwords. Techniques used to get credentials include keylogging or credential dumping. Using legitimate credentials can give adversaries access to systems, make them harder to detect, and provide the opportunity to create more accounts to help achieve their goals.",
          "techniques": [
            {
              "id": "T1056",
              "name": "Input Capture",
              "link": "https://attack.mitre.org/techniques/T1056/",
              "description": "Adversaries may use methods of capturing user input to obtain credentials or collect information. During normal system usage, users often provide credentials to various different locations, such as login pages/portals or system dialog boxes. Input capture mechanisms may be transparent to the user (e.g. Credential API Hooking) or rely on deceiving the user into providing input into what they believe to be a genuine service (e.g. Web Portal Capture)."
            },
            {
              "id": "T1056.004",
              "name": "Credential API Hooking",
              "link": "https://attack.mitre.org/techniques/T1056/004/",
              "description": "Adversaries may hook into Windows application programming interface (API) functions and Linux system functions to collect user credentials. Malicious hooking mechanisms may capture API or function calls that include parameters that reveal user authentication credentials. Unlike Keylogging, this technique focuses specifically on API functions that include parameters that reveal user credentials. \nIn Windows, hooking involves redirecting calls to these functions and can be implemented via:\n\nHooks procedures, which intercept and execute designated code in response to events such as messages, keystrokes, and mouse inputs.\nImport address table (IAT) hooking, which use modifications to a process’s IAT, where pointers to imported API functions are stored.\nInline hooking, which overwrites the first bytes in an API function to redirect code flow.\n\nIn Linux and macOS, adversaries may hook into system functions via the LD_PRELOAD (Linux) or DYLD_INSERT_LIBRARIES (macOS) environment variables, which enables loading shared libraries into a program’s address space. For example, an adversary may capture credentials by hooking into the libc read function leveraged by SSH or SCP.",
              "signatures": [
                {
                  "severity": "HIGH",
                  "description": "Adds a hook to a web browser",
                  "match_data": [
                    "(Process #4) ipconfig.exe adds a hook to Internet Explorer for user32.dll:SendMessageA+0x5.",
                    "(Process #4) ipconfig.exe adds a hook to Internet Explorer for ntdll.dll:@RtlpAllocateHeap@24+0x5e0.",
                    "(Process #4) ipconfig.exe adds a hook to Internet Explorer for ntdll.dll:RtlFreeHeap+0x108.",
                    "(Process #4) ipconfig.exe adds a hook to Internet Explorer for ntdll.dll:RtlpLocateActivationContextSection+0xf0.",
                    "(Process #4) ipconfig.exe adds a hook to Internet Explorer for ntdll.dll:@RtlpReAllocateHeap@16+0xf46.",
                    "(Process #4) ipconfig.exe adds a hook to Internet Explorer for ntdll.dll:@RtlpReAllocateHeap@16+0xf4e.",
                    "(Process #4) ipconfig.exe adds a hook to Internet Explorer for ntdll.dll:@RtlpReAllocateHeap@16+0xf45.",
                    "(Process #4) ipconfig.exe adds a hook to Internet Explorer for ntdll.dll:RtlpHpFreeHeap+0x66.",
                    "(Process #4) ipconfig.exe adds a hook to Internet Explorer for ntdll.dll:RtlpGenerateInheritedAce+0x37.",
                    "(Process #4) ipconfig.exe adds a hook to Internet Explorer for ntdll.dll:@RtlpReAllocateHeap@16+0xf53."
                  ]
                }
              ]
            },
            {
              "id": "T1555",
              "name": "Credentials from Password Stores",
              "link": "https://attack.mitre.org/techniques/T1555/",
              "description": "Adversaries may search for common password storage locations to obtain user credentials. Passwords are stored in several places on a system, depending on the operating system or application holding the credentials. There are also specific applications and services that store passwords to make them easier for users to manage and maintain, such as password managers and cloud secrets vaults. Once credentials are obtained, they can be used to perform lateral movement and access restricted information."
            },
            {
              "id": "T1555.003",
              "name": "Credentials from Web Browsers",
              "link": "https://attack.mitre.org/techniques/T1555/003/",
              "description": "Adversaries may acquire credentials from web browsers by reading files specific to the target browser. Web browsers commonly save credentials such as website usernames and passwords so that they do not need to be entered manually in the future. Web browsers typically store the credentials in an encrypted format within a credential store; however, methods exist to extract plaintext credentials from web browsers.\nFor example, on Windows systems, encrypted credentials may be obtained from Google Chrome by reading a database file, AppData\\Local\\Google\\Chrome\\User Data\\Default\\Login Data and executing a SQL query: SELECT action_url, username_value, password_value FROM logins;. The plaintext password can then be obtained by passing the encrypted credentials to the Windows API function CryptUnprotectData, which uses the victim’s cached logon credentials as the decryption key.\nAdversaries have executed similar procedures for common web browsers such as FireFox, Safari, Edge, etc. Windows stores Internet Explorer and Microsoft Edge credentials in Credential Lockers managed by the Windows Credential Manager.\nAdversaries may also acquire credentials by searching web browser process memory for patterns that commonly match credentials.\nAfter acquiring credentials from web browsers, adversaries may attempt to recycle the credentials across different systems and/or accounts in order to expand access. This can result in significantly furthering an adversary's objective in cases where credentials gained from web browsers overlap with privileged accounts (e.g. domain administrator).",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Reads sensitive browser data"
                }
              ]
            }
          ]
        },
        {
          "id": "TA0011",
          "name": "Command and Control",
          "link": "https://attack.mitre.org/tactics/TA0011/",
          "description": "The adversary is trying to communicate with compromised systems to control them.\n\nCommand and Control consists of techniques that adversaries may use to communicate with systems under their control within a victim network. Adversaries commonly attempt to mimic normal, expected traffic to avoid detection. There are many ways an adversary can establish command and control with various levels of stealth depending on the victim’s network structure and defenses.",
          "techniques": [
            {
              "id": "T1071",
              "name": "Application Layer Protocol",
              "link": "https://attack.mitre.org/techniques/T1071/",
              "description": "Adversaries may communicate using OSI application layer protocols to avoid detection/network filtering by blending in with existing traffic. Commands to the remote system, and often the results of those commands, will be embedded within the protocol traffic between the client and server. \nAdversaries may utilize many different protocols, including those used for web browsing, transferring files, electronic mail, DNS, or publishing/subscribing. For connections that occur internally within an enclave (such as those between a proxy or pivot node and other nodes), commonly used protocols are SMB, SSH, or RDP. "
            },
            {
              "id": "T1071.004",
              "name": "DNS",
              "link": "https://attack.mitre.org/techniques/T1071/004/",
              "description": "Adversaries may communicate using the Domain Name System (DNS) application layer protocol to avoid detection/network filtering by blending in with existing traffic. Commands to the remote system, and often the results of those commands, will be embedded within the protocol traffic between the client and server. \nThe DNS protocol serves an administrative function in computer networking and thus may be very common in environments. DNS traffic may also be allowed even before network authentication is completed. DNS packets contain many fields and headers in which data can be concealed. Often known as DNS tunneling, adversaries may abuse DNS to communicate with systems under their control within a victim network while also mimicking normal, expected traffic.\nDNS beaconing may be used to send commands to remote systems via DNS queries. A DNS beacon is created by tunneling DNS traffic (i.e. Protocol Tunneling). The commands may be embedded into different DNS records, for example, TXT or A records. DNS beacons may be difficult to detect because the beacons infrequently communicate with infected devices. Infrequent communication conceals the malicious DNS traffic with normal DNS traffic. ",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Performs DNS request",
                  "match_data": [
                    "(Process #3) explorer.exe fails to resolve hostname \"www.sy609.top\"",
                    "(Process #3) explorer.exe fails to resolve hostname \"www.jalki123fa.app\"",
                    "(Process #3) explorer.exe fails to resolve hostname \"www.88865.xyz\"",
                    "(Process #3) explorer.exe resolves hostname \"www.rolan.shop\" to IP \"144.34.170.93\".",
                    "(Process #3) explorer.exe fails to resolve hostname \"www.eraka189sleepguy.xyz\"",
                    "(Process #3) explorer.exe fails to resolve hostname \"www.landestinecreations.shop\"",
                    "(Process #3) explorer.exe fails to resolve hostname \"www.vow0bfd7z3-wc8g.shop\"",
                    "(Process #3) explorer.exe fails to resolve hostname \"www.lphagatherhappyhoney.forum\"",
                    "(Process #3) explorer.exe fails to resolve hostname \"www.d25124166.cfd\"",
                    "(Process #3) explorer.exe fails to resolve hostname \"www.ov-fze-pay.top\""
                  ]
                }
              ]
            },
            {
              "id": "T1095",
              "name": "Non-Application Layer Protocol",
              "link": "https://attack.mitre.org/techniques/T1095/",
              "description": "Adversaries may use an OSI non-application layer protocol for communication between host and C2 server or among infected hosts within a network. The list of possible protocols is extensive. Specific examples include use of network layer protocols, such as the Internet Control Message Protocol (ICMP), transport layer protocols, such as the User Datagram Protocol (UDP), session layer protocols, such as Socket Secure (SOCKS), as well as redirected/tunneled protocols, such as Serial over LAN (SOL).\nICMP communication between hosts is one example. Because ICMP is part of the Internet Protocol Suite, it is required to be implemented by all IP-compatible hosts. However, it is not as commonly monitored as other Internet Protocols such as TCP or UDP and may be used by adversaries to hide communications.\nIn ESXi environments, adversaries may leverage the Virtual Machine Communication Interface (VMCI) for communication between guest virtual machines and the ESXi host. This traffic is similar to client-server communications on traditional network sockets but is localized to the physical machine running the ESXi host, meaning it does not traverse external networks (routers, switches). This results in communications that are invisible to external monitoring and standard networking tools like tcpdump, netstat, nmap, and Wireshark. By adding a VMCI backdoor to a compromised ESXi host, adversaries may persistently regain access from any guest VM to the compromised ESXi host’s backdoor, regardless of network segmentation or firewall rules in place.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Connects to remote host",
                  "match_data": [
                    "(Process #3) explorer.exe opens an outgoing TCP connection to host \"144.34.170.93:80\".",
                    "(Process #3) explorer.exe opens an outgoing TCP connection to host \"15.197.148.33:80\".",
                    "(Process #3) explorer.exe opens an outgoing TCP connection to host \"203.161.52.166:80\".",
                    "(Process #3) explorer.exe opens an outgoing TCP connection to host \"65.109.65.153:80\"."
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0002",
          "name": "Execution",
          "link": "https://attack.mitre.org/tactics/TA0002/",
          "description": "The adversary is trying to run malicious code.\n\nExecution consists of techniques that result in adversary-controlled code running on a local or remote system. Techniques that run malicious code are often paired with techniques from all other tactics to achieve broader goals, like exploring a network or stealing data. For example, an adversary might use a remote access tool to run a PowerShell script that does Remote System Discovery. ",
          "techniques": [
            {
              "id": "T1106",
              "name": "Native API",
              "link": "https://attack.mitre.org/techniques/T1106/",
              "description": "Adversaries may interact with the native OS application programming interface (API) to execute behaviors. Native APIs provide a controlled means of calling low-level OS services within the kernel, such as those involving hardware/devices, memory, and processes. These native APIs are leveraged by the OS during system boot (when other system components are not yet initialized) as well as carrying out tasks and requests during routine operations.\nAdversaries may abuse these OS API functions as a means of executing behaviors. Similar to Command and Scripting Interpreter, the native API and its hierarchy of interfaces provide mechanisms to interact with and utilize various components of a victimized system.\nNative API functions (such as NtCreateProcess) may be directed invoked via system calls / syscalls, but these features are also often exposed to user-mode applications via interfaces and libraries. For example, functions such as the Windows API CreateProcess() or GNU fork() will allow programs and scripts to start other processes. This may allow API callers to execute a binary, run a CLI command, load modules, etc. as thousands of similar API functions exist for various system operations.\nHigher level software frameworks, such as Microsoft .NET and macOS Cocoa, are also available to interact with native APIs. These frameworks typically provide language wrappers/abstractions to API functionalities and are designed for ease-of-use/portability of code.\nAdversaries may use assembly to directly or in-directly invoke syscalls in an attempt to subvert defensive sensors and detection signatures such as user mode API-hooks. Adversaries may also attempt to tamper with sensors and defensive tools associated with API monitoring, such as unhooking monitored functions via Disable or Modify Tools.",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Tries to detect kernel debugger"
                }
              ]
            }
          ]
        },
        {
          "id": "TA0003",
          "name": "Persistence",
          "link": "https://attack.mitre.org/tactics/TA0003/",
          "description": "The adversary is trying to maintain their foothold.\n\nPersistence consists of techniques that adversaries use to keep access to systems across restarts, changed credentials, and other interruptions that could cut off their access. Techniques used for persistence include any access, action, or configuration changes that let them maintain their foothold on systems, such as replacing or hijacking legitimate code or adding startup code. ",
          "techniques": [
            {
              "id": "T1112",
              "name": "Modify Registry",
              "link": "https://attack.mitre.org/techniques/T1112/",
              "description": "Adversaries may interact with the Windows Registry as part of a variety of other techniques to aid in defense evasion, persistence, and execution.\nAccess to specific areas of the Registry depends on account permissions, with some keys requiring administrator-level access. The built-in Windows command-line utility Reg may be used for local or remote Registry modification. Other tools, such as remote access tools, may also contain functionality to interact with the Registry through the Windows API.\nThe Registry may be modified in order to hide configuration information or malicious payloads via Obfuscated Files or Information. The Registry may also be modified to Impair Defenses, such as by enabling macros for all Microsoft Office products, allowing privilege escalation without alerting the user, increasing the maximum number of allowed outbound requests, and/or modifying systems to store plaintext credentials in memory.\nThe Registry of a remote system may be modified to aid in execution of files as part of lateral movement. It requires the remote Registry service to be running on the target system. Often Valid Accounts are required, along with access to the remote system's SMB/Windows Admin Shares for RPC communication.\nFinally, Registry modifications may also include actions to hide keys, such as prepending key names with a null character, which will cause an error and/or be ignored when read via Reg or other utilities using the Win32 API. Adversaries may abuse these pseudo-hidden keys to conceal payloads/commands used to maintain persistence.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Installs system startup script or application"
                }
              ]
            },
            {
              "id": "T1547",
              "name": "Boot or Logon Autostart Execution",
              "link": "https://attack.mitre.org/techniques/T1547/",
              "description": "Adversaries may configure system settings to automatically execute a program during system boot or logon to maintain persistence or gain higher-level privileges on compromised systems. Operating systems may have mechanisms for automatically running a program on system boot or account logon. These mechanisms may include automatically executing programs that are placed in specially designated directories or are referenced by repositories that store configuration information, such as the Windows Registry. An adversary may achieve the same goal by modifying or extending features of the kernel.\nSince some boot or logon autostart programs run with higher privileges, an adversary may leverage these to elevate privileges."
            },
            {
              "id": "T1547.001",
              "name": "Registry Run Keys / Startup Folder",
              "link": "https://attack.mitre.org/techniques/T1547/001/",
              "description": "Adversaries may achieve persistence by adding a program to a startup folder or referencing it with a Registry run key. Adding an entry to the \"run keys\" in the Registry or startup folder will cause the program referenced to be executed when a user logs in. These programs will be executed under the context of the user and will have the account's associated permissions level.\nThe following run keys are created by default on Windows systems:\n\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnce\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnce\n\nRun keys may exist under multiple hives. The HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnceEx is also available but is not created by default on Windows Vista and newer. Registry run key entries can reference programs directly or list them as a dependency. For example, it is possible to load a DLL at logon using a \"Depend\" key with RunOnceEx: reg add HKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\RunOnceEx\\0001\\Depend /v 1 /d \"C:\\temp\\evil[.]dll\" \nPlacing a program within a startup folder will also cause that program to execute when a user logs in. There is a startup folder location for individual user accounts as well as a system-wide startup folder that will be checked regardless of which user account logs in. The startup folder path for the current user is C:\\Users\\[Username]\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup. The startup folder path for all users is C:\\ProgramData\\Microsoft\\Windows\\Start Menu\\Programs\\StartUp.\nThe following Registry keys can be used to set startup folder items for persistence:\n\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell Folders\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Shell Folders\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Shell Folders\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell Folders\n\nThe following Registry keys can control automatic startup of services during boot:\n\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServicesOnce\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServicesOnce\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServices\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServices\n\nUsing policy settings to specify startup programs creates corresponding values in either of two Registry keys:\n\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer\\Run\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer\\Run\n\nPrograms listed in the load value of the registry key HKEY_CURRENT_USER\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Windows run automatically for the currently logged-on user.\nBy default, the multistring BootExecute value of the registry key HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\Session Manager is set to autocheck autochk *. This value causes Windows, at startup, to check the file-system integrity of the hard disks if the system has been shut down abnormally. Adversaries can add other programs or processes to this registry value which will automatically launch at boot.\nAdversaries can use these configuration locations to execute malware, such as remote access tools, to maintain persistence through system reboots. Adversaries may also use Masquerading to make the Registry entries look as if they are associated with legitimate programs.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Installs system startup script or application"
                }
              ]
            }
          ]
        }
      ]
    },
    "Yomi Hunter": {
      "tactics": [
        {
          "id": "TA0002",
          "name": "Execution",
          "link": "https://attack.mitre.org/tactics/TA0002/",
          "description": "The adversary is trying to run malicious code.\n\nExecution consists of techniques that result in adversary-controlled code running on a local or remote system. Techniques that run malicious code are often paired with techniques from all other tactics to achieve broader goals, like exploring a network or stealing data. For example, an adversary might use a remote access tool to run a PowerShell script that does Remote System Discovery. ",
          "techniques": [
            {
              "id": "T1129",
              "name": "Shared Modules",
              "link": "https://attack.mitre.org/techniques/T1129/",
              "description": "Adversaries may execute malicious payloads via loading shared modules. Shared modules are executable files that are loaded into processes to provide access to reusable code, such as specific custom functions or invoking OS API functions (i.e., Native API).\nAdversaries may use this functionality as a way to execute arbitrary payloads on a victim system. For example, adversaries can modularize functionality of their malware into shared objects that perform various functions such as managing C2 network communications or execution of specific actions on objective.\nThe Linux & macOS module loader can load and execute shared objects from arbitrary local paths. This functionality resides in dlfcn.h in functions such as dlopen and dlsym. Although macOS can execute .so files, common practice uses .dylib files.\nThe Windows module loader can be instructed to load DLLs from arbitrary local paths and arbitrary Universal Naming Convention (UNC) network paths. This functionality resides in NTDLL.dll and is part of the Windows Native API which is called from functions like LoadLibrary at run time.",
              "signatures": [
                {
                  "severity": "UNKNOWN",
                  "description": "The process attempted to dynamically load a malicious function"
                },
                {
                  "severity": "UNKNOWN",
                  "description": "The process tried to load dynamically one or more functions."
                }
              ]
            }
          ]
        },
        {
          "id": "TA0007",
          "name": "Discovery",
          "link": "https://attack.mitre.org/tactics/TA0007/",
          "description": "The adversary is trying to figure out your environment.\n\nDiscovery consists of techniques an adversary may use to gain knowledge about the system and internal network. These techniques help adversaries observe the environment and orient themselves before deciding how to act. They also allow adversaries to explore what they can control and what’s around their entry point in order to discover how it could benefit their current objective. Native operating system tools are often used toward this post-compromise information-gathering objective. ",
          "techniques": [
            {
              "id": "T1057",
              "name": "Process Discovery",
              "link": "https://attack.mitre.org/techniques/T1057/",
              "description": "Adversaries may attempt to get information about running processes on a system. Information obtained could be used to gain an understanding of common software/applications running on systems within the network. Administrator or otherwise elevated access may provide better process details. Adversaries may use the information from Process Discovery during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\nIn Windows environments, adversaries could obtain details on running processes using the Tasklist utility via cmd or Get-Process via PowerShell. Information about processes can also be extracted from the output of Native API calls such as CreateToolhelp32Snapshot. In Mac and Linux, this is accomplished with the ps command. Adversaries may also opt to enumerate processes via /proc. ESXi also supports use of the ps command, as well as esxcli system process list.\nOn network devices, Network Device CLI commands such as show processes can be used to display current running processes.",
              "signatures": [
                {
                  "severity": "UNKNOWN",
                  "description": "The process has tried to detect the debugger probing the use of page guards."
                },
                {
                  "severity": "UNKNOWN",
                  "description": "The process attempted to detect a running debugger using common APIs"
                }
              ]
            }
          ]
        },
        {
          "id": "TA0005",
          "name": "Defense Evasion",
          "link": "https://attack.mitre.org/tactics/TA0005/",
          "description": "The adversary is trying to avoid being detected.\n\nDefense Evasion consists of techniques that adversaries use to avoid detection throughout their compromise. Techniques used for defense evasion include uninstalling/disabling security software or obfuscating/encrypting data and scripts. Adversaries also leverage and abuse trusted processes to hide and masquerade their malware. Other tactics’ techniques are cross-listed here when those techniques include the added benefit of subverting defenses. ",
          "techniques": [
            {
              "id": "T1564",
              "name": "Hide Artifacts",
              "link": "https://attack.mitre.org/techniques/T1564/",
              "description": "Adversaries may attempt to hide artifacts associated with their behaviors to evade detection. Operating systems may have features to hide various artifacts, such as important system files and administrative task execution, to avoid disrupting user work environments and prevent users from changing files or features on the system. Adversaries may abuse these features to hide artifacts such as files, directories, user accounts, or other system activity to evade detection.\nAdversaries may also attempt to hide artifacts associated with malicious behavior by creating computing regions that are isolated from common security instrumentation, such as through the use of virtualization technology."
            },
            {
              "id": "T1564.003",
              "name": "Hidden Window",
              "link": "https://attack.mitre.org/techniques/T1564/003/",
              "description": "Adversaries may use hidden windows to conceal malicious activity from the plain sight of users. In some cases, windows that would typically be displayed when an application carries out an operation can be hidden. This may be utilized by system administrators to avoid disrupting user work environments when carrying out administrative tasks. \nAdversaries may abuse these functionalities to hide otherwise visible windows from users so as not to alert the user to adversary activity on the system.\nOn macOS, the configurations for how applications run are listed in property list (plist) files. One of the tags in these files can be apple.awt.UIElement, which allows for Java applications to prevent the application's icon from appearing in the Dock. A common use for this is when applications run in the system tray, but don't also want to show up in the Dock.\nSimilarly, on Windows there are a variety of features in scripting languages, such as PowerShell, Jscript, and Visual Basic to make windows hidden. One example of this is powershell.exe -WindowStyle Hidden.\nThe Windows Registry can also be edited to hide application windows from the current user. For example, by setting the WindowPosition subkey in the HKEY_CURRENT_USER\\Console\\%SystemRoot%_System32_WindowsPowerShell_v1.0_PowerShell.exe Registry key to a maximum value, PowerShell windows will open off screen and be hidden.\nIn addition, Windows supports the CreateDesktop() API that can create a hidden desktop window with its own corresponding explorer.exe process.  All applications running on the hidden desktop window, such as a hidden VNC (hVNC) session, will be invisible to other desktops windows.\nAdversaries may also leverage cmd.exe as a parent process, and then utilize a LOLBin, such as DeviceCredentialDeployment.exe, to hide windows.",
              "signatures": [
                {
                  "severity": "UNKNOWN",
                  "description": "Detected the creation of a hidden window (common execution hiding technique)"
                }
              ]
            },
            {
              "id": "T1089",
              "name": "Disabling Security Tools",
              "link": "https://attack.mitre.org/techniques/T1089/",
              "description": "Adversaries may disable security tools to avoid possible detection of their tools and activities. This can take the form of killing security software or event logging processes, deleting Registry keys so that tools do not start at run time, or other methods to interfere with security scanning or event reporting.",
              "signatures": [
                {
                  "severity": "UNKNOWN",
                  "description": "The process has tried to suspend a sandbox-related thread (possible sandbox evasion attempt)"
                }
              ]
            }
          ]
        }
      ]
    },
    "Zenbox": {
      "tactics": [
        {
          "id": "TA0003",
          "name": "Persistence",
          "link": "https://attack.mitre.org/tactics/TA0003/",
          "description": "The adversary is trying to maintain their foothold.\n\nPersistence consists of techniques that adversaries use to keep access to systems across restarts, changed credentials, and other interruptions that could cut off their access. Techniques used for persistence include any access, action, or configuration changes that let them maintain their foothold on systems, such as replacing or hijacking legitimate code or adding startup code. ",
          "techniques": [
            {
              "id": "T1574",
              "name": "Hijack Execution Flow",
              "link": "https://attack.mitre.org/techniques/T1574/",
              "description": "Adversaries may execute their own malicious payloads by hijacking the way operating systems run programs. Hijacking execution flow can be for the purposes of persistence, since this hijacked execution may reoccur over time. Adversaries may also use these mechanisms to elevate privileges or evade defenses, such as application control or other restrictions on execution.\nThere are many ways an adversary may hijack the flow of execution, including by manipulating how the operating system locates programs to be executed. How the operating system locates libraries to be used by a program can also be intercepted. Locations where the operating system looks for programs/resources, such as file directories and in the case of Windows the Registry, could also be poisoned to include malicious payloads."
            },
            {
              "id": "T1574.002",
              "name": "DLL Side-Loading",
              "link": "https://attack.mitre.org/techniques/T1574/002/",
              "description": "Adversaries may execute their own malicious payloads by side-loading DLLs. Similar to DLL, side-loading involves hijacking which DLL a program loads. But rather than just planting the DLL within the search order of a program then waiting for the victim application to be invoked, adversaries may directly side-load their payloads by planting then invoking a legitimate application that executes their payload(s).\nSide-loading takes advantage of the DLL search order used by the loader by positioning both the victim application and malicious payload(s) alongside each other. Adversaries likely use side-loading as a means of masking actions they perform under a legitimate, trusted, and potentially elevated system or software process. Benign executables used to side-load payloads may not be flagged during delivery and/or execution. Adversary payloads may also be encrypted/packed or otherwise obfuscated until loaded into the memory of the trusted process.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Tries to load missing DLLs",
                  "match_data": [
                    "mscoree.dll",
                    "apphelp.dll",
                    "kernel.appcore.dll",
                    "version.dll",
                    "vcruntime140_clr0400.dll",
                    "ucrtbase_clr0400.dll",
                    "uxtheme.dll",
                    "windows.storage.dll",
                    "wintypes.dll",
                    "profapi.dll",
                    "bcrypt.dll",
                    "cryptsp.dll",
                    "rsaenh.dll",
                    "cryptbase.dll",
                    "dwrite.dll",
                    "windowscodecs.dll",
                    "wldp.dll",
                    "amsi.dll",
                    "userenv.dll",
                    "msasn1.dll",
                    "gpapi.dll",
                    "wuceffects.dll",
                    "capabilityaccessmanagerclient.dll"
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0004",
          "name": "Privilege Escalation",
          "link": "https://attack.mitre.org/tactics/TA0004/",
          "description": "The adversary is trying to gain higher-level permissions.\n\nPrivilege Escalation consists of techniques that adversaries use to gain higher-level permissions on a system or network. Adversaries can often enter and explore a network with unprivileged access but require elevated permissions to follow through on their objectives. Common approaches are to take advantage of system weaknesses, misconfigurations, and vulnerabilities. Examples of elevated access include: \n\n* SYSTEM/root level\n* local administrator\n* user account with admin-like access \n* user accounts with access to specific system or perform specific function\n\nThese techniques often overlap with Persistence techniques, as OS features that let an adversary persist can execute in an elevated context.  ",
          "techniques": [
            {
              "id": "T1574",
              "name": "Hijack Execution Flow",
              "link": "https://attack.mitre.org/techniques/T1574/",
              "description": "Adversaries may execute their own malicious payloads by hijacking the way operating systems run programs. Hijacking execution flow can be for the purposes of persistence, since this hijacked execution may reoccur over time. Adversaries may also use these mechanisms to elevate privileges or evade defenses, such as application control or other restrictions on execution.\nThere are many ways an adversary may hijack the flow of execution, including by manipulating how the operating system locates programs to be executed. How the operating system locates libraries to be used by a program can also be intercepted. Locations where the operating system looks for programs/resources, such as file directories and in the case of Windows the Registry, could also be poisoned to include malicious payloads."
            },
            {
              "id": "T1574.002",
              "name": "DLL Side-Loading",
              "link": "https://attack.mitre.org/techniques/T1574/002/",
              "description": "Adversaries may execute their own malicious payloads by side-loading DLLs. Similar to DLL, side-loading involves hijacking which DLL a program loads. But rather than just planting the DLL within the search order of a program then waiting for the victim application to be invoked, adversaries may directly side-load their payloads by planting then invoking a legitimate application that executes their payload(s).\nSide-loading takes advantage of the DLL search order used by the loader by positioning both the victim application and malicious payload(s) alongside each other. Adversaries likely use side-loading as a means of masking actions they perform under a legitimate, trusted, and potentially elevated system or software process. Benign executables used to side-load payloads may not be flagged during delivery and/or execution. Adversary payloads may also be encrypted/packed or otherwise obfuscated until loaded into the memory of the trusted process.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Tries to load missing DLLs",
                  "match_data": [
                    "mscoree.dll",
                    "apphelp.dll",
                    "kernel.appcore.dll",
                    "version.dll",
                    "vcruntime140_clr0400.dll",
                    "ucrtbase_clr0400.dll",
                    "uxtheme.dll",
                    "windows.storage.dll",
                    "wintypes.dll",
                    "profapi.dll",
                    "bcrypt.dll",
                    "cryptsp.dll",
                    "rsaenh.dll",
                    "cryptbase.dll",
                    "dwrite.dll",
                    "windowscodecs.dll",
                    "wldp.dll",
                    "amsi.dll",
                    "userenv.dll",
                    "msasn1.dll",
                    "gpapi.dll",
                    "wuceffects.dll",
                    "capabilityaccessmanagerclient.dll"
                  ]
                }
              ]
            },
            {
              "id": "T1055",
              "name": "Process Injection",
              "link": "https://attack.mitre.org/techniques/T1055/",
              "description": "Adversaries may inject code into processes in order to evade process-based defenses as well as possibly elevate privileges. Process injection is a method of executing arbitrary code in the address space of a separate live process. Running code in the context of another process may allow access to the process's memory, system/network resources, and possibly elevated privileges. Execution via process injection may also evade detection from security products since the execution is masked under a legitimate process. \nThere are many different ways to inject code into a process, many of which abuse legitimate functionalities. These implementations exist for every major OS but are typically platform specific. \nMore sophisticated samples may perform multiple process injections to segment modules and further evade detection, utilizing named pipes or other inter-process communication (IPC) mechanisms as a communication channel. ",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "May try to detect the Windows Explorer process (often used for injection)",
                  "match_data": [
                    "Program Manager",
                    "Shell_TrayWnd",
                    "Progman",
                    "Progman#"
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "Injects a PE file into a foreign processes",
                  "match_data": [
                    "C:\\Users\\user\\Desktop\\program.exe base: 400000 value starts with: 4D5A"
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0005",
          "name": "Defense Evasion",
          "link": "https://attack.mitre.org/tactics/TA0005/",
          "description": "The adversary is trying to avoid being detected.\n\nDefense Evasion consists of techniques that adversaries use to avoid detection throughout their compromise. Techniques used for defense evasion include uninstalling/disabling security software or obfuscating/encrypting data and scripts. Adversaries also leverage and abuse trusted processes to hide and masquerade their malware. Other tactics’ techniques are cross-listed here when those techniques include the added benefit of subverting defenses. ",
          "techniques": [
            {
              "id": "T1574",
              "name": "Hijack Execution Flow",
              "link": "https://attack.mitre.org/techniques/T1574/",
              "description": "Adversaries may execute their own malicious payloads by hijacking the way operating systems run programs. Hijacking execution flow can be for the purposes of persistence, since this hijacked execution may reoccur over time. Adversaries may also use these mechanisms to elevate privileges or evade defenses, such as application control or other restrictions on execution.\nThere are many ways an adversary may hijack the flow of execution, including by manipulating how the operating system locates programs to be executed. How the operating system locates libraries to be used by a program can also be intercepted. Locations where the operating system looks for programs/resources, such as file directories and in the case of Windows the Registry, could also be poisoned to include malicious payloads."
            },
            {
              "id": "T1574.002",
              "name": "DLL Side-Loading",
              "link": "https://attack.mitre.org/techniques/T1574/002/",
              "description": "Adversaries may execute their own malicious payloads by side-loading DLLs. Similar to DLL, side-loading involves hijacking which DLL a program loads. But rather than just planting the DLL within the search order of a program then waiting for the victim application to be invoked, adversaries may directly side-load their payloads by planting then invoking a legitimate application that executes their payload(s).\nSide-loading takes advantage of the DLL search order used by the loader by positioning both the victim application and malicious payload(s) alongside each other. Adversaries likely use side-loading as a means of masking actions they perform under a legitimate, trusted, and potentially elevated system or software process. Benign executables used to side-load payloads may not be flagged during delivery and/or execution. Adversary payloads may also be encrypted/packed or otherwise obfuscated until loaded into the memory of the trusted process.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Tries to load missing DLLs",
                  "match_data": [
                    "mscoree.dll",
                    "apphelp.dll",
                    "kernel.appcore.dll",
                    "version.dll",
                    "vcruntime140_clr0400.dll",
                    "ucrtbase_clr0400.dll",
                    "uxtheme.dll",
                    "windows.storage.dll",
                    "wintypes.dll",
                    "profapi.dll",
                    "bcrypt.dll",
                    "cryptsp.dll",
                    "rsaenh.dll",
                    "cryptbase.dll",
                    "dwrite.dll",
                    "windowscodecs.dll",
                    "wldp.dll",
                    "amsi.dll",
                    "userenv.dll",
                    "msasn1.dll",
                    "gpapi.dll",
                    "wuceffects.dll",
                    "capabilityaccessmanagerclient.dll"
                  ]
                }
              ]
            },
            {
              "id": "T1055",
              "name": "Process Injection",
              "link": "https://attack.mitre.org/techniques/T1055/",
              "description": "Adversaries may inject code into processes in order to evade process-based defenses as well as possibly elevate privileges. Process injection is a method of executing arbitrary code in the address space of a separate live process. Running code in the context of another process may allow access to the process's memory, system/network resources, and possibly elevated privileges. Execution via process injection may also evade detection from security products since the execution is masked under a legitimate process. \nThere are many different ways to inject code into a process, many of which abuse legitimate functionalities. These implementations exist for every major OS but are typically platform specific. \nMore sophisticated samples may perform multiple process injections to segment modules and further evade detection, utilizing named pipes or other inter-process communication (IPC) mechanisms as a communication channel. ",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "May try to detect the Windows Explorer process (often used for injection)",
                  "match_data": [
                    "Program Manager",
                    "Shell_TrayWnd",
                    "Progman",
                    "Progman#"
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "Injects a PE file into a foreign processes",
                  "match_data": [
                    "C:\\Users\\user\\Desktop\\program.exe base: 400000 value starts with: 4D5A"
                  ]
                }
              ]
            },
            {
              "id": "T1036",
              "name": "Masquerading",
              "link": "https://attack.mitre.org/techniques/T1036/",
              "description": "Adversaries may attempt to manipulate features of their artifacts to make them appear legitimate or benign to users and/or security tools. Masquerading occurs when the name or location of an object, legitimate or malicious, is manipulated or abused for the sake of evading defenses and observation. This may include manipulating file metadata, tricking users into misidentifying the file type, and giving legitimate task or service names.\nRenaming abusable system utilities to evade security monitoring is also a form of Masquerading.",
              "signatures": [
                {
                  "severity": "HIGH",
                  "description": "Icon mismatch, binary includes an Icon from a different legit application in order to fool users",
                  "match_data": [
                    "icon matches a legit application icon: icon2083.png"
                  ]
                }
              ]
            },
            {
              "id": "T1562",
              "name": "Impair Defenses",
              "link": "https://attack.mitre.org/techniques/T1562/",
              "description": "Adversaries may maliciously modify components of a victim environment in order to hinder or disable defensive mechanisms. This not only involves impairing preventative defenses, such as firewalls and anti-virus, but also detection capabilities that defenders can use to audit activity and identify malicious behavior. This may also span both native defenses as well as supplemental capabilities installed by users and administrators.\nAdversaries may also impair routine operations that contribute to defensive hygiene, such as blocking users from logging out, preventing a system from shutting down, or disabling or modifying the update process. Adversaries could also target event aggregation and analysis mechanisms, or otherwise disrupt these procedures by altering other system components. These restrictions can further enable malicious operations as well as the continued propagation of incidents."
            },
            {
              "id": "T1562.001",
              "name": "Disable or Modify Tools",
              "link": "https://attack.mitre.org/techniques/T1562/001/",
              "description": "Adversaries may modify and/or disable security tools to avoid possible detection of their malware/tools and activities. This may take many forms, such as killing security software processes or services, modifying / deleting Registry keys or configuration files so that tools do not operate properly, or other methods to interfere with security tools scanning or reporting information. Adversaries may also disable updates to prevent the latest security patches from reaching tools on victim systems.\nAdversaries may trigger a denial-of-service attack via legitimate system processes. It has been previously observed that the Windows Time Travel Debugging (TTD) monitor driver can be used to initiate a debugging session for a security tool (e.g., an EDR) and render the tool non-functional.  By hooking the debugger into the EDR process, all child processes from the EDR will be automatically suspended. The attacker can terminate any EDR helper processes (unprotected by Windows Protected Process Light) by abusing the Process Explorer driver. In combination this will halt any attempt to restart services and cause the tool to crash.\nAdversaries may also tamper with artifacts deployed and utilized by security tools. Security tools may make dynamic changes to system components in order to maintain visibility into specific events. For example, security products may load their own modules and/or modify those loaded by processes to facilitate data collection. Similar to Indicator Blocking, adversaries may unhook or otherwise modify these features added by tools (especially those that exist in userland or are otherwise potentially accessible to adversaries) to avoid detection. For example, adversaries may abuse the Windows process mitigation policy to block certain endpoint detection and response (EDR) products from loading their user-mode code via DLLs. By spawning a process with the PROCESS_CREATION_MITIGATION_POLICY_BLOCK_NON_MICROSOFT_BINARIES_ALWAYS_ON attribute using API calls like UpdateProcThreadAttribute, adversaries may evade detection by endpoint security solutions that rely on DLLs that are not signed by Microsoft. Alternatively, they may add new directories to an EDR tool’s exclusion list, enabling them to hide malicious files via File/Path Exclusions.\nAdversaries may also focus on specific applications such as Sysmon. For example, the “Start” and “Enable” values in HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\WMI\\Autologger\\EventLog-Microsoft-Windows-Sysmon-Operational may be modified to tamper with and potentially disable Sysmon logging. \nOn network devices, adversaries may attempt to skip digital signature verification checks by altering startup configuration files and effectively disabling firmware verification that typically occurs at boot.\nIn cloud environments, tools disabled by adversaries may include cloud monitoring agents that report back to services such as AWS CloudWatch or Google Cloud Monitor.\nFurthermore, although defensive tools may have anti-tampering mechanisms, adversaries may abuse tools such as legitimate rootkit removal kits to impair and/or disable these tools. For example, adversaries have used tools such as GMER to find and shut down hidden processes and antivirus software on infected systems.\nAdditionally, adversaries may exploit legitimate drivers from anti-virus software to gain access to kernel space (i.e. Exploitation for Privilege Escalation), which may lead to bypassing anti-tampering features.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Creates guard pages, often used to prevent reverse engineering and debugging",
                  "match_data": [
                    "page read and write | page guard"
                  ]
                }
              ]
            },
            {
              "id": "T1497",
              "name": "Virtualization/Sandbox Evasion",
              "link": "https://attack.mitre.org/techniques/T1497/",
              "description": "Adversaries may employ various means to detect and avoid virtualization and analysis environments. This may include changing behaviors based on the results of checks for the presence of artifacts indicative of a virtual machine environment (VME) or sandbox. If the adversary detects a VME, they may alter their malware to disengage from the victim or conceal the core functions of the implant. They may also search for VME artifacts before dropping secondary or additional payloads. Adversaries may use the information learned from Virtualization/Sandbox Evasion during automated discovery to shape follow-on behaviors.\nAdversaries may use several methods to accomplish Virtualization/Sandbox Evasion such as checking for security monitoring tools (e.g., Sysinternals, Wireshark, etc.) or other system artifacts associated with analysis or virtualization. Adversaries may also check for legitimate user activity to help determine if it is in an analysis environment. Additional methods include use of sleep timers or loops within malware code to avoid operating within a temporary sandbox.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Allocates memory with a write watch (potentially for evading sandboxes)",
                  "match_data": [
                    "F70000 memory reserve | memory write watch",
                    "2A50000 memory reserve | memory write watch",
                    "4A50000 memory reserve | memory write watch",
                    "7600000 memory reserve | memory write watch",
                    "8600000 memory reserve | memory write watch",
                    "87A0000 memory reserve | memory write watch",
                    "97A0000 memory reserve | memory write watch"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "Contains long sleeps (>= 3 min)",
                  "match_data": [
                    "delay time: 922337203685477"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "May sleep (evasive loops) to hinder dynamic analysis",
                  "match_data": [
                    "-922337203685477s >= -30000s"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "Contains medium sleeps (>= 30s)",
                  "match_data": [
                    "delay time: 922337203685477"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "Checks if the current process is being debugged",
                  "match_data": [
                    "DebugPort"
                  ]
                }
              ]
            },
            {
              "id": "T1027",
              "name": "Obfuscated Files or Information",
              "link": "https://attack.mitre.org/techniques/T1027/",
              "description": "Adversaries may attempt to make an executable or file difficult to discover or analyze by encrypting, encoding, or otherwise obfuscating its contents on the system or in transit. This is common behavior that can be used across different platforms and the network to evade defenses. \nPayloads may be compressed, archived, or encrypted in order to avoid detection. These payloads may be used during Initial Access or later to mitigate detection. Sometimes a user's action may be required to open and Deobfuscate/Decode Files or Information for User Execution. The user may also be required to input a password to open a password protected compressed/encrypted file that was provided by the adversary.  Adversaries may also use compressed or archived scripts, such as JavaScript. \nPortions of files can also be encoded to hide the plain-text strings that would otherwise help defenders with discovery.  Payloads may also be split into separate, seemingly benign files that only reveal malicious functionality when reassembled. \nAdversaries may also abuse Command Obfuscation to obscure commands executed from payloads or directly via Command and Scripting Interpreter. Environment variables, aliases, characters, and other platform/language specific semantics can be used to evade signature based detections and application control mechanisms.   ",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Binary may include packed or crypted data",
                  "match_data": [
                    "section name: .text entropy: 7.802104678840314"
                  ]
                }
              ]
            },
            {
              "id": "T1027.002",
              "name": "Software Packing",
              "link": "https://attack.mitre.org/techniques/T1027/002/",
              "description": "Adversaries may perform software packing or virtual machine software protection to conceal their code. Software packing is a method of compressing or encrypting an executable. Packing an executable changes the file signature in an attempt to avoid signature-based detection. Most decompression techniques decompress the executable code in memory. Virtual machine software protection translates an executable's original code into a special format that only a special virtual machine can run. A virtual machine is then called to run this code. \nUtilities used to perform software packing are called packers. Example packers are MPRESS and UPX. A more comprehensive list of known packers is available, but adversaries may create their own packing techniques that do not leave the same artifacts as well-known packers to evade defenses.  ",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "PE file has an executable .text section which is very likely to contain packed code (zlib compression ratio < 0.3)",
                  "match_data": [
                    "Section: .text IMAGE_SCN_CNT_CODE, IMAGE_SCN_MEM_EXECUTE, IMAGE_SCN_MEM_READ"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "Binary may include packed or crypted data",
                  "match_data": [
                    "section name: .text entropy: 7.802104678840314"
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0007",
          "name": "Discovery",
          "link": "https://attack.mitre.org/tactics/TA0007/",
          "description": "The adversary is trying to figure out your environment.\n\nDiscovery consists of techniques an adversary may use to gain knowledge about the system and internal network. These techniques help adversaries observe the environment and orient themselves before deciding how to act. They also allow adversaries to explore what they can control and what’s around their entry point in order to discover how it could benefit their current objective. Native operating system tools are often used toward this post-compromise information-gathering objective. ",
          "techniques": [
            {
              "id": "T1497",
              "name": "Virtualization/Sandbox Evasion",
              "link": "https://attack.mitre.org/techniques/T1497/",
              "description": "Adversaries may employ various means to detect and avoid virtualization and analysis environments. This may include changing behaviors based on the results of checks for the presence of artifacts indicative of a virtual machine environment (VME) or sandbox. If the adversary detects a VME, they may alter their malware to disengage from the victim or conceal the core functions of the implant. They may also search for VME artifacts before dropping secondary or additional payloads. Adversaries may use the information learned from Virtualization/Sandbox Evasion during automated discovery to shape follow-on behaviors.\nAdversaries may use several methods to accomplish Virtualization/Sandbox Evasion such as checking for security monitoring tools (e.g., Sysinternals, Wireshark, etc.) or other system artifacts associated with analysis or virtualization. Adversaries may also check for legitimate user activity to help determine if it is in an analysis environment. Additional methods include use of sleep timers or loops within malware code to avoid operating within a temporary sandbox.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Allocates memory with a write watch (potentially for evading sandboxes)",
                  "match_data": [
                    "F70000 memory reserve | memory write watch",
                    "2A50000 memory reserve | memory write watch",
                    "4A50000 memory reserve | memory write watch",
                    "7600000 memory reserve | memory write watch",
                    "8600000 memory reserve | memory write watch",
                    "87A0000 memory reserve | memory write watch",
                    "97A0000 memory reserve | memory write watch"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "Contains long sleeps (>= 3 min)",
                  "match_data": [
                    "delay time: 922337203685477"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "May sleep (evasive loops) to hinder dynamic analysis",
                  "match_data": [
                    "-922337203685477s >= -30000s"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "Contains medium sleeps (>= 30s)",
                  "match_data": [
                    "delay time: 922337203685477"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "Checks if the current process is being debugged",
                  "match_data": [
                    "DebugPort"
                  ]
                }
              ]
            },
            {
              "id": "T1518",
              "name": "Software Discovery",
              "link": "https://attack.mitre.org/techniques/T1518/",
              "description": "Adversaries may attempt to get a listing of software and software versions that are installed on a system or in a cloud environment. Adversaries may use the information from Software Discovery during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\nSuch software may be deployed widely across the environment for configuration management or security reasons, such as Software Deployment Tools, and may allow adversaries broad access to infect devices or move laterally.\nAdversaries may attempt to enumerate software for a variety of reasons, such as figuring out what security measures are present or if the compromised system has a version of software that is vulnerable to Exploitation for Privilege Escalation."
            },
            {
              "id": "T1518.001",
              "name": "Security Software Discovery",
              "link": "https://attack.mitre.org/techniques/T1518/001/",
              "description": "Adversaries may attempt to get a listing of security software, configurations, defensive tools, and sensors that are installed on a system or in a cloud environment. This may include things such as cloud monitoring agents and anti-virus. Adversaries may use the information from Security Software Discovery during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\nExample commands that can be used to obtain security software information are netsh, reg query with Reg, dir with cmd, and Tasklist, but other indicators of discovery behavior may be more specific to the type of software or security system the adversary is looking for. It is becoming more common to see macOS malware perform checks for LittleSnitch and KnockKnock software.\nAdversaries may also utilize the Cloud API to discover cloud-native security software installed on compute infrastructure, such as the AWS CloudWatch agent, Azure VM Agent, and Google Cloud Monitor agent. These agents  may collect  metrics and logs from the VM, which may be centrally aggregated in a cloud-based monitoring platform.",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Tries to detect virtualization through RDTSC time measurements",
                  "match_data": [
                    "First address: 409904 second address: 40990A instructions: 0x00000000 rdtsc 0x00000002 xor ecx, ecx 0x00000004 add ecx, eax 0x00000006 rdtsc ",
                    "First address: 409B7E second address: 409B84 instructions: 0x00000000 rdtsc 0x00000002 xor ecx, ecx 0x00000004 add ecx, eax 0x00000006 rdtsc "
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "May try to detect the virtual machine to hinder analysis (VM artifact strings found in memory)",
                  "match_data": [
                    "Widgetsmsn.com/app.html?locale=en-US&region=US&aver=525.1301.30.0&over=10.0.22631.2428.amd64fre.ni_release.220506-1250&fring=Retail&devicetype=1&oem=QEMU&smode=false&machineId=%7B0800D3B7-D862-4669-81",
                    "000f5630d-b6bf-11d0-94f2-00a0c91efb8b}\\\\?\\SCSI#CdRom&Ven_QEMU&Prod_QEMU_DVD-ROM#4&35424867&0&010000#{53f5630d-b6bf-11d0-94f2-00a0c91efb8b}\\\\?\\SCSI#CdRom&Ven_Msft&Prod_Virtual_DVD-ROM#2&1f4adffe&0&0000",
                    "#{53f5630d-b6bf-11d0-94f2-00a0c91efb8b}\\\\?\\SCSI#CdRom&Ven_QEMU&Prod_QEMU_DVD-ROM#4&35424867&0&010000#{53f5630d-b6bf-11d0-94f2-00a0c91efb8b}\\\\?\\SCSI#Cd",
                    "0d-b6bf-11d0-94f2-00a0c91efb8b}\\\\?\\SCSI#CdRom&Ven_QEMU&Prod_QEMU_DVD-ROM#4&35424867&0&010000#{53f5630d-b6bf-11d0-94f2-00a0c91efb8b}\\\\?\\SCSI#CdRom&Ven_",
                    "ACPI\\QEMU0002\\3&11583659&0",
                    "2-00a0c91efb8b}\\\\?\\SCSI#CdRom&Ven_QEMU&Prod_QEMU_DVD-ROM#4&35424867&0&010000#{53f5630d-b6bf-11d0-94f2-00a0c91efb8b}\\\\?\\SCSI#CdRom&Ven_Msft&Prod_Virtua",
                    "\\\\?\\STORAGE#VolumeSnapshot#HarddiskVolumeSnapshot1#{53f5630d-b6bf-11d0-94f2-00a0c91efb8b}\\\\?\\STORAGE#Volume#{e87602ba-fe02-11ef-83b3-806e6f6e6963}#0000000000100000#{53f5630d-b6bf-11d0-94f2-00a0c91efb8",
                    "11d0-94f2-00a0c91efb8b}\\\\?\\SCSI#CdRom&Ven_QEMU&Prod_QEMU_DVD-ROM#4&35424867&0&010000#{53f5630d-b6bf-11d0-94f2-00a0c91efb8b}\\\\?\\SCSI#CdRom&Ven_Msft&Proxr",
                    "Hyper-V RAW.[",
                    "SCSI\\DISK&VEN_QEMU&PROD_HARDDISK\\4&35424867&0&000000",
                    "SWD\\COMPUTER\\MFG_QEMU&PROD_STANDARD_PC_(Q35_+_ICH9__2009)",
                    "0d-b6bf-11d0-94f2-00a0c91efb8b}\\\\?\\SCSI#CdRom&Ven_QEMU&Prod_QEMU_DVD-ROM#4&35424867&0&010000#{53f5630d-b6bf-11d0-94f2-00a0c91efb8b}\\\\?\\SCSI#CdRom&Ven_8x"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "Checks if the current process is being debugged",
                  "match_data": [
                    "DebugPort"
                  ]
                }
              ]
            },
            {
              "id": "T1057",
              "name": "Process Discovery",
              "link": "https://attack.mitre.org/techniques/T1057/",
              "description": "Adversaries may attempt to get information about running processes on a system. Information obtained could be used to gain an understanding of common software/applications running on systems within the network. Administrator or otherwise elevated access may provide better process details. Adversaries may use the information from Process Discovery during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\nIn Windows environments, adversaries could obtain details on running processes using the Tasklist utility via cmd or Get-Process via PowerShell. Information about processes can also be extracted from the output of Native API calls such as CreateToolhelp32Snapshot. In Mac and Linux, this is accomplished with the ps command. Adversaries may also opt to enumerate processes via /proc. ESXi also supports use of the ps command, as well as esxcli system process list.\nOn network devices, Network Device CLI commands such as show processes can be used to display current running processes.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Queries a list of all running processes",
                  "match_data": [
                    "ProcessInformation"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "May try to detect the Windows Explorer process (often used for injection)",
                  "match_data": [
                    "Program Manager",
                    "Shell_TrayWnd",
                    "Progman",
                    "Progman#"
                  ]
                }
              ]
            },
            {
              "id": "T1010",
              "name": "Application Window Discovery",
              "link": "https://attack.mitre.org/techniques/T1010/",
              "description": "Adversaries may attempt to get a listing of open application windows. Window listings could convey information about how the system is used. For example, information about application windows could be used identify potential data to collect as well as identifying security tooling (Security Software Discovery) to evade.\nAdversaries typically abuse system features for this type of enumeration. For example, they may gather information through native system features such as Command and Scripting Interpreter commands and Native API functions.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Sample monitors Window changes (e.g. starting applications), analyze the sample with the simulation cookbook"
                }
              ]
            },
            {
              "id": "T1082",
              "name": "System Information Discovery",
              "link": "https://attack.mitre.org/techniques/T1082/",
              "description": "An adversary may attempt to get detailed information about the operating system and hardware, including version, patches, hotfixes, service packs, and architecture. Adversaries may use this information to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions. This behavior is distinct from Local Storage Discovery which is an adversary's discovery of local drive, disks and/or volumes.\nTools such as Systeminfo can be used to gather detailed system information. If running with privileged access, a breakdown of system data can be gathered through the systemsetup configuration tool on macOS. Adversaries may leverage a Network Device CLI on network devices to gather detailed system information (e.g. show version). On ESXi servers, threat actors may gather system information from various esxcli utilities, such as system hostname get and system version get.\nInfrastructure as a Service (IaaS) cloud providers such as AWS, GCP, and Azure allow access to instance and virtual machine information via APIs. Successful authenticated API calls can return data such as the operating system platform and status of a particular instance or the model view of a virtual machine.\nSystem Information Discovery combined with information gathered from other forms of discovery and reconnaissance can drive payload development and concealment. ",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Queries the cryptographic machine GUID",
                  "match_data": [
                    "HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Cryptography MachineGuid"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "Reads software policies",
                  "match_data": [
                    "HKEY_CURRENT_USER\\Software\\Policies\\Microsoft\\Windows\\Safer\\CodeIdentifiers"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "Queries the volume information (name, serial number etc) of a device",
                  "match_data": [
                    "C:\\Users\\user\\Desktop\\program.exe VolumeInformation",
                    "C:\\Windows\\Microsoft.NET\\assembly\\GAC_MSIL\\System.Windows.Forms\\v4.0_4.0.0.0__b77a5c561934e089\\System.Windows.Forms.dll VolumeInformation",
                    "C:\\Windows\\Microsoft.NET\\assembly\\GAC_MSIL\\System.Drawing\\v4.0_4.0.0.0__b03f5f7f11d50a3a\\System.Drawing.dll VolumeInformation",
                    "C:\\Windows\\Microsoft.NET\\assembly\\GAC_MSIL\\Accessibility\\v4.0_4.0.0.0__b03f5f7f11d50a3a\\Accessibility.dll VolumeInformation",
                    "C:\\Windows\\Microsoft.NET\\assembly\\GAC_MSIL\\Microsoft.VisualBasic\\v4.0_10.0.0.0__b03f5f7f11d50a3a\\Microsoft.VisualBasic.dll VolumeInformation",
                    "C:\\Program Files\\WindowsApps\\Microsoft.WindowsTerminal_1.12.10983.0_x64__8wekyb3d8bbwe\\CascadiaCode.ttf VolumeInformation",
                    "C:\\Program Files\\WindowsApps\\Microsoft.WindowsTerminal_1.12.10983.0_x64__8wekyb3d8bbwe\\CascadiaCodeItalic.ttf VolumeInformation"
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "Tries to detect virtualization through RDTSC time measurements",
                  "match_data": [
                    "First address: 409904 second address: 40990A instructions: 0x00000000 rdtsc 0x00000002 xor ecx, ecx 0x00000004 add ecx, eax 0x00000006 rdtsc ",
                    "First address: 409B7E second address: 409B84 instructions: 0x00000000 rdtsc 0x00000002 xor ecx, ecx 0x00000004 add ecx, eax 0x00000006 rdtsc "
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "Checks if Microsoft Office is installed",
                  "match_data": [
                    "HKEY_CURRENT_USER\\Software\\Microsoft\\Office"
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0011",
          "name": "Command and Control",
          "link": "https://attack.mitre.org/tactics/TA0011/",
          "description": "The adversary is trying to communicate with compromised systems to control them.\n\nCommand and Control consists of techniques that adversaries may use to communicate with systems under their control within a victim network. Adversaries commonly attempt to mimic normal, expected traffic to avoid detection. There are many ways an adversary can establish command and control with various levels of stealth depending on the victim’s network structure and defenses.",
          "techniques": [
            {
              "id": "T1095",
              "name": "Non-Application Layer Protocol",
              "link": "https://attack.mitre.org/techniques/T1095/",
              "description": "Adversaries may use an OSI non-application layer protocol for communication between host and C2 server or among infected hosts within a network. The list of possible protocols is extensive. Specific examples include use of network layer protocols, such as the Internet Control Message Protocol (ICMP), transport layer protocols, such as the User Datagram Protocol (UDP), session layer protocols, such as Socket Secure (SOCKS), as well as redirected/tunneled protocols, such as Serial over LAN (SOL).\nICMP communication between hosts is one example. Because ICMP is part of the Internet Protocol Suite, it is required to be implemented by all IP-compatible hosts. However, it is not as commonly monitored as other Internet Protocols such as TCP or UDP and may be used by adversaries to hide communications.\nIn ESXi environments, adversaries may leverage the Virtual Machine Communication Interface (VMCI) for communication between guest virtual machines and the ESXi host. This traffic is similar to client-server communications on traditional network sockets but is localized to the physical machine running the ESXi host, meaning it does not traverse external networks (routers, switches). This results in communications that are invisible to external monitoring and standard networking tools like tcpdump, netstat, nmap, and Wireshark. By adding a VMCI backdoor to a compromised ESXi host, adversaries may persistently regain access from any guest VM to the compromised ESXi host’s backdoor, regardless of network segmentation or firewall rules in place.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Performs DNS lookups",
                  "match_data": [
                    "DNS query: www.msn.com",
                    "DNS query: api.msn.com",
                    "DNS query: srtb.msn.com"
                  ]
                }
              ]
            },
            {
              "id": "T1071",
              "name": "Application Layer Protocol",
              "link": "https://attack.mitre.org/techniques/T1071/",
              "description": "Adversaries may communicate using OSI application layer protocols to avoid detection/network filtering by blending in with existing traffic. Commands to the remote system, and often the results of those commands, will be embedded within the protocol traffic between the client and server. \nAdversaries may utilize many different protocols, including those used for web browsing, transferring files, electronic mail, DNS, or publishing/subscribing. For connections that occur internally within an enclave (such as those between a proxy or pivot node and other nodes), commonly used protocols are SMB, SSH, or RDP. ",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Performs DNS lookups",
                  "match_data": [
                    "DNS query: www.msn.com",
                    "DNS query: api.msn.com",
                    "DNS query: srtb.msn.com"
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "C2 URLs / IPs found in malware configuration",
                  "match_data": [
                    "www.ollectionss.top/ko14/"
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  },
  "links": {
    "self": "https://www.virustotal.com/api/v3/files/d5dc3014138be804fa271f8cc005311642dc622e7ff2a663211fcf58fd5c6fbe/behaviour_mitre_trees"
  }
}