{
  "data": {
    "CAPA": {
      "tactics": [
        {
          "id": "TA0006",
          "name": "Credential Access",
          "link": "https://attack.mitre.org/tactics/TA0006/",
          "description": "The adversary is trying to steal account names and passwords.\n\nCredential Access consists of techniques for stealing credentials like account names and passwords. Techniques used to get credentials include keylogging or credential dumping. Using legitimate credentials can give adversaries access to systems, make them harder to detect, and provide the opportunity to create more accounts to help achieve their goals.",
          "techniques": [
            {
              "id": "T1555",
              "name": "Credentials from Password Stores",
              "link": "https://attack.mitre.org/techniques/T1555/",
              "description": "Adversaries may search for common password storage locations to obtain user credentials. Passwords are stored in several places on a system, depending on the operating system or application holding the credentials. There are also specific applications and services that store passwords to make them easier for users to manage and maintain, such as password managers and cloud secrets vaults. Once credentials are obtained, they can be used to perform lateral movement and access restricted information."
            },
            {
              "id": "T1555.003",
              "name": "Credentials from Web Browsers",
              "link": "https://attack.mitre.org/techniques/T1555/003/",
              "description": "Adversaries may acquire credentials from web browsers by reading files specific to the target browser. Web browsers commonly save credentials such as website usernames and passwords so that they do not need to be entered manually in the future. Web browsers typically store the credentials in an encrypted format within a credential store; however, methods exist to extract plaintext credentials from web browsers.\nFor example, on Windows systems, encrypted credentials may be obtained from Google Chrome by reading a database file, AppData\\Local\\Google\\Chrome\\User Data\\Default\\Login Data and executing a SQL query: SELECT action_url, username_value, password_value FROM logins;. The plaintext password can then be obtained by passing the encrypted credentials to the Windows API function CryptUnprotectData, which uses the victim’s cached logon credentials as the decryption key.\nAdversaries have executed similar procedures for common web browsers such as FireFox, Safari, Edge, etc. Windows stores Internet Explorer and Microsoft Edge credentials in Credential Lockers managed by the Windows Credential Manager.\nAdversaries may also acquire credentials by searching web browser process memory for patterns that commonly match credentials.\nAfter acquiring credentials from web browsers, adversaries may attempt to recycle the credentials across different systems and/or accounts in order to expand access. This can result in significantly furthering an adversary's objective in cases where credentials gained from web browsers overlap with privileged accounts (e.g. domain administrator).",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "gather firefox profile information",
                  "match_data": [
                    "regex: /\\\\Mozilla\\\\Firefox\\\\profiles(\\.ini)?/i",
                    "regex: /\\\\(signons|cookies)\\.sqlite/i"
                  ]
                }
              ]
            },
            {
              "id": "T1056",
              "name": "Input Capture",
              "link": "https://attack.mitre.org/techniques/T1056/",
              "description": "Adversaries may use methods of capturing user input to obtain credentials or collect information. During normal system usage, users often provide credentials to various different locations, such as login pages/portals or system dialog boxes. Input capture mechanisms may be transparent to the user (e.g. Credential API Hooking) or rely on deceiving the user into providing input into what they believe to be a genuine service (e.g. Web Portal Capture)."
            },
            {
              "id": "T1056.001",
              "name": "Keylogging",
              "link": "https://attack.mitre.org/techniques/T1056/001/",
              "description": "Adversaries may log user keystrokes to intercept credentials as the user types them. Keylogging is likely to be used to acquire credentials for new access opportunities when OS Credential Dumping efforts are not effective, and may require an adversary to intercept keystrokes on a system for a substantial period of time before credentials can be successfully captured. In order to increase the likelihood of capturing credentials quickly, an adversary may also perform actions such as clearing browser cookies to force users to reauthenticate to systems.\nKeylogging is the most prevalent type of input capture, with many different ways of intercepting keystrokes. Some methods include:\n\nHooking API callbacks used for processing keystrokes. Unlike Credential API Hooking, this focuses solely on API functions intended for processing keystroke data.\nReading raw keystroke data from the hardware buffer.\nWindows Registry modifications.\nCustom drivers.\nModify System Image may provide adversaries with hooks into the operating system of network devices to read raw keystrokes for login sessions. \n",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "log keystrokes",
                  "match_data": [
                    "api: MapVirtualKey"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "log keystrokes via application hook",
                  "match_data": [
                    "WH_KEYBOARD_LL",
                    "set application hook",
                    "api: SetWindowsHookEx"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "log keystrokes via polling",
                  "match_data": [
                    "api: GetKeyState",
                    "api: GetKeyboardState"
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0007",
          "name": "Discovery",
          "link": "https://attack.mitre.org/tactics/TA0007/",
          "description": "The adversary is trying to figure out your environment.\n\nDiscovery consists of techniques an adversary may use to gain knowledge about the system and internal network. These techniques help adversaries observe the environment and orient themselves before deciding how to act. They also allow adversaries to explore what they can control and what’s around their entry point in order to discover how it could benefit their current objective. Native operating system tools are often used toward this post-compromise information-gathering objective. ",
          "techniques": [
            {
              "id": "T1082",
              "name": "System Information Discovery",
              "link": "https://attack.mitre.org/techniques/T1082/",
              "description": "An adversary may attempt to get detailed information about the operating system and hardware, including version, patches, hotfixes, service packs, and architecture. Adversaries may use this information to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions. This behavior is distinct from Local Storage Discovery which is an adversary's discovery of local drive, disks and/or volumes.\nTools such as Systeminfo can be used to gather detailed system information. If running with privileged access, a breakdown of system data can be gathered through the systemsetup configuration tool on macOS. Adversaries may leverage a Network Device CLI on network devices to gather detailed system information (e.g. show version). On ESXi servers, threat actors may gather system information from various esxcli utilities, such as system hostname get and system version get.\nInfrastructure as a Service (IaaS) cloud providers such as AWS, GCP, and Azure allow access to instance and virtual machine information via APIs. Successful authenticated API calls can return data such as the operating system platform and status of a particular instance or the model view of a virtual machine.\nSystem Information Discovery combined with information gathered from other forms of discovery and reconnaissance can drive payload development and concealment. ",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "get disk information",
                  "match_data": [
                    "api: QueryDosDevice",
                    "api: GetDriveType",
                    "api: GetVolumePathNamesForVolumeName"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "query environment variable",
                  "match_data": [
                    "api: ExpandEnvironmentStrings"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "get system information on Windows",
                  "match_data": [
                    "api: GetNativeSystemInfo"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "enumerate disk volumes",
                  "match_data": [
                    "loop",
                    "api: FindVolumeClose",
                    "api: FindFirstVolume"
                  ]
                }
              ]
            },
            {
              "id": "T1012",
              "name": "Query Registry",
              "link": "https://attack.mitre.org/techniques/T1012/",
              "description": "Adversaries may interact with the Windows Registry to gather information about the system, configuration, and installed software.\nThe Registry contains a significant amount of information about the operating system, configuration, software, and security. Information can easily be queried using the Reg utility, though other means to access the Registry exist. Some of the information may help adversaries to further their operation within a network. Adversaries may use the information from Query Registry during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "query or enumerate registry value",
                  "match_data": [
                    "api: RegOpenKeyEx",
                    "api: RegCreateKey",
                    "api: RegEnumValue"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "query or enumerate registry key",
                  "match_data": [
                    "api: RegOpenKeyEx",
                    "create or open registry key",
                    "api: RegEnumKeyEx"
                  ]
                }
              ]
            },
            {
              "id": "T1083",
              "name": "File and Directory Discovery",
              "link": "https://attack.mitre.org/techniques/T1083/",
              "description": "Adversaries may enumerate files and directories or may search in specific locations of a host or network share for certain information within a file system. Adversaries may use the information from File and Directory Discovery during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\nMany command shell utilities can be used to obtain this information. Examples include dir, tree, ls, find, and locate. Custom tools may also be used to gather file and directory information and interact with the Native API. Adversaries may also leverage a Network Device CLI on network devices to gather file and directory information (e.g. dir, show flash, and/or nvram).\nSome files and directories may require elevated or specific user permissions to access.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "get file size",
                  "match_data": [
                    "api: GetFileSizeEx",
                    "api: GetFileSize"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "enumerate files recursively",
                  "match_data": [
                    "loop",
                    "api: FindFirstFile",
                    "recursive call"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "get common file path",
                  "match_data": [
                    "api: GetSystemDirectory",
                    "api: GetTempPath",
                    "api: GetTempFileName"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "check if file exists",
                  "match_data": [
                    "api: GetLastError",
                    "ERROR_FILE_NOT_FOUND",
                    "mnemonic: cmp"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "enumerate files on Windows",
                  "match_data": [
                    "loop",
                    "api: FindFirstFile",
                    "recursive call"
                  ]
                }
              ]
            },
            {
              "id": "T1007",
              "name": "System Service Discovery",
              "link": "https://attack.mitre.org/techniques/T1007/",
              "description": "Adversaries may try to gather information about registered local system services. Adversaries may obtain information about services using tools as well as OS utility commands such as sc query, tasklist /svc, systemctl --type=service, and net start. Adversaries may also gather information about schedule tasks via commands such as schtasks on Windows or crontab -l on Linux and macOS.\nAdversaries may use the information from System Service Discovery during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "enumerate services",
                  "match_data": [
                    "api: EnumServicesStatus"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "query service status",
                  "match_data": [
                    "api: QueryServiceStatus"
                  ]
                }
              ]
            },
            {
              "id": "T1518",
              "name": "Software Discovery",
              "link": "https://attack.mitre.org/techniques/T1518/",
              "description": "Adversaries may attempt to get a listing of software and software versions that are installed on a system or in a cloud environment. Adversaries may use the information from Software Discovery during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\nSuch software may be deployed widely across the environment for configuration management or security reasons, such as Software Deployment Tools, and may allow adversaries broad access to infect devices or move laterally.\nAdversaries may attempt to enumerate software for a variety of reasons, such as figuring out what security measures are present or if the compromised system has a version of software that is vulnerable to Exploitation for Privilege Escalation.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "get installed programs",
                  "match_data": [
                    "loop",
                    "api: RegOpenKeyEx",
                    "regex: /SOFTWARE\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Uninstall/i"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "enumerate processes",
                  "match_data": [
                    "api: Process32Next",
                    "api: Process32First",
                    "api: CreateToolhelp32Snapshot"
                  ]
                }
              ]
            },
            {
              "id": "T1057",
              "name": "Process Discovery",
              "link": "https://attack.mitre.org/techniques/T1057/",
              "description": "Adversaries may attempt to get information about running processes on a system. Information obtained could be used to gain an understanding of common software/applications running on systems within the network. Administrator or otherwise elevated access may provide better process details. Adversaries may use the information from Process Discovery during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\nIn Windows environments, adversaries could obtain details on running processes using the Tasklist utility via cmd or Get-Process via PowerShell. Information about processes can also be extracted from the output of Native API calls such as CreateToolhelp32Snapshot. In Mac and Linux, this is accomplished with the ps command. Adversaries may also opt to enumerate processes via /proc. ESXi also supports use of the ps command, as well as esxcli system process list.\nOn network devices, Network Device CLI commands such as show processes can be used to display current running processes.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "enumerate processes",
                  "match_data": [
                    "api: Process32Next",
                    "api: Process32First",
                    "api: CreateToolhelp32Snapshot"
                  ]
                }
              ]
            },
            {
              "id": "T1614",
              "name": "System Location Discovery",
              "link": "https://attack.mitre.org/techniques/T1614/",
              "description": "Adversaries may gather information in an attempt to calculate the geographical location of a victim host. Adversaries may use the information from System Location Discovery during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\nAdversaries may attempt to infer the location of a system using various system checks, such as time zone, keyboard layout, and/or language settings. Windows API functions such as GetLocaleInfoW can also be used to determine the locale of the host. In cloud environments, an instance's availability zone may also be discovered by accessing the instance metadata service from the instance.\nAdversaries may also attempt to infer the location of a victim host using IP addressing, such as via online geolocation IP-lookup services.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "get geographical location",
                  "match_data": [
                    "api: GetLocaleInfo"
                  ]
                }
              ]
            },
            {
              "id": "T1033",
              "name": "System Owner/User Discovery",
              "link": "https://attack.mitre.org/techniques/T1033/",
              "description": "Adversaries may attempt to identify the primary user, currently logged in user, set of users that commonly uses a system, or whether a user is actively using the system. They may do this, for example, by retrieving account usernames or by using OS Credential Dumping. The information may be collected in a number of different ways using other Discovery techniques, because user and username details are prevalent throughout a system and include running process ownership, file/directory ownership, session information, and system logs. Adversaries may use the information from System Owner/User Discovery during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\nVarious utilities and commands may acquire this information, including whoami. In macOS and Linux, the currently logged in user can be identified with w and who. On macOS the dscl . list /Users | grep -v '_' command can also be used to enumerate user accounts. Environment variables, such as %USERNAME% and $USER, may also be used to access this information.\nOn network devices, Network Device CLI commands such as show users and show ssh can be used to display users currently logged into the device.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "get session user name",
                  "match_data": [
                    "api: GetUserName"
                  ]
                }
              ]
            },
            {
              "id": "T1087",
              "name": "Account Discovery",
              "link": "https://attack.mitre.org/techniques/T1087/",
              "description": "Adversaries may attempt to get a listing of valid accounts, usernames, or email addresses on a system or within a compromised environment. This information can help adversaries determine which accounts exist, which can aid in follow-on behavior such as brute-forcing, spear-phishing attacks, or account takeovers (e.g., Valid Accounts).\nAdversaries may use several methods to enumerate accounts, including abuse of existing tools, built-in commands, and potential misconfigurations that leak account names and roles or permissions in the targeted environment.\nFor examples, cloud environments typically provide easily accessible interfaces to obtain user lists. On hosts, adversaries can use default PowerShell and other command line functionality to identify accounts. Information about email addresses and accounts may also be extracted by searching an infected system’s files.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "get session user name",
                  "match_data": [
                    "api: GetUserName"
                  ]
                }
              ]
            },
            {
              "id": "T1010",
              "name": "Application Window Discovery",
              "link": "https://attack.mitre.org/techniques/T1010/",
              "description": "Adversaries may attempt to get a listing of open application windows. Window listings could convey information about how the system is used. For example, information about application windows could be used identify potential data to collect as well as identifying security tooling (Security Software Discovery) to evade.\nAdversaries typically abuse system features for this type of enumeration. For example, they may gather information through native system features such as Command and Scripting Interpreter commands and Native API functions.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "enumerate gui resources",
                  "match_data": [
                    "api: EnumWindows"
                  ]
                }
              ]
            },
            {
              "id": "T1614.001",
              "name": "System Language Discovery",
              "link": "https://attack.mitre.org/techniques/T1614/001/",
              "description": "Adversaries may attempt to gather information about the system language of a victim in order to infer the geographical location of that host. This information may be used to shape follow-on behaviors, including whether the adversary infects the target and/or attempts specific actions. This decision may be employed by malware developers and operators to reduce their risk of attracting the attention of specific law enforcement agencies or prosecution/scrutiny from other entities.\nThere are various sources of data an adversary could use to infer system language, such as system defaults and keyboard layouts. Specific checks will vary based on the target and/or adversary, but may involve behaviors such as Query Registry and calls to Native API functions. \nFor example, on a Windows system adversaries may attempt to infer the language of a system by querying the registry key HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\Nls\\Language or parsing the outputs of Windows API functions GetUserDefaultUILanguage, GetSystemDefaultUILanguage, GetKeyboardLayoutList and GetUserDefaultLangID.\nOn a macOS or Linux system, adversaries may query locale to retrieve the value of the $LANG environment variable.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "get keyboard layout",
                  "match_data": [
                    "api: GetKeyboardLayoutName",
                    "api: GetKeyboardLayout"
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0009",
          "name": "Collection",
          "link": "https://attack.mitre.org/tactics/TA0009/",
          "description": "The adversary is trying to gather data of interest to their goal.\n\nCollection consists of techniques adversaries may use to gather information and the sources information is collected from that are relevant to following through on the adversary's objectives. Frequently, the next goal after collecting data is to either steal (exfiltrate) the data or to use the data to gain more information about the target environment. Common target sources include various drive types, browsers, audio, video, and email. Common collection methods include capturing screenshots and keyboard input.",
          "techniques": [
            {
              "id": "T1113",
              "name": "Screen Capture",
              "link": "https://attack.mitre.org/techniques/T1113/",
              "description": "Adversaries may attempt to take screen captures of the desktop to gather information over the course of an operation. Screen capturing functionality may be included as a feature of a remote access tool used in post-compromise operations. Taking a screenshot is also typically possible through native utilities or API calls, such as CopyFromScreen, xwd, or screencapture.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "capture screenshot",
                  "match_data": [
                    "api: CreateDC",
                    "DISPLAY",
                    "api: CreateCompatibleBitmap"
                  ]
                }
              ]
            },
            {
              "id": "T1115",
              "name": "Clipboard Data",
              "link": "https://attack.mitre.org/techniques/T1115/",
              "description": "Adversaries may collect data stored in the clipboard from users copying information within or between applications. \nFor example, on Windows adversaries can access clipboard data by using clip.exe or Get-Clipboard. Additionally, adversaries may monitor then replace users’ clipboard with their data (e.g., Transmitted Data Manipulation).\nmacOS and Linux also have commands, such as pbpaste, to grab clipboard contents.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "open clipboard",
                  "match_data": [
                    "api: OpenClipboard",
                    "api: CloseClipboard"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "read clipboard data",
                  "match_data": [
                    "CF_UNICODETEXT",
                    "api: GlobalUnlock",
                    "api: CloseClipboard"
                  ]
                }
              ]
            },
            {
              "id": "T1560",
              "name": "Archive Collected Data",
              "link": "https://attack.mitre.org/techniques/T1560/",
              "description": "An adversary may compress and/or encrypt data that is collected prior to exfiltration. Compressing the data can help to obfuscate the collected data and minimize the amount of data sent over the network. Encryption can be used to hide information that is being exfiltrated from detection or make exfiltration less conspicuous upon inspection by a defender.\nBoth compression and encryption are done prior to exfiltration, and can be performed using a utility, 3rd party library, or custom method."
            },
            {
              "id": "T1560.002",
              "name": "Archive via Library",
              "link": "https://attack.mitre.org/techniques/T1560/002/",
              "description": "An adversary may compress or encrypt data that is collected prior to exfiltration using 3rd party libraries. Many libraries exist that can archive data, including Python rarfile , libzip , and zlib . Most libraries include functionality to encrypt and/or compress data.\nSome archival libraries are preinstalled on systems, such as bzip2 on macOS and Linux, and zip on Windows. Note that the libraries are different from the utilities. The libraries can be linked against when compiling, while the utilities require spawning a subshell, or a similar execution mechanism.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "compress data via WinAPI",
                  "match_data": [
                    "RtlDecompressBuffer",
                    "RtlCompressBuffer"
                  ]
                }
              ]
            },
            {
              "id": "T1056",
              "name": "Input Capture",
              "link": "https://attack.mitre.org/techniques/T1056/",
              "description": "Adversaries may use methods of capturing user input to obtain credentials or collect information. During normal system usage, users often provide credentials to various different locations, such as login pages/portals or system dialog boxes. Input capture mechanisms may be transparent to the user (e.g. Credential API Hooking) or rely on deceiving the user into providing input into what they believe to be a genuine service (e.g. Web Portal Capture)."
            },
            {
              "id": "T1056.001",
              "name": "Keylogging",
              "link": "https://attack.mitre.org/techniques/T1056/001/",
              "description": "Adversaries may log user keystrokes to intercept credentials as the user types them. Keylogging is likely to be used to acquire credentials for new access opportunities when OS Credential Dumping efforts are not effective, and may require an adversary to intercept keystrokes on a system for a substantial period of time before credentials can be successfully captured. In order to increase the likelihood of capturing credentials quickly, an adversary may also perform actions such as clearing browser cookies to force users to reauthenticate to systems.\nKeylogging is the most prevalent type of input capture, with many different ways of intercepting keystrokes. Some methods include:\n\nHooking API callbacks used for processing keystrokes. Unlike Credential API Hooking, this focuses solely on API functions intended for processing keystroke data.\nReading raw keystroke data from the hardware buffer.\nWindows Registry modifications.\nCustom drivers.\nModify System Image may provide adversaries with hooks into the operating system of network devices to read raw keystrokes for login sessions. \n",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "log keystrokes",
                  "match_data": [
                    "api: MapVirtualKey"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "log keystrokes via application hook",
                  "match_data": [
                    "WH_KEYBOARD_LL",
                    "set application hook",
                    "api: SetWindowsHookEx"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "log keystrokes via polling",
                  "match_data": [
                    "api: GetKeyState",
                    "api: GetKeyboardState"
                  ]
                }
              ]
            },
            {
              "id": "T1123",
              "name": "Audio Capture",
              "link": "https://attack.mitre.org/techniques/T1123/",
              "description": "An adversary can leverage a computer's peripheral devices (e.g., microphones and webcams) or applications (e.g., voice and video call services) to capture audio recordings for the purpose of listening into sensitive conversations to gather information.\nMalware or scripts may be used to interact with the devices through an available API provided by the operating system or an application to capture audio. Audio files may be written to disk and exfiltrated later.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "capture microphone audio",
                  "match_data": [
                    "api: waveInOpen",
                    "api: waveInAddBuffer",
                    "api: waveInStart"
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0003",
          "name": "Persistence",
          "link": "https://attack.mitre.org/tactics/TA0003/",
          "description": "The adversary is trying to maintain their foothold.\n\nPersistence consists of techniques that adversaries use to keep access to systems across restarts, changed credentials, and other interruptions that could cut off their access. Techniques used for persistence include any access, action, or configuration changes that let them maintain their foothold on systems, such as replacing or hijacking legitimate code or adding startup code. ",
          "techniques": [
            {
              "id": "T1543",
              "name": "Create or Modify System Process",
              "link": "https://attack.mitre.org/techniques/T1543/",
              "description": "Adversaries may create or modify system-level processes to repeatedly execute malicious payloads as part of persistence. When operating systems boot up, they can start processes that perform background system functions. On Windows and Linux, these system processes are referred to as services. On macOS, launchd processes known as Launch Daemon and Launch Agent are run to finish system initialization and load user specific parameters. \nAdversaries may install new services, daemons, or agents that can be configured to execute at startup or a repeatable interval in order to establish persistence. Similarly, adversaries may modify existing services, daemons, or agents to achieve the same effect.  \nServices, daemons, or agents may be created with administrator privileges but executed under root/SYSTEM privileges. Adversaries may leverage this functionality to create or modify system processes in order to escalate privileges.  "
            },
            {
              "id": "T1543.003",
              "name": "Windows Service",
              "link": "https://attack.mitre.org/techniques/T1543/003/",
              "description": "Adversaries may create or modify Windows services to repeatedly execute malicious payloads as part of persistence. When Windows boots up, it starts programs or applications called services that perform background system functions. Windows service configuration information, including the file path to the service's executable or recovery programs/commands, is stored in the Windows Registry.\nAdversaries may install a new service or modify an existing service to execute at startup in order to persist on a system. Service configurations can be set or modified using system utilities (such as sc.exe), by directly modifying the Registry, or by interacting directly with the Windows API. \nAdversaries may also use services to install and execute malicious drivers. For example, after dropping a driver file (ex: .sys) to disk, the payload can be loaded and registered via Native API functions such as CreateServiceW() (or manually via functions such as ZwLoadDriver() and ZwSetValueKey()), by creating the required service Registry values (i.e. Modify Registry), or by using command-line utilities such as PnPUtil.exe. Adversaries may leverage these drivers as Rootkits to hide the presence of malicious activity on a system. Adversaries may also load a signed yet vulnerable driver onto a compromised machine (known as \"Bring Your Own Vulnerable Driver\" (BYOVD)) as part of Exploitation for Privilege Escalation.\nServices may be created with administrator privileges but are executed under SYSTEM privileges, so an adversary may also use a service to escalate privileges. Adversaries may also directly start services through Service Execution.\nTo make detection analysis more challenging, malicious services may also incorporate Masquerade Task or Service (ex: using a service and/or payload name related to a legitimate OS or benign software component). Adversaries may also create ‘hidden’ services (i.e., Hide Artifacts), for example by using the sc sdset command to set service permissions via the Service Descriptor Definition Language (SDDL). This may hide a Windows service from the view of standard service enumeration methods such as Get-Service, sc query, and services.exe.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "stop service",
                  "match_data": [
                    "api: OpenService",
                    "SERVICE_CONTROL_STOP",
                    "get service handle"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "continue service",
                  "match_data": [
                    "SERVICE_CONTROL_CONTINUE",
                    "api: OpenService",
                    "get service handle"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "pause service",
                  "match_data": [
                    "api: OpenService",
                    "get service handle",
                    "SERVICE_CONTROL_PAUSE"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "modify service",
                  "match_data": [
                    "api: OpenService",
                    "api: ChangeServiceConfig",
                    "get service handle"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "start service",
                  "match_data": [
                    "api: OpenService",
                    "api: StartService",
                    "get service handle"
                  ]
                }
              ]
            },
            {
              "id": "T1112",
              "name": "Modify Registry",
              "link": "https://attack.mitre.org/techniques/T1112/",
              "description": "Adversaries may interact with the Windows Registry as part of a variety of other techniques to aid in defense evasion, persistence, and execution.\nAccess to specific areas of the Registry depends on account permissions, with some keys requiring administrator-level access. The built-in Windows command-line utility Reg may be used for local or remote Registry modification. Other tools, such as remote access tools, may also contain functionality to interact with the Registry through the Windows API.\nThe Registry may be modified in order to hide configuration information or malicious payloads via Obfuscated Files or Information. The Registry may also be modified to Impair Defenses, such as by enabling macros for all Microsoft Office products, allowing privilege escalation without alerting the user, increasing the maximum number of allowed outbound requests, and/or modifying systems to store plaintext credentials in memory.\nThe Registry of a remote system may be modified to aid in execution of files as part of lateral movement. It requires the remote Registry service to be running on the target system. Often Valid Accounts are required, along with access to the remote system's SMB/Windows Admin Shares for RPC communication.\nFinally, Registry modifications may also include actions to hide keys, such as prepending key names with a null character, which will cause an error and/or be ignored when read via Reg or other utilities using the Win32 API. Adversaries may abuse these pseudo-hidden keys to conceal payloads/commands used to maintain persistence.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "delete registry value",
                  "match_data": [
                    "api: RegOpenKeyEx",
                    "create or open registry key",
                    "api: RegDeleteValue"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "delete registry key",
                  "match_data": [
                    "api: RegDeleteKey"
                  ]
                }
              ]
            },
            {
              "id": "T1547",
              "name": "Boot or Logon Autostart Execution",
              "link": "https://attack.mitre.org/techniques/T1547/",
              "description": "Adversaries may configure system settings to automatically execute a program during system boot or logon to maintain persistence or gain higher-level privileges on compromised systems. Operating systems may have mechanisms for automatically running a program on system boot or account logon. These mechanisms may include automatically executing programs that are placed in specially designated directories or are referenced by repositories that store configuration information, such as the Windows Registry. An adversary may achieve the same goal by modifying or extending features of the kernel.\nSince some boot or logon autostart programs run with higher privileges, an adversary may leverage these to elevate privileges."
            },
            {
              "id": "T1547.001",
              "name": "Registry Run Keys / Startup Folder",
              "link": "https://attack.mitre.org/techniques/T1547/001/",
              "description": "Adversaries may achieve persistence by adding a program to a startup folder or referencing it with a Registry run key. Adding an entry to the \"run keys\" in the Registry or startup folder will cause the program referenced to be executed when a user logs in. These programs will be executed under the context of the user and will have the account's associated permissions level.\nThe following run keys are created by default on Windows systems:\n\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnce\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnce\n\nRun keys may exist under multiple hives. The HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnceEx is also available but is not created by default on Windows Vista and newer. Registry run key entries can reference programs directly or list them as a dependency. For example, it is possible to load a DLL at logon using a \"Depend\" key with RunOnceEx: reg add HKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\RunOnceEx\\0001\\Depend /v 1 /d \"C:\\temp\\evil[.]dll\" \nPlacing a program within a startup folder will also cause that program to execute when a user logs in. There is a startup folder location for individual user accounts as well as a system-wide startup folder that will be checked regardless of which user account logs in. The startup folder path for the current user is C:\\Users\\[Username]\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup. The startup folder path for all users is C:\\ProgramData\\Microsoft\\Windows\\Start Menu\\Programs\\StartUp.\nThe following Registry keys can be used to set startup folder items for persistence:\n\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell Folders\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Shell Folders\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Shell Folders\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell Folders\n\nThe following Registry keys can control automatic startup of services during boot:\n\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServicesOnce\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServicesOnce\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServices\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServices\n\nUsing policy settings to specify startup programs creates corresponding values in either of two Registry keys:\n\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer\\Run\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer\\Run\n\nPrograms listed in the load value of the registry key HKEY_CURRENT_USER\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Windows run automatically for the currently logged-on user.\nBy default, the multistring BootExecute value of the registry key HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\Session Manager is set to autocheck autochk *. This value causes Windows, at startup, to check the file-system integrity of the hard disks if the system has been shut down abnormally. Adversaries can add other programs or processes to this registry value which will automatically launch at boot.\nAdversaries can use these configuration locations to execute malware, such as remote access tools, to maintain persistence through system reboots. Adversaries may also use Masquerading to make the Registry entries look as if they are associated with legitimate programs.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "persist via Run registry key",
                  "match_data": [
                    "regex: /Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run/i",
                    "HKEY_LOCAL_MACHINE",
                    "regex: /Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Policies\\\\Explorer\\\\Run/i"
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0004",
          "name": "Privilege Escalation",
          "link": "https://attack.mitre.org/tactics/TA0004/",
          "description": "The adversary is trying to gain higher-level permissions.\n\nPrivilege Escalation consists of techniques that adversaries use to gain higher-level permissions on a system or network. Adversaries can often enter and explore a network with unprivileged access but require elevated permissions to follow through on their objectives. Common approaches are to take advantage of system weaknesses, misconfigurations, and vulnerabilities. Examples of elevated access include: \n\n* SYSTEM/root level\n* local administrator\n* user account with admin-like access \n* user accounts with access to specific system or perform specific function\n\nThese techniques often overlap with Persistence techniques, as OS features that let an adversary persist can execute in an elevated context.  ",
          "techniques": [
            {
              "id": "T1543",
              "name": "Create or Modify System Process",
              "link": "https://attack.mitre.org/techniques/T1543/",
              "description": "Adversaries may create or modify system-level processes to repeatedly execute malicious payloads as part of persistence. When operating systems boot up, they can start processes that perform background system functions. On Windows and Linux, these system processes are referred to as services. On macOS, launchd processes known as Launch Daemon and Launch Agent are run to finish system initialization and load user specific parameters. \nAdversaries may install new services, daemons, or agents that can be configured to execute at startup or a repeatable interval in order to establish persistence. Similarly, adversaries may modify existing services, daemons, or agents to achieve the same effect.  \nServices, daemons, or agents may be created with administrator privileges but executed under root/SYSTEM privileges. Adversaries may leverage this functionality to create or modify system processes in order to escalate privileges.  "
            },
            {
              "id": "T1543.003",
              "name": "Windows Service",
              "link": "https://attack.mitre.org/techniques/T1543/003/",
              "description": "Adversaries may create or modify Windows services to repeatedly execute malicious payloads as part of persistence. When Windows boots up, it starts programs or applications called services that perform background system functions. Windows service configuration information, including the file path to the service's executable or recovery programs/commands, is stored in the Windows Registry.\nAdversaries may install a new service or modify an existing service to execute at startup in order to persist on a system. Service configurations can be set or modified using system utilities (such as sc.exe), by directly modifying the Registry, or by interacting directly with the Windows API. \nAdversaries may also use services to install and execute malicious drivers. For example, after dropping a driver file (ex: .sys) to disk, the payload can be loaded and registered via Native API functions such as CreateServiceW() (or manually via functions such as ZwLoadDriver() and ZwSetValueKey()), by creating the required service Registry values (i.e. Modify Registry), or by using command-line utilities such as PnPUtil.exe. Adversaries may leverage these drivers as Rootkits to hide the presence of malicious activity on a system. Adversaries may also load a signed yet vulnerable driver onto a compromised machine (known as \"Bring Your Own Vulnerable Driver\" (BYOVD)) as part of Exploitation for Privilege Escalation.\nServices may be created with administrator privileges but are executed under SYSTEM privileges, so an adversary may also use a service to escalate privileges. Adversaries may also directly start services through Service Execution.\nTo make detection analysis more challenging, malicious services may also incorporate Masquerade Task or Service (ex: using a service and/or payload name related to a legitimate OS or benign software component). Adversaries may also create ‘hidden’ services (i.e., Hide Artifacts), for example by using the sc sdset command to set service permissions via the Service Descriptor Definition Language (SDDL). This may hide a Windows service from the view of standard service enumeration methods such as Get-Service, sc query, and services.exe.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "stop service",
                  "match_data": [
                    "api: OpenService",
                    "SERVICE_CONTROL_STOP",
                    "get service handle"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "continue service",
                  "match_data": [
                    "SERVICE_CONTROL_CONTINUE",
                    "api: OpenService",
                    "get service handle"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "pause service",
                  "match_data": [
                    "api: OpenService",
                    "get service handle",
                    "SERVICE_CONTROL_PAUSE"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "modify service",
                  "match_data": [
                    "api: OpenService",
                    "api: ChangeServiceConfig",
                    "get service handle"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "start service",
                  "match_data": [
                    "api: OpenService",
                    "api: StartService",
                    "get service handle"
                  ]
                }
              ]
            },
            {
              "id": "T1548",
              "name": "Abuse Elevation Control Mechanism",
              "link": "https://attack.mitre.org/techniques/T1548/",
              "description": "Adversaries may circumvent mechanisms designed to control elevate privileges to gain higher-level permissions. Most modern systems contain native elevation control mechanisms that are intended to limit privileges that a user can perform on a machine. Authorization has to be granted to specific users in order to perform tasks that can be considered of higher risk. An adversary can perform several methods to take advantage of built-in control mechanisms in order to escalate privileges on a system."
            },
            {
              "id": "T1548.002",
              "name": "Bypass User Account Control",
              "link": "https://attack.mitre.org/techniques/T1548/002/",
              "description": "Adversaries may bypass UAC mechanisms to elevate process privileges on system. Windows User Account Control (UAC) allows a program to elevate its privileges (tracked as integrity levels ranging from low to high) to perform a task under administrator-level permissions, possibly by prompting the user for confirmation. The impact to the user ranges from denying the operation under high enforcement to allowing the user to perform the action if they are in the local administrators group and click through the prompt or allowing them to enter an administrator password to complete the action.\nIf the UAC protection level of a computer is set to anything but the highest level, certain Windows programs can elevate privileges or execute some elevated Component Object Model objects without prompting the user through the UAC notification box. An example of this is use of Rundll32 to load a specifically crafted DLL which loads an auto-elevated Component Object Model object and performs a file operation in a protected directory which would typically require elevated access. Malicious software may also be injected into a trusted process to gain elevated privileges without prompting a user.\nMany methods have been discovered to bypass UAC. The Github readme page for UACME contains an extensive list of methods that have been discovered and implemented, but may not be a comprehensive list of bypasses. Additional bypass methods are regularly discovered and some used in the wild, such as:\n\neventvwr.exe can auto-elevate and execute a specified binary or script.\n\nAnother bypass is possible through some lateral movement techniques if credentials for an account with administrator privileges are known, since UAC is a single system security mechanism, and the privilege or integrity of a process running on one system will be unknown on remote systems and default to high integrity.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "bypass UAC via ICMLuaUtil",
                  "match_data": [
                    "api: CoGetObject",
                    "{3E5FC7F9-9A51-4367-9063-A120244FBEC7}"
                  ]
                }
              ]
            },
            {
              "id": "T1134",
              "name": "Access Token Manipulation",
              "link": "https://attack.mitre.org/techniques/T1134/",
              "description": "Adversaries may modify access tokens to operate under a different user or system security context to perform actions and bypass access controls. Windows uses access tokens to determine the ownership of a running process. A user can manipulate access tokens to make a running process appear as though it is the child of a different process or belongs to someone other than the user that started the process. When this occurs, the process also takes on the security context associated with the new token.\nAn adversary can use built-in Windows API functions to copy access tokens from existing processes; this is known as token stealing. These token can then be applied to an existing process (i.e. Token Impersonation/Theft) or used to spawn a new process (i.e. Create Process with Token). An adversary must already be in a privileged user context (i.e. administrator) to steal a token. However, adversaries commonly use token stealing to elevate their security context from the administrator level to the SYSTEM level. An adversary can then use a token to authenticate to a remote system as the account for that token if the account has appropriate permissions on the remote system.\nAny standard user can use the runas command, and the Windows API functions, to create impersonation tokens; it does not require access to an administrator account. There are also other mechanisms, such as Active Directory fields, that can be used to modify access tokens.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "modify access privileges",
                  "match_data": [
                    "api: AdjustTokenPrivileges"
                  ]
                }
              ]
            },
            {
              "id": "T1547",
              "name": "Boot or Logon Autostart Execution",
              "link": "https://attack.mitre.org/techniques/T1547/",
              "description": "Adversaries may configure system settings to automatically execute a program during system boot or logon to maintain persistence or gain higher-level privileges on compromised systems. Operating systems may have mechanisms for automatically running a program on system boot or account logon. These mechanisms may include automatically executing programs that are placed in specially designated directories or are referenced by repositories that store configuration information, such as the Windows Registry. An adversary may achieve the same goal by modifying or extending features of the kernel.\nSince some boot or logon autostart programs run with higher privileges, an adversary may leverage these to elevate privileges."
            },
            {
              "id": "T1547.001",
              "name": "Registry Run Keys / Startup Folder",
              "link": "https://attack.mitre.org/techniques/T1547/001/",
              "description": "Adversaries may achieve persistence by adding a program to a startup folder or referencing it with a Registry run key. Adding an entry to the \"run keys\" in the Registry or startup folder will cause the program referenced to be executed when a user logs in. These programs will be executed under the context of the user and will have the account's associated permissions level.\nThe following run keys are created by default on Windows systems:\n\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnce\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnce\n\nRun keys may exist under multiple hives. The HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnceEx is also available but is not created by default on Windows Vista and newer. Registry run key entries can reference programs directly or list them as a dependency. For example, it is possible to load a DLL at logon using a \"Depend\" key with RunOnceEx: reg add HKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\RunOnceEx\\0001\\Depend /v 1 /d \"C:\\temp\\evil[.]dll\" \nPlacing a program within a startup folder will also cause that program to execute when a user logs in. There is a startup folder location for individual user accounts as well as a system-wide startup folder that will be checked regardless of which user account logs in. The startup folder path for the current user is C:\\Users\\[Username]\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup. The startup folder path for all users is C:\\ProgramData\\Microsoft\\Windows\\Start Menu\\Programs\\StartUp.\nThe following Registry keys can be used to set startup folder items for persistence:\n\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell Folders\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Shell Folders\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Shell Folders\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell Folders\n\nThe following Registry keys can control automatic startup of services during boot:\n\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServicesOnce\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServicesOnce\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServices\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServices\n\nUsing policy settings to specify startup programs creates corresponding values in either of two Registry keys:\n\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer\\Run\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer\\Run\n\nPrograms listed in the load value of the registry key HKEY_CURRENT_USER\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Windows run automatically for the currently logged-on user.\nBy default, the multistring BootExecute value of the registry key HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\Session Manager is set to autocheck autochk *. This value causes Windows, at startup, to check the file-system integrity of the hard disks if the system has been shut down abnormally. Adversaries can add other programs or processes to this registry value which will automatically launch at boot.\nAdversaries can use these configuration locations to execute malware, such as remote access tools, to maintain persistence through system reboots. Adversaries may also use Masquerading to make the Registry entries look as if they are associated with legitimate programs.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "persist via Run registry key",
                  "match_data": [
                    "regex: /Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Run/i",
                    "HKEY_LOCAL_MACHINE",
                    "regex: /Software\\\\Microsoft\\\\Windows\\\\CurrentVersion\\\\Policies\\\\Explorer\\\\Run/i"
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0040",
          "name": "Impact",
          "link": "https://attack.mitre.org/tactics/TA0040/",
          "description": "The adversary is trying to manipulate, interrupt, or destroy your systems and data.\n \nImpact consists of techniques that adversaries use to disrupt availability or compromise integrity by manipulating business and operational processes. Techniques used for impact can include destroying or tampering with data. In some cases, business processes can look fine, but may have been altered to benefit the adversaries’ goals. These techniques might be used by adversaries to follow through on their end goal or to provide cover for a confidentiality breach.",
          "techniques": [
            {
              "id": "T1489",
              "name": "Service Stop",
              "link": "https://attack.mitre.org/techniques/T1489/",
              "description": "Adversaries may stop or disable services on a system to render those services unavailable to legitimate users. Stopping critical services or processes can inhibit or stop response to an incident or aid in the adversary's overall objectives to cause damage to the environment. \nAdversaries may accomplish this by disabling individual services of high importance to an organization, such as MSExchangeIS, which will make Exchange content inaccessible. In some cases, adversaries may stop or disable many or all services to render systems unusable. Services or processes may not allow for modification of their data stores while running. Adversaries may stop services or processes in order to conduct Data Destruction or Data Encrypted for Impact on the data stores of services like Exchange and SQL Server, or on virtual machines hosted on ESXi infrastructure.\nThreat actors may also disable or stop service in cloud environments. For example, by leveraging the DisableAPIServiceAccess API in AWS, a threat actor may prevent the service from creating service-linked roles on new accounts in the AWS Organization.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "stop service",
                  "match_data": [
                    "api: OpenService",
                    "SERVICE_CONTROL_STOP",
                    "get service handle"
                  ]
                }
              ]
            },
            {
              "id": "T1529",
              "name": "System Shutdown/Reboot",
              "link": "https://attack.mitre.org/techniques/T1529/",
              "description": "Adversaries may shutdown/reboot systems to interrupt access to, or aid in the destruction of, those systems. Operating systems may contain commands to initiate a shutdown/reboot of a machine or network device. In some cases, these commands may also be used to initiate a shutdown/reboot of a remote computer or network device via Network Device CLI (e.g. reload). They may also include shutdown/reboot of a virtual machine via hypervisor / cloud consoles or command line tools.\nShutting down or rebooting systems may disrupt access to computer resources for legitimate users while also impeding incident response/recovery.\nAdversaries may also use Windows API functions, such as InitializeSystemShutdownExW or ExitWindowsEx, to force a system to shut down or reboot. Alternatively, the NtRaiseHardErroror ZwRaiseHardError Windows API functions with the ResponseOption parameter set to OptionShutdownSystem may deliver a “blue screen of death” (BSOD) to a system. In order to leverage these API functions, an adversary may need to acquire SeShutdownPrivilege (e.g., via Access Token Manipulation).\n In some cases, the system may not be able to boot again. \nAdversaries may attempt to shutdown/reboot a system after impacting it in other ways, such as Disk Structure Wipe or Inhibit System Recovery, to hasten the intended effects on system availability.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "shutdown system",
                  "match_data": [
                    "api: ExitWindowsEx"
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0005",
          "name": "Defense Evasion",
          "link": "https://attack.mitre.org/tactics/TA0005/",
          "description": "The adversary is trying to avoid being detected.\n\nDefense Evasion consists of techniques that adversaries use to avoid detection throughout their compromise. Techniques used for defense evasion include uninstalling/disabling security software or obfuscating/encrypting data and scripts. Adversaries also leverage and abuse trusted processes to hide and masquerade their malware. Other tactics’ techniques are cross-listed here when those techniques include the added benefit of subverting defenses. ",
          "techniques": [
            {
              "id": "T1222",
              "name": "File and Directory Permissions Modification",
              "link": "https://attack.mitre.org/techniques/T1222/",
              "description": "Adversaries may modify file or directory permissions/attributes to evade access control lists (ACLs) and access protected files. File and directory permissions are commonly managed by ACLs configured by the file or directory owner, or users with the appropriate permissions. File and directory ACL implementations vary by platform, but generally explicitly designate which users or groups can perform which actions (read, write, execute, etc.).\nModifications may include changing specific access rights, which may require taking ownership of a file or directory and/or elevated permissions depending on the file or directory’s existing permissions. This may enable malicious activity such as modifying, replacing, or deleting specific files or directories. Specific file and directory modifications may be a required step for many techniques, such as establishing Persistence via Accessibility Features, Boot or Logon Initialization Scripts, Unix Shell Configuration Modification, or tainting/hijacking other instrumental binary/configuration files via Hijack Execution Flow.\nAdversaries may also change permissions of symbolic links. For example, malware (particularly ransomware) may modify symbolic links and associated settings to enable access to files from local shortcuts with remote paths. ",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "set file attributes",
                  "match_data": [
                    "api: SetFileAttributes"
                  ]
                }
              ]
            },
            {
              "id": "T1070",
              "name": "Indicator Removal",
              "link": "https://attack.mitre.org/techniques/T1070/",
              "description": "Adversaries may delete or modify artifacts generated within systems to remove evidence of their presence or hinder defenses. Various artifacts may be created by an adversary or something that can be attributed to an adversary’s actions. Typically these artifacts are used as defensive indicators related to monitored events, such as strings from downloaded files, logs that are generated from user actions, and other data analyzed by defenders. Location, format, and type of artifact (such as command or login history) are often specific to each platform.\nRemoval of these indicators may interfere with event collection, reporting, or other processes used to detect intrusion activity. This may compromise the integrity of security solutions by causing notable events to go unreported. This activity may also impede forensic analysis and incident response, due to lack of sufficient data to determine what occurred."
            },
            {
              "id": "T1070.004",
              "name": "File Deletion",
              "link": "https://attack.mitre.org/techniques/T1070/004/",
              "description": "Adversaries may delete files left behind by the actions of their intrusion activity. Malware, tools, or other non-native files dropped or created on a system by an adversary (ex: Ingress Tool Transfer) may leave traces to indicate to what was done within a network and how. Removal of these files can occur during an intrusion, or as part of a post-intrusion process to minimize the adversary's footprint.\nThere are tools available from the host operating system to perform cleanup, but adversaries may use other tools as well. Examples of built-in Command and Scripting Interpreter functions include del on Windows, rm or unlink on Linux and macOS, and rm on ESXi.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "self delete",
                  "match_data": [
                    "regex: /(^|[\\&;\\|]\\s*)del(\\s.*)?/i",
                    "host-interaction/process/create",
                    "api: ShellExecute"
                  ]
                }
              ]
            },
            {
              "id": "T1112",
              "name": "Modify Registry",
              "link": "https://attack.mitre.org/techniques/T1112/",
              "description": "Adversaries may interact with the Windows Registry as part of a variety of other techniques to aid in defense evasion, persistence, and execution.\nAccess to specific areas of the Registry depends on account permissions, with some keys requiring administrator-level access. The built-in Windows command-line utility Reg may be used for local or remote Registry modification. Other tools, such as remote access tools, may also contain functionality to interact with the Registry through the Windows API.\nThe Registry may be modified in order to hide configuration information or malicious payloads via Obfuscated Files or Information. The Registry may also be modified to Impair Defenses, such as by enabling macros for all Microsoft Office products, allowing privilege escalation without alerting the user, increasing the maximum number of allowed outbound requests, and/or modifying systems to store plaintext credentials in memory.\nThe Registry of a remote system may be modified to aid in execution of files as part of lateral movement. It requires the remote Registry service to be running on the target system. Often Valid Accounts are required, along with access to the remote system's SMB/Windows Admin Shares for RPC communication.\nFinally, Registry modifications may also include actions to hide keys, such as prepending key names with a null character, which will cause an error and/or be ignored when read via Reg or other utilities using the Win32 API. Adversaries may abuse these pseudo-hidden keys to conceal payloads/commands used to maintain persistence.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "delete registry value",
                  "match_data": [
                    "api: RegOpenKeyEx",
                    "create or open registry key",
                    "api: RegDeleteValue"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "delete registry key",
                  "match_data": [
                    "api: RegDeleteKey"
                  ]
                }
              ]
            },
            {
              "id": "T1562",
              "name": "Impair Defenses",
              "link": "https://attack.mitre.org/techniques/T1562/",
              "description": "Adversaries may maliciously modify components of a victim environment in order to hinder or disable defensive mechanisms. This not only involves impairing preventative defenses, such as firewalls and anti-virus, but also detection capabilities that defenders can use to audit activity and identify malicious behavior. This may also span both native defenses as well as supplemental capabilities installed by users and administrators.\nAdversaries may also impair routine operations that contribute to defensive hygiene, such as blocking users from logging out, preventing a system from shutting down, or disabling or modifying the update process. Adversaries could also target event aggregation and analysis mechanisms, or otherwise disrupt these procedures by altering other system components. These restrictions can further enable malicious operations as well as the continued propagation of incidents."
            },
            {
              "id": "T1562.001",
              "name": "Disable or Modify Tools",
              "link": "https://attack.mitre.org/techniques/T1562/001/",
              "description": "Adversaries may modify and/or disable security tools to avoid possible detection of their malware/tools and activities. This may take many forms, such as killing security software processes or services, modifying / deleting Registry keys or configuration files so that tools do not operate properly, or other methods to interfere with security tools scanning or reporting information. Adversaries may also disable updates to prevent the latest security patches from reaching tools on victim systems.\nAdversaries may trigger a denial-of-service attack via legitimate system processes. It has been previously observed that the Windows Time Travel Debugging (TTD) monitor driver can be used to initiate a debugging session for a security tool (e.g., an EDR) and render the tool non-functional.  By hooking the debugger into the EDR process, all child processes from the EDR will be automatically suspended. The attacker can terminate any EDR helper processes (unprotected by Windows Protected Process Light) by abusing the Process Explorer driver. In combination this will halt any attempt to restart services and cause the tool to crash.\nAdversaries may also tamper with artifacts deployed and utilized by security tools. Security tools may make dynamic changes to system components in order to maintain visibility into specific events. For example, security products may load their own modules and/or modify those loaded by processes to facilitate data collection. Similar to Indicator Blocking, adversaries may unhook or otherwise modify these features added by tools (especially those that exist in userland or are otherwise potentially accessible to adversaries) to avoid detection. For example, adversaries may abuse the Windows process mitigation policy to block certain endpoint detection and response (EDR) products from loading their user-mode code via DLLs. By spawning a process with the PROCESS_CREATION_MITIGATION_POLICY_BLOCK_NON_MICROSOFT_BINARIES_ALWAYS_ON attribute using API calls like UpdateProcThreadAttribute, adversaries may evade detection by endpoint security solutions that rely on DLLs that are not signed by Microsoft. Alternatively, they may add new directories to an EDR tool’s exclusion list, enabling them to hide malicious files via File/Path Exclusions.\nAdversaries may also focus on specific applications such as Sysmon. For example, the “Start” and “Enable” values in HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\WMI\\Autologger\\EventLog-Microsoft-Windows-Sysmon-Operational may be modified to tamper with and potentially disable Sysmon logging. \nOn network devices, adversaries may attempt to skip digital signature verification checks by altering startup configuration files and effectively disabling firmware verification that typically occurs at boot.\nIn cloud environments, tools disabled by adversaries may include cloud monitoring agents that report back to services such as AWS CloudWatch or Google Cloud Monitor.\nFurthermore, although defensive tools may have anti-tampering mechanisms, adversaries may abuse tools such as legitimate rootkit removal kits to impair and/or disable these tools. For example, adversaries have used tools such as GMER to find and shut down hidden processes and antivirus software on infected systems.\nAdditionally, adversaries may exploit legitimate drivers from anti-virus software to gain access to kernel space (i.e. Exploitation for Privilege Escalation), which may lead to bypassing anti-tampering features.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "disable system features via registry on Windows",
                  "match_data": [
                    "set registry value",
                    "regex: /add/i",
                    "host-interaction/process/create"
                  ]
                }
              ]
            },
            {
              "id": "T1027",
              "name": "Obfuscated Files or Information",
              "link": "https://attack.mitre.org/techniques/T1027/",
              "description": "Adversaries may attempt to make an executable or file difficult to discover or analyze by encrypting, encoding, or otherwise obfuscating its contents on the system or in transit. This is common behavior that can be used across different platforms and the network to evade defenses. \nPayloads may be compressed, archived, or encrypted in order to avoid detection. These payloads may be used during Initial Access or later to mitigate detection. Sometimes a user's action may be required to open and Deobfuscate/Decode Files or Information for User Execution. The user may also be required to input a password to open a password protected compressed/encrypted file that was provided by the adversary.  Adversaries may also use compressed or archived scripts, such as JavaScript. \nPortions of files can also be encoded to hide the plain-text strings that would otherwise help defenders with discovery.  Payloads may also be split into separate, seemingly benign files that only reveal malicious functionality when reassembled. \nAdversaries may also abuse Command Obfuscation to obscure commands executed from payloads or directly via Command and Scripting Interpreter. Environment variables, aliases, characters, and other platform/language specific semantics can be used to evade signature based detections and application control mechanisms.   ",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "encode data using XOR",
                  "match_data": [
                    "nzxor",
                    "tight loop"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "encrypt data using AES"
                },
                {
                  "severity": "INFO",
                  "description": "encrypt data using RC4 KSA",
                  "match_data": [
                    "mnemonic: div",
                    "calculate modulo 256 via x86 assembly",
                    "mnemonic: and"
                  ]
                }
              ]
            },
            {
              "id": "T1548",
              "name": "Abuse Elevation Control Mechanism",
              "link": "https://attack.mitre.org/techniques/T1548/",
              "description": "Adversaries may circumvent mechanisms designed to control elevate privileges to gain higher-level permissions. Most modern systems contain native elevation control mechanisms that are intended to limit privileges that a user can perform on a machine. Authorization has to be granted to specific users in order to perform tasks that can be considered of higher risk. An adversary can perform several methods to take advantage of built-in control mechanisms in order to escalate privileges on a system."
            },
            {
              "id": "T1548.002",
              "name": "Bypass User Account Control",
              "link": "https://attack.mitre.org/techniques/T1548/002/",
              "description": "Adversaries may bypass UAC mechanisms to elevate process privileges on system. Windows User Account Control (UAC) allows a program to elevate its privileges (tracked as integrity levels ranging from low to high) to perform a task under administrator-level permissions, possibly by prompting the user for confirmation. The impact to the user ranges from denying the operation under high enforcement to allowing the user to perform the action if they are in the local administrators group and click through the prompt or allowing them to enter an administrator password to complete the action.\nIf the UAC protection level of a computer is set to anything but the highest level, certain Windows programs can elevate privileges or execute some elevated Component Object Model objects without prompting the user through the UAC notification box. An example of this is use of Rundll32 to load a specifically crafted DLL which loads an auto-elevated Component Object Model object and performs a file operation in a protected directory which would typically require elevated access. Malicious software may also be injected into a trusted process to gain elevated privileges without prompting a user.\nMany methods have been discovered to bypass UAC. The Github readme page for UACME contains an extensive list of methods that have been discovered and implemented, but may not be a comprehensive list of bypasses. Additional bypass methods are regularly discovered and some used in the wild, such as:\n\neventvwr.exe can auto-elevate and execute a specified binary or script.\n\nAnother bypass is possible through some lateral movement techniques if credentials for an account with administrator privileges are known, since UAC is a single system security mechanism, and the privilege or integrity of a process running on one system will be unknown on remote systems and default to high integrity.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "bypass UAC via ICMLuaUtil",
                  "match_data": [
                    "api: CoGetObject",
                    "{3E5FC7F9-9A51-4367-9063-A120244FBEC7}"
                  ]
                }
              ]
            },
            {
              "id": "T1134",
              "name": "Access Token Manipulation",
              "link": "https://attack.mitre.org/techniques/T1134/",
              "description": "Adversaries may modify access tokens to operate under a different user or system security context to perform actions and bypass access controls. Windows uses access tokens to determine the ownership of a running process. A user can manipulate access tokens to make a running process appear as though it is the child of a different process or belongs to someone other than the user that started the process. When this occurs, the process also takes on the security context associated with the new token.\nAn adversary can use built-in Windows API functions to copy access tokens from existing processes; this is known as token stealing. These token can then be applied to an existing process (i.e. Token Impersonation/Theft) or used to spawn a new process (i.e. Create Process with Token). An adversary must already be in a privileged user context (i.e. administrator) to steal a token. However, adversaries commonly use token stealing to elevate their security context from the administrator level to the SYSTEM level. An adversary can then use a token to authenticate to a remote system as the account for that token if the account has appropriate permissions on the remote system.\nAny standard user can use the runas command, and the Windows API functions, to create impersonation tokens; it does not require access to an administrator account. There are also other mechanisms, such as Active Directory fields, that can be used to modify access tokens.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "modify access privileges",
                  "match_data": [
                    "api: AdjustTokenPrivileges"
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0002",
          "name": "Execution",
          "link": "https://attack.mitre.org/tactics/TA0002/",
          "description": "The adversary is trying to run malicious code.\n\nExecution consists of techniques that result in adversary-controlled code running on a local or remote system. Techniques that run malicious code are often paired with techniques from all other tactics to achieve broader goals, like exploring a network or stealing data. For example, an adversary might use a remote access tool to run a PowerShell script that does Remote System Discovery. ",
          "techniques": [
            {
              "id": "T1129",
              "name": "Shared Modules",
              "link": "https://attack.mitre.org/techniques/T1129/",
              "description": "Adversaries may execute malicious payloads via loading shared modules. Shared modules are executable files that are loaded into processes to provide access to reusable code, such as specific custom functions or invoking OS API functions (i.e., Native API).\nAdversaries may use this functionality as a way to execute arbitrary payloads on a victim system. For example, adversaries can modularize functionality of their malware into shared objects that perform various functions such as managing C2 network communications or execution of specific actions on objective.\nThe Linux & macOS module loader can load and execute shared objects from arbitrary local paths. This functionality resides in dlfcn.h in functions such as dlopen and dlsym. Although macOS can execute .so files, common practice uses .dylib files.\nThe Windows module loader can be instructed to load DLLs from arbitrary local paths and arbitrary Universal Naming Convention (UNC) network paths. This functionality resides in NTDLL.dll and is part of the Windows Native API which is called from functions like LoadLibrary at run time.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "link function at runtime on Windows",
                  "match_data": [
                    "api: GetProcAddress"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "parse PE header",
                  "match_data": [
                    "IMAGE_DOS_SIGNATURE (MZ)",
                    "mnemonic: cmp",
                    "IMAGE_NT_SIGNATURE (PE)"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "link many functions at runtime"
                }
              ]
            },
            {
              "id": "T1059",
              "name": "Command and Scripting Interpreter",
              "link": "https://attack.mitre.org/techniques/T1059/",
              "description": "Adversaries may abuse command and script interpreters to execute commands, scripts, or binaries. These interfaces and languages provide ways of interacting with computer systems and are a common feature across many different platforms. Most systems come with some built-in command-line interface and scripting capabilities, for example, macOS and Linux distributions include some flavor of Unix Shell while Windows installations include the Windows Command Shell and PowerShell.\nThere are also cross-platform interpreters such as Python, as well as those commonly associated with client applications such as JavaScript and Visual Basic.\nAdversaries may abuse these technologies in various ways as a means of executing arbitrary commands. Commands and scripts can be embedded in Initial Access payloads delivered to victims as lure documents or as secondary payloads downloaded from an existing C2. Adversaries may also execute commands through interactive terminals/shells, as well as utilize various Remote Services in order to achieve remote Execution."
            },
            {
              "id": "T1059.003",
              "name": "Windows Command Shell",
              "link": "https://attack.mitre.org/techniques/T1059/003/",
              "description": "Adversaries may abuse the Windows command shell for execution. The Windows command shell (cmd) is the primary command prompt on Windows systems. The Windows command prompt can be used to control almost any aspect of a system, with various permission levels required for different subsets of commands. The command prompt can be invoked remotely via Remote Services such as SSH.\nBatch files (ex: .bat or .cmd) also provide the shell with a list of sequential commands to run, as well as normal scripting operations such as conditionals and loops. Common uses of batch files include long or repetitive tasks, or the need to run the same set of commands on multiple systems.\nAdversaries may leverage cmd to execute various commands and payloads. Common uses include cmd to execute a single command, or abusing cmd interactively with input and output forwarded over a command and control channel.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "execute shell command and capture output",
                  "match_data": [
                    "api: PeekNamedPipe",
                    "create a process with modified I/O handles and window",
                    "api: ReadFile"
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "create reverse shell",
                  "match_data": [
                    "api: PeekNamedPipe",
                    "write pipe",
                    "api: ReadFile"
                  ]
                }
              ]
            },
            {
              "id": "T1569",
              "name": "System Services",
              "link": "https://attack.mitre.org/techniques/T1569/",
              "description": "Adversaries may abuse system services or daemons to execute commands or programs. Adversaries can execute malicious content by interacting with or creating services either locally or remotely. Many services are set to run at boot, which can aid in achieving persistence (Create or Modify System Process), but adversaries can also abuse services for one-time or temporary execution."
            },
            {
              "id": "T1569.002",
              "name": "Service Execution",
              "link": "https://attack.mitre.org/techniques/T1569/002/",
              "description": "Adversaries may abuse the Windows service control manager to execute malicious commands or payloads. The Windows service control manager (services.exe) is an interface to manage and manipulate services. The service control manager is accessible to users via GUI components as well as system utilities such as sc.exe and Net.\nPsExec can also be used to execute commands or payloads via a temporary Windows service created through the service control manager API. Tools such as PsExec and sc.exe can accept remote servers as arguments and may be used to conduct remote execution.\nAdversaries may leverage these mechanisms to execute malicious content. This can be done by either executing a new or modified service. This technique is the execution used in conjunction with Windows Service during service persistence or privilege escalation.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "modify service",
                  "match_data": [
                    "api: OpenService",
                    "api: ChangeServiceConfig",
                    "get service handle"
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    "CAPE Sandbox": {
      "tactics": [
        {
          "id": "TA0006",
          "name": "Credential Access",
          "link": "https://attack.mitre.org/tactics/TA0006/",
          "description": "The adversary is trying to steal account names and passwords.\n\nCredential Access consists of techniques for stealing credentials like account names and passwords. Techniques used to get credentials include keylogging or credential dumping. Using legitimate credentials can give adversaries access to systems, make them harder to detect, and provide the opportunity to create more accounts to help achieve their goals.",
          "techniques": [
            {
              "id": "T1003",
              "name": "OS Credential Dumping",
              "link": "https://attack.mitre.org/techniques/T1003/",
              "description": "Adversaries may attempt to dump credentials to obtain account login and credential material, normally in the form of a hash or a clear text password. Credentials can be obtained from OS caches, memory, or structures. Credentials can then be used to perform Lateral Movement and access restricted information.\nSeveral of the tools mentioned in associated sub-techniques may be used by both adversaries and professional security testers. Additional custom tools likely exist as well.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Harvests information related to installed instant messenger clients",
                  "match_data": [
                    "C:\\Users\\Bruno\\AppData\\Roaming\\Digsby\\digsby.dat",
                    "C:\\Users\\Bruno\\AppData\\Roaming\\MySpace\\IM\\users.txt",
                    "HKEY_CURRENT_USER\\Software\\Paltalk"
                  ]
                },
                {
                  "severity": "MEDIUM",
                  "description": "Steals private information from local Internet browsers",
                  "match_data": [
                    "pid: 4124"
                  ]
                },
                {
                  "severity": "MEDIUM",
                  "description": "Harvests information related to installed mail clients",
                  "match_data": [
                    "HKEY_CURRENT_USER\\SOFTWARE\\Microsoft\\Office\\16.0\\Outlook\\Profiles\\Outlook\\9375CFF0413111d3B88A00104B2A6676\\00000001\\IMAP User",
                    "HKEY_CURRENT_USER\\SOFTWARE\\Microsoft\\Office\\16.0\\Outlook\\Profiles\\Outlook\\9375CFF0413111d3B88A00104B2A6676\\00000002",
                    "HKEY_CURRENT_USER\\SOFTWARE\\Microsoft\\Office\\16.0\\Outlook\\Profiles\\Outlook\\9375CFF0413111d3B88A00104B2A6676\\00000001\\HTTP User",
                    "HKEY_CURRENT_USER\\SOFTWARE\\Microsoft\\Office\\16.0\\Outlook\\Profiles\\Outlook\\de71dff268f8c642af4d271939e94eba",
                    "HKEY_CURRENT_USER\\SOFTWARE\\Microsoft\\Office\\16.0\\Outlook\\Profiles\\Outlook\\3517490d76624c419a828607e2a54604"
                  ]
                }
              ]
            },
            {
              "id": "T1539",
              "name": "Steal Web Session Cookie",
              "link": "https://attack.mitre.org/techniques/T1539/",
              "description": "An adversary may steal web application or service session cookies and use them to gain access to web applications or Internet services as an authenticated user without needing credentials. Web applications and services often use session cookies as an authentication token after a user has authenticated to a website.\nCookies are often valid for an extended period of time, even if the web application is not actively used. Cookies can be found on disk, in the process memory of the browser, and in network traffic to remote systems. Additionally, other applications on the targets machine might store sensitive authentication cookies in memory (e.g. apps which authenticate to cloud services). Session cookies can be used to bypasses some multi-factor authentication protocols.\nThere are several examples of malware targeting cookies from web browsers on the local system. Adversaries may also steal cookies by injecting malicious JavaScript content into websites or relying on User Execution by tricking victims into running malicious JavaScript in their browser.\nThere are also open source frameworks such as Evilginx2 and Muraena that can gather session cookies through a malicious proxy (e.g., Adversary-in-the-Middle) that can be set up by an adversary and used in phishing campaigns.\nAfter an adversary acquires a valid cookie, they can then perform a Web Session Cookie technique to login to the corresponding web application.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Touches a file containing cookies, possibly for information gathering"
                }
              ]
            },
            {
              "id": "T1555",
              "name": "Credentials from Password Stores",
              "link": "https://attack.mitre.org/techniques/T1555/",
              "description": "Adversaries may search for common password storage locations to obtain user credentials. Passwords are stored in several places on a system, depending on the operating system or application holding the credentials. There are also specific applications and services that store passwords to make them easier for users to manage and maintain, such as password managers and cloud secrets vaults. Once credentials are obtained, they can be used to perform lateral movement and access restricted information.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Steals private information from local Internet browsers",
                  "match_data": [
                    "pid: 4124"
                  ]
                }
              ]
            },
            {
              "id": "T1552",
              "name": "Unsecured Credentials",
              "link": "https://attack.mitre.org/techniques/T1552/",
              "description": "Adversaries may search compromised systems to find and obtain insecurely stored credentials. These credentials can be stored and/or misplaced in many locations on a system, including plaintext files (e.g. Shell History), operating system or application-specific repositories (e.g. Credentials in Registry),  or other specialized files/artifacts (e.g. Private Keys).",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Harvests information related to installed instant messenger clients",
                  "match_data": [
                    "C:\\Users\\Bruno\\AppData\\Roaming\\Digsby\\digsby.dat",
                    "C:\\Users\\Bruno\\AppData\\Roaming\\MySpace\\IM\\users.txt",
                    "HKEY_CURRENT_USER\\Software\\Paltalk"
                  ]
                },
                {
                  "severity": "MEDIUM",
                  "description": "Steals private information from local Internet browsers",
                  "match_data": [
                    "pid: 4124"
                  ]
                },
                {
                  "severity": "MEDIUM",
                  "description": "Harvests information related to installed mail clients",
                  "match_data": [
                    "HKEY_CURRENT_USER\\SOFTWARE\\Microsoft\\Office\\16.0\\Outlook\\Profiles\\Outlook\\9375CFF0413111d3B88A00104B2A6676\\00000001\\IMAP User",
                    "HKEY_CURRENT_USER\\SOFTWARE\\Microsoft\\Office\\16.0\\Outlook\\Profiles\\Outlook\\9375CFF0413111d3B88A00104B2A6676\\00000002",
                    "HKEY_CURRENT_USER\\SOFTWARE\\Microsoft\\Office\\16.0\\Outlook\\Profiles\\Outlook\\9375CFF0413111d3B88A00104B2A6676\\00000001\\HTTP User",
                    "HKEY_CURRENT_USER\\SOFTWARE\\Microsoft\\Office\\16.0\\Outlook\\Profiles\\Outlook\\de71dff268f8c642af4d271939e94eba",
                    "HKEY_CURRENT_USER\\SOFTWARE\\Microsoft\\Office\\16.0\\Outlook\\Profiles\\Outlook\\3517490d76624c419a828607e2a54604"
                  ]
                }
              ]
            },
            {
              "id": "T1555.003",
              "name": "Credentials from Web Browsers",
              "link": "https://attack.mitre.org/techniques/T1555/003/",
              "description": "Adversaries may acquire credentials from web browsers by reading files specific to the target browser. Web browsers commonly save credentials such as website usernames and passwords so that they do not need to be entered manually in the future. Web browsers typically store the credentials in an encrypted format within a credential store; however, methods exist to extract plaintext credentials from web browsers.\nFor example, on Windows systems, encrypted credentials may be obtained from Google Chrome by reading a database file, AppData\\Local\\Google\\Chrome\\User Data\\Default\\Login Data and executing a SQL query: SELECT action_url, username_value, password_value FROM logins;. The plaintext password can then be obtained by passing the encrypted credentials to the Windows API function CryptUnprotectData, which uses the victim’s cached logon credentials as the decryption key.\nAdversaries have executed similar procedures for common web browsers such as FireFox, Safari, Edge, etc. Windows stores Internet Explorer and Microsoft Edge credentials in Credential Lockers managed by the Windows Credential Manager.\nAdversaries may also acquire credentials by searching web browser process memory for patterns that commonly match credentials.\nAfter acquiring credentials from web browsers, adversaries may attempt to recycle the credentials across different systems and/or accounts in order to expand access. This can result in significantly furthering an adversary's objective in cases where credentials gained from web browsers overlap with privileged accounts (e.g. domain administrator).",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Steals private information from local Internet browsers",
                  "match_data": [
                    "pid: 4124"
                  ]
                }
              ]
            },
            {
              "id": "T1552.001",
              "name": "Credentials In Files",
              "link": "https://attack.mitre.org/techniques/T1552/001/",
              "description": "Adversaries may search local file systems and remote file shares for files containing insecurely stored credentials. These can be files created by users to store their own credentials, shared credential stores for a group of individuals, configuration files containing passwords for a system or service, or source code/binary files containing embedded passwords.\nIt is possible to extract passwords from backups or saved virtual machines through OS Credential Dumping. Passwords may also be obtained from Group Policy Preferences stored on the Windows Domain Controller.\nIn cloud and/or containerized environments, authenticated user and service account credentials are often stored in local configuration and credential files. They may also be found as parameters to deployment commands in container logs. In some cases, these files can be copied and reused on another machine or the contents can be read and then used to authenticate without needing to copy any files.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Harvests information related to installed instant messenger clients",
                  "match_data": [
                    "C:\\Users\\Bruno\\AppData\\Roaming\\Digsby\\digsby.dat",
                    "C:\\Users\\Bruno\\AppData\\Roaming\\MySpace\\IM\\users.txt",
                    "HKEY_CURRENT_USER\\Software\\Paltalk"
                  ]
                },
                {
                  "severity": "MEDIUM",
                  "description": "Steals private information from local Internet browsers",
                  "match_data": [
                    "pid: 4124"
                  ]
                },
                {
                  "severity": "MEDIUM",
                  "description": "Harvests information related to installed mail clients",
                  "match_data": [
                    "HKEY_CURRENT_USER\\SOFTWARE\\Microsoft\\Office\\16.0\\Outlook\\Profiles\\Outlook\\9375CFF0413111d3B88A00104B2A6676\\00000001\\IMAP User",
                    "HKEY_CURRENT_USER\\SOFTWARE\\Microsoft\\Office\\16.0\\Outlook\\Profiles\\Outlook\\9375CFF0413111d3B88A00104B2A6676\\00000002",
                    "HKEY_CURRENT_USER\\SOFTWARE\\Microsoft\\Office\\16.0\\Outlook\\Profiles\\Outlook\\9375CFF0413111d3B88A00104B2A6676\\00000001\\HTTP User",
                    "HKEY_CURRENT_USER\\SOFTWARE\\Microsoft\\Office\\16.0\\Outlook\\Profiles\\Outlook\\de71dff268f8c642af4d271939e94eba",
                    "HKEY_CURRENT_USER\\SOFTWARE\\Microsoft\\Office\\16.0\\Outlook\\Profiles\\Outlook\\3517490d76624c419a828607e2a54604"
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0005",
          "name": "Defense Evasion",
          "link": "https://attack.mitre.org/tactics/TA0005/",
          "description": "The adversary is trying to avoid being detected.\n\nDefense Evasion consists of techniques that adversaries use to avoid detection throughout their compromise. Techniques used for defense evasion include uninstalling/disabling security software or obfuscating/encrypting data and scripts. Adversaries also leverage and abuse trusted processes to hide and masquerade their malware. Other tactics’ techniques are cross-listed here when those techniques include the added benefit of subverting defenses. ",
          "techniques": [
            {
              "id": "T1014",
              "name": "Rootkit",
              "link": "https://attack.mitre.org/techniques/T1014/",
              "description": "Adversaries may use rootkits to hide the presence of programs, files, network connections, services, drivers, and other system components. Rootkits are programs that hide the existence of malware by intercepting/hooking and modifying operating system API calls that supply system information.  \nRootkits or rootkit enabling functionality may reside at the user or kernel level in the operating system or lower, to include a hypervisor or System Firmware.  Rootkits have been seen for Windows, Linux, and Mac OS X systems.  \nRootkits that reside or modify boot sectors are known as Bootkits and specifically target the boot process of the operating system.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Attempted to write directly to a physical drive",
                  "match_data": [
                    "\\??\\PhysicalDrive0"
                  ]
                }
              ]
            },
            {
              "id": "T1548",
              "name": "Abuse Elevation Control Mechanism",
              "link": "https://attack.mitre.org/techniques/T1548/",
              "description": "Adversaries may circumvent mechanisms designed to control elevate privileges to gain higher-level permissions. Most modern systems contain native elevation control mechanisms that are intended to limit privileges that a user can perform on a machine. Authorization has to be granted to specific users in order to perform tasks that can be considered of higher risk. An adversary can perform several methods to take advantage of built-in control mechanisms in order to escalate privileges on a system.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Attempts to modify UAC prompt behavior"
                }
              ]
            },
            {
              "id": "T1548.002",
              "name": "Bypass User Account Control",
              "link": "https://attack.mitre.org/techniques/T1548/002/",
              "description": "Adversaries may bypass UAC mechanisms to elevate process privileges on system. Windows User Account Control (UAC) allows a program to elevate its privileges (tracked as integrity levels ranging from low to high) to perform a task under administrator-level permissions, possibly by prompting the user for confirmation. The impact to the user ranges from denying the operation under high enforcement to allowing the user to perform the action if they are in the local administrators group and click through the prompt or allowing them to enter an administrator password to complete the action.\nIf the UAC protection level of a computer is set to anything but the highest level, certain Windows programs can elevate privileges or execute some elevated Component Object Model objects without prompting the user through the UAC notification box. An example of this is use of Rundll32 to load a specifically crafted DLL which loads an auto-elevated Component Object Model object and performs a file operation in a protected directory which would typically require elevated access. Malicious software may also be injected into a trusted process to gain elevated privileges without prompting a user.\nMany methods have been discovered to bypass UAC. The Github readme page for UACME contains an extensive list of methods that have been discovered and implemented, but may not be a comprehensive list of bypasses. Additional bypass methods are regularly discovered and some used in the wild, such as:\n\neventvwr.exe can auto-elevate and execute a specified binary or script.\n\nAnother bypass is possible through some lateral movement techniques if credentials for an account with administrator privileges are known, since UAC is a single system security mechanism, and the privilege or integrity of a process running on one system will be unknown on remote systems and default to high integrity.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Attempts to modify UAC prompt behavior"
                }
              ]
            },
            {
              "id": "T1542",
              "name": "Pre-OS Boot",
              "link": "https://attack.mitre.org/techniques/T1542/",
              "description": "Adversaries may abuse Pre-OS Boot mechanisms as a way to establish persistence on a system. During the booting process of a computer, firmware and various startup services are loaded before the operating system. These programs control flow of execution before the operating system takes control.\nAdversaries may overwrite data in boot drivers or firmware such as BIOS (Basic Input/Output System) and The Unified Extensible Firmware Interface (UEFI) to persist on systems at a layer below the operating system. This can be particularly difficult to detect as malware at this level will not be detected by host software-based defenses.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Attempted to write directly to a physical drive",
                  "match_data": [
                    "\\??\\PhysicalDrive0"
                  ]
                }
              ]
            },
            {
              "id": "T1542.003",
              "name": "Bootkit",
              "link": "https://attack.mitre.org/techniques/T1542/003/",
              "description": "Adversaries may use bootkits to persist on systems. A bootkit is a malware variant that modifies the boot sectors of a hard drive, allowing malicious code to execute before a computer's operating system has loaded. Bootkits reside at a layer below the operating system and may make it difficult to perform full remediation unless an organization suspects one was used and can act accordingly.\nIn BIOS systems, a bootkit may modify the Master Boot Record (MBR) and/or Volume Boot Record (VBR). The MBR is the section of disk that is first loaded after completing hardware initialization by the BIOS. It is the location of the boot loader. An adversary who has raw access to the boot drive may overwrite this area, diverting execution during startup from the normal boot loader to adversary code.\nThe MBR passes control of the boot process to the VBR. Similar to the case of MBR, an adversary who has raw access to the boot drive may overwrite the VBR to divert execution during startup to adversary code.\nIn UEFI (Unified Extensible Firmware Interface) systems, a bootkit may instead create or modify files in the EFI system partition (ESP). The ESP is a partition on data storage used by devices containing UEFI that allows the system to boot the OS and other utilities used by the system. An adversary can use the newly created or patched files in the ESP to run malicious kernel code.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Uses suspicious IO control codes",
                  "match_data": [
                    "pid: 5012"
                  ]
                },
                {
                  "severity": "MEDIUM",
                  "description": "Attempted to write directly to a physical drive",
                  "match_data": [
                    "\\??\\PhysicalDrive0"
                  ]
                }
              ]
            },
            {
              "id": "T1564",
              "name": "Hide Artifacts",
              "link": "https://attack.mitre.org/techniques/T1564/",
              "description": "Adversaries may attempt to hide artifacts associated with their behaviors to evade detection. Operating systems may have features to hide various artifacts, such as important system files and administrative task execution, to avoid disrupting user work environments and prevent users from changing files or features on the system. Adversaries may abuse these features to hide artifacts such as files, directories, user accounts, or other system activity to evade detection.\nAdversaries may also attempt to hide artifacts associated with malicious behavior by creating computing regions that are isolated from common security instrumentation, such as through the use of virtualization technology.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Creates a hidden or system file",
                  "match_data": [
                    "pid: 864",
                    "C:\\Windows\\ServiceProfiles\\LocalService\\AppData\\Local\\FontCache\\Fonts\\Download-1.tmp"
                  ]
                }
              ]
            },
            {
              "id": "T1562",
              "name": "Impair Defenses",
              "link": "https://attack.mitre.org/techniques/T1562/",
              "description": "Adversaries may maliciously modify components of a victim environment in order to hinder or disable defensive mechanisms. This not only involves impairing preventative defenses, such as firewalls and anti-virus, but also detection capabilities that defenders can use to audit activity and identify malicious behavior. This may also span both native defenses as well as supplemental capabilities installed by users and administrators.\nAdversaries may also impair routine operations that contribute to defensive hygiene, such as blocking users from logging out, preventing a system from shutting down, or disabling or modifying the update process. Adversaries could also target event aggregation and analysis mechanisms, or otherwise disrupt these procedures by altering other system components. These restrictions can further enable malicious operations as well as the continued propagation of incidents.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Tries to unhook or modify Windows functions monitored by CAPE",
                  "match_data": [
                    "pid: 4124",
                    "pid: 624",
                    "{\"unhook\": \"function_name: PStoreCreateInstance, type: modification\"}"
                  ]
                }
              ]
            },
            {
              "id": "T1055",
              "name": "Process Injection",
              "link": "https://attack.mitre.org/techniques/T1055/",
              "description": "Adversaries may inject code into processes in order to evade process-based defenses as well as possibly elevate privileges. Process injection is a method of executing arbitrary code in the address space of a separate live process. Running code in the context of another process may allow access to the process's memory, system/network resources, and possibly elevated privileges. Execution via process injection may also evade detection from security products since the execution is masked under a legitimate process. \nThere are many different ways to inject code into a process, many of which abuse legitimate functionalities. These implementations exist for every major OS but are typically platform specific. \nMore sophisticated samples may perform multiple process injections to segment modules and further evade detection, utilizing named pipes or other inter-process communication (IPC) mechanisms as a communication channel. ",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Resumed a thread in another process",
                  "match_data": [
                    "Process explore.exe with process ID 5308 resumed a thread in another process with the process ID 4124",
                    "pid: 5308"
                  ]
                }
              ]
            },
            {
              "id": "T1112",
              "name": "Modify Registry",
              "link": "https://attack.mitre.org/techniques/T1112/",
              "description": "Adversaries may interact with the Windows Registry as part of a variety of other techniques to aid in defense evasion, persistence, and execution.\nAccess to specific areas of the Registry depends on account permissions, with some keys requiring administrator-level access. The built-in Windows command-line utility Reg may be used for local or remote Registry modification. Other tools, such as remote access tools, may also contain functionality to interact with the Registry through the Windows API.\nThe Registry may be modified in order to hide configuration information or malicious payloads via Obfuscated Files or Information. The Registry may also be modified to Impair Defenses, such as by enabling macros for all Microsoft Office products, allowing privilege escalation without alerting the user, increasing the maximum number of allowed outbound requests, and/or modifying systems to store plaintext credentials in memory.\nThe Registry of a remote system may be modified to aid in execution of files as part of lateral movement. It requires the remote Registry service to be running on the target system. Often Valid Accounts are required, along with access to the remote system's SMB/Windows Admin Shares for RPC communication.\nFinally, Registry modifications may also include actions to hide keys, such as prepending key names with a null character, which will cause an error and/or be ignored when read via Reg or other utilities using the Win32 API. Adversaries may abuse these pseudo-hidden keys to conceal payloads/commands used to maintain persistence.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Attempts to modify UAC prompt behavior"
                },
                {
                  "severity": "MEDIUM",
                  "description": "Installs itself for autorun at Windows startup",
                  "match_data": [
                    "pid: 4124",
                    "pid: 624"
                  ]
                }
              ]
            },
            {
              "id": "T1070",
              "name": "Indicator Removal",
              "link": "https://attack.mitre.org/techniques/T1070/",
              "description": "Adversaries may delete or modify artifacts generated within systems to remove evidence of their presence or hinder defenses. Various artifacts may be created by an adversary or something that can be attributed to an adversary’s actions. Typically these artifacts are used as defensive indicators related to monitored events, such as strings from downloaded files, logs that are generated from user actions, and other data analyzed by defenders. Location, format, and type of artifact (such as command or login history) are often specific to each platform.\nRemoval of these indicators may interfere with event collection, reporting, or other processes used to detect intrusion activity. This may compromise the integrity of security solutions by causing notable events to go unreported. This activity may also impede forensic analysis and incident response, due to lack of sufficient data to determine what occurred.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Deletes executed files from disk",
                  "match_data": [
                    "C:\\Users\\Bruno\\AppData\\Local\\Temp\\blyivm",
                    "C:\\Users\\Bruno\\AppData\\Local\\Temp\\lndawfukl",
                    "C:\\Users\\Bruno\\AppData\\Local\\Temp\\dsxoupvk",
                    "C:\\Users\\Bruno\\AppData\\Local\\Temp\\fmdgvzgmkeo",
                    "C:\\Users\\Bruno\\AppData\\Local\\Temp\\sohxnmchypevsvnc"
                  ]
                }
              ]
            },
            {
              "id": "T1562.001",
              "name": "Disable or Modify Tools",
              "link": "https://attack.mitre.org/techniques/T1562/001/",
              "description": "Adversaries may modify and/or disable security tools to avoid possible detection of their malware/tools and activities. This may take many forms, such as killing security software processes or services, modifying / deleting Registry keys or configuration files so that tools do not operate properly, or other methods to interfere with security tools scanning or reporting information. Adversaries may also disable updates to prevent the latest security patches from reaching tools on victim systems.\nAdversaries may trigger a denial-of-service attack via legitimate system processes. It has been previously observed that the Windows Time Travel Debugging (TTD) monitor driver can be used to initiate a debugging session for a security tool (e.g., an EDR) and render the tool non-functional.  By hooking the debugger into the EDR process, all child processes from the EDR will be automatically suspended. The attacker can terminate any EDR helper processes (unprotected by Windows Protected Process Light) by abusing the Process Explorer driver. In combination this will halt any attempt to restart services and cause the tool to crash.\nAdversaries may also tamper with artifacts deployed and utilized by security tools. Security tools may make dynamic changes to system components in order to maintain visibility into specific events. For example, security products may load their own modules and/or modify those loaded by processes to facilitate data collection. Similar to Indicator Blocking, adversaries may unhook or otherwise modify these features added by tools (especially those that exist in userland or are otherwise potentially accessible to adversaries) to avoid detection. For example, adversaries may abuse the Windows process mitigation policy to block certain endpoint detection and response (EDR) products from loading their user-mode code via DLLs. By spawning a process with the PROCESS_CREATION_MITIGATION_POLICY_BLOCK_NON_MICROSOFT_BINARIES_ALWAYS_ON attribute using API calls like UpdateProcThreadAttribute, adversaries may evade detection by endpoint security solutions that rely on DLLs that are not signed by Microsoft. Alternatively, they may add new directories to an EDR tool’s exclusion list, enabling them to hide malicious files via File/Path Exclusions.\nAdversaries may also focus on specific applications such as Sysmon. For example, the “Start” and “Enable” values in HKEY_LOCAL_MACHINE\\SYSTEM\\CurrentControlSet\\Control\\WMI\\Autologger\\EventLog-Microsoft-Windows-Sysmon-Operational may be modified to tamper with and potentially disable Sysmon logging. \nOn network devices, adversaries may attempt to skip digital signature verification checks by altering startup configuration files and effectively disabling firmware verification that typically occurs at boot.\nIn cloud environments, tools disabled by adversaries may include cloud monitoring agents that report back to services such as AWS CloudWatch or Google Cloud Monitor.\nFurthermore, although defensive tools may have anti-tampering mechanisms, adversaries may abuse tools such as legitimate rootkit removal kits to impair and/or disable these tools. For example, adversaries have used tools such as GMER to find and shut down hidden processes and antivirus software on infected systems.\nAdditionally, adversaries may exploit legitimate drivers from anti-virus software to gain access to kernel space (i.e. Exploitation for Privilege Escalation), which may lead to bypassing anti-tampering features.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Tries to unhook or modify Windows functions monitored by CAPE",
                  "match_data": [
                    "pid: 4124",
                    "pid: 624",
                    "{\"unhook\": \"function_name: PStoreCreateInstance, type: modification\"}"
                  ]
                }
              ]
            },
            {
              "id": "T1564.001",
              "name": "Hidden Files and Directories",
              "link": "https://attack.mitre.org/techniques/T1564/001/",
              "description": "Adversaries may set files and directories to be hidden to evade detection mechanisms. To prevent normal users from accidentally changing special files on a system, most operating systems have the concept of a ‘hidden’ file. These files don’t show up when a user browses the file system with a GUI or when using normal commands on the command line. Users must explicitly ask to show the hidden files either via a series of Graphical User Interface (GUI) prompts or with command line switches (dir /a for Windows and ls –a for Linux and macOS).\nOn Linux and Mac, users can mark specific files as hidden simply by putting a “.” as the first character in the file or folder name   . Files and folders that start with a period, ‘.’, are by default hidden from being viewed in the Finder application and standard command-line utilities like “ls”. Users must specifically change settings to have these files viewable.\nFiles on macOS can also be marked with the UF_HIDDEN flag which prevents them from being seen in Finder.app, but still allows them to be seen in Terminal.app . On Windows, users can mark specific files as hidden by using the attrib.exe binary. Many applications create these hidden files and folders to store information so that it doesn’t clutter up the user’s workspace. For example, SSH utilities create a .ssh folder that’s hidden and contains the user’s known hosts and keys.\nAdditionally, adversaries may name files in a manner that would allow the file to be hidden such as naming a file only a “space” character.\nAdversaries can use this to their advantage to hide files and folders anywhere on the system and evading a typical user or system analysis that does not incorporate investigation of hidden files.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Creates a hidden or system file",
                  "match_data": [
                    "pid: 864",
                    "C:\\Windows\\ServiceProfiles\\LocalService\\AppData\\Local\\FontCache\\Fonts\\Download-1.tmp"
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0004",
          "name": "Privilege Escalation",
          "link": "https://attack.mitre.org/tactics/TA0004/",
          "description": "The adversary is trying to gain higher-level permissions.\n\nPrivilege Escalation consists of techniques that adversaries use to gain higher-level permissions on a system or network. Adversaries can often enter and explore a network with unprivileged access but require elevated permissions to follow through on their objectives. Common approaches are to take advantage of system weaknesses, misconfigurations, and vulnerabilities. Examples of elevated access include: \n\n* SYSTEM/root level\n* local administrator\n* user account with admin-like access \n* user accounts with access to specific system or perform specific function\n\nThese techniques often overlap with Persistence techniques, as OS features that let an adversary persist can execute in an elevated context.  ",
          "techniques": [
            {
              "id": "T1548",
              "name": "Abuse Elevation Control Mechanism",
              "link": "https://attack.mitre.org/techniques/T1548/",
              "description": "Adversaries may circumvent mechanisms designed to control elevate privileges to gain higher-level permissions. Most modern systems contain native elevation control mechanisms that are intended to limit privileges that a user can perform on a machine. Authorization has to be granted to specific users in order to perform tasks that can be considered of higher risk. An adversary can perform several methods to take advantage of built-in control mechanisms in order to escalate privileges on a system.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Attempts to modify UAC prompt behavior"
                }
              ]
            },
            {
              "id": "T1548.002",
              "name": "Bypass User Account Control",
              "link": "https://attack.mitre.org/techniques/T1548/002/",
              "description": "Adversaries may bypass UAC mechanisms to elevate process privileges on system. Windows User Account Control (UAC) allows a program to elevate its privileges (tracked as integrity levels ranging from low to high) to perform a task under administrator-level permissions, possibly by prompting the user for confirmation. The impact to the user ranges from denying the operation under high enforcement to allowing the user to perform the action if they are in the local administrators group and click through the prompt or allowing them to enter an administrator password to complete the action.\nIf the UAC protection level of a computer is set to anything but the highest level, certain Windows programs can elevate privileges or execute some elevated Component Object Model objects without prompting the user through the UAC notification box. An example of this is use of Rundll32 to load a specifically crafted DLL which loads an auto-elevated Component Object Model object and performs a file operation in a protected directory which would typically require elevated access. Malicious software may also be injected into a trusted process to gain elevated privileges without prompting a user.\nMany methods have been discovered to bypass UAC. The Github readme page for UACME contains an extensive list of methods that have been discovered and implemented, but may not be a comprehensive list of bypasses. Additional bypass methods are regularly discovered and some used in the wild, such as:\n\neventvwr.exe can auto-elevate and execute a specified binary or script.\n\nAnother bypass is possible through some lateral movement techniques if credentials for an account with administrator privileges are known, since UAC is a single system security mechanism, and the privilege or integrity of a process running on one system will be unknown on remote systems and default to high integrity.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Attempts to modify UAC prompt behavior"
                }
              ]
            },
            {
              "id": "T1055",
              "name": "Process Injection",
              "link": "https://attack.mitre.org/techniques/T1055/",
              "description": "Adversaries may inject code into processes in order to evade process-based defenses as well as possibly elevate privileges. Process injection is a method of executing arbitrary code in the address space of a separate live process. Running code in the context of another process may allow access to the process's memory, system/network resources, and possibly elevated privileges. Execution via process injection may also evade detection from security products since the execution is masked under a legitimate process. \nThere are many different ways to inject code into a process, many of which abuse legitimate functionalities. These implementations exist for every major OS but are typically platform specific. \nMore sophisticated samples may perform multiple process injections to segment modules and further evade detection, utilizing named pipes or other inter-process communication (IPC) mechanisms as a communication channel. ",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Resumed a thread in another process",
                  "match_data": [
                    "Process explore.exe with process ID 5308 resumed a thread in another process with the process ID 4124",
                    "pid: 5308"
                  ]
                }
              ]
            },
            {
              "id": "T1547",
              "name": "Boot or Logon Autostart Execution",
              "link": "https://attack.mitre.org/techniques/T1547/",
              "description": "Adversaries may configure system settings to automatically execute a program during system boot or logon to maintain persistence or gain higher-level privileges on compromised systems. Operating systems may have mechanisms for automatically running a program on system boot or account logon. These mechanisms may include automatically executing programs that are placed in specially designated directories or are referenced by repositories that store configuration information, such as the Windows Registry. An adversary may achieve the same goal by modifying or extending features of the kernel.\nSince some boot or logon autostart programs run with higher privileges, an adversary may leverage these to elevate privileges.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Installs itself for autorun at Windows startup",
                  "match_data": [
                    "pid: 4124",
                    "pid: 624"
                  ]
                }
              ]
            },
            {
              "id": "T1547.001",
              "name": "Registry Run Keys / Startup Folder",
              "link": "https://attack.mitre.org/techniques/T1547/001/",
              "description": "Adversaries may achieve persistence by adding a program to a startup folder or referencing it with a Registry run key. Adding an entry to the \"run keys\" in the Registry or startup folder will cause the program referenced to be executed when a user logs in. These programs will be executed under the context of the user and will have the account's associated permissions level.\nThe following run keys are created by default on Windows systems:\n\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnce\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnce\n\nRun keys may exist under multiple hives. The HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnceEx is also available but is not created by default on Windows Vista and newer. Registry run key entries can reference programs directly or list them as a dependency. For example, it is possible to load a DLL at logon using a \"Depend\" key with RunOnceEx: reg add HKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\RunOnceEx\\0001\\Depend /v 1 /d \"C:\\temp\\evil[.]dll\" \nPlacing a program within a startup folder will also cause that program to execute when a user logs in. There is a startup folder location for individual user accounts as well as a system-wide startup folder that will be checked regardless of which user account logs in. The startup folder path for the current user is C:\\Users\\[Username]\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup. The startup folder path for all users is C:\\ProgramData\\Microsoft\\Windows\\Start Menu\\Programs\\StartUp.\nThe following Registry keys can be used to set startup folder items for persistence:\n\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell Folders\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Shell Folders\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Shell Folders\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell Folders\n\nThe following Registry keys can control automatic startup of services during boot:\n\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServicesOnce\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServicesOnce\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServices\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServices\n\nUsing policy settings to specify startup programs creates corresponding values in either of two Registry keys:\n\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer\\Run\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer\\Run\n\nPrograms listed in the load value of the registry key HKEY_CURRENT_USER\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Windows run automatically for the currently logged-on user.\nBy default, the multistring BootExecute value of the registry key HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\Session Manager is set to autocheck autochk *. This value causes Windows, at startup, to check the file-system integrity of the hard disks if the system has been shut down abnormally. Adversaries can add other programs or processes to this registry value which will automatically launch at boot.\nAdversaries can use these configuration locations to execute malware, such as remote access tools, to maintain persistence through system reboots. Adversaries may also use Masquerading to make the Registry entries look as if they are associated with legitimate programs.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Installs itself for autorun at Windows startup",
                  "match_data": [
                    "pid: 4124",
                    "pid: 624"
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0003",
          "name": "Persistence",
          "link": "https://attack.mitre.org/tactics/TA0003/",
          "description": "The adversary is trying to maintain their foothold.\n\nPersistence consists of techniques that adversaries use to keep access to systems across restarts, changed credentials, and other interruptions that could cut off their access. Techniques used for persistence include any access, action, or configuration changes that let them maintain their foothold on systems, such as replacing or hijacking legitimate code or adding startup code. ",
          "techniques": [
            {
              "id": "T1542",
              "name": "Pre-OS Boot",
              "link": "https://attack.mitre.org/techniques/T1542/",
              "description": "Adversaries may abuse Pre-OS Boot mechanisms as a way to establish persistence on a system. During the booting process of a computer, firmware and various startup services are loaded before the operating system. These programs control flow of execution before the operating system takes control.\nAdversaries may overwrite data in boot drivers or firmware such as BIOS (Basic Input/Output System) and The Unified Extensible Firmware Interface (UEFI) to persist on systems at a layer below the operating system. This can be particularly difficult to detect as malware at this level will not be detected by host software-based defenses.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Attempted to write directly to a physical drive",
                  "match_data": [
                    "\\??\\PhysicalDrive0"
                  ]
                }
              ]
            },
            {
              "id": "T1542.003",
              "name": "Bootkit",
              "link": "https://attack.mitre.org/techniques/T1542/003/",
              "description": "Adversaries may use bootkits to persist on systems. A bootkit is a malware variant that modifies the boot sectors of a hard drive, allowing malicious code to execute before a computer's operating system has loaded. Bootkits reside at a layer below the operating system and may make it difficult to perform full remediation unless an organization suspects one was used and can act accordingly.\nIn BIOS systems, a bootkit may modify the Master Boot Record (MBR) and/or Volume Boot Record (VBR). The MBR is the section of disk that is first loaded after completing hardware initialization by the BIOS. It is the location of the boot loader. An adversary who has raw access to the boot drive may overwrite this area, diverting execution during startup from the normal boot loader to adversary code.\nThe MBR passes control of the boot process to the VBR. Similar to the case of MBR, an adversary who has raw access to the boot drive may overwrite the VBR to divert execution during startup to adversary code.\nIn UEFI (Unified Extensible Firmware Interface) systems, a bootkit may instead create or modify files in the EFI system partition (ESP). The ESP is a partition on data storage used by devices containing UEFI that allows the system to boot the OS and other utilities used by the system. An adversary can use the newly created or patched files in the ESP to run malicious kernel code.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Uses suspicious IO control codes",
                  "match_data": [
                    "pid: 5012"
                  ]
                },
                {
                  "severity": "MEDIUM",
                  "description": "Attempted to write directly to a physical drive",
                  "match_data": [
                    "\\??\\PhysicalDrive0"
                  ]
                }
              ]
            },
            {
              "id": "T1112",
              "name": "Modify Registry",
              "link": "https://attack.mitre.org/techniques/T1112/",
              "description": "Adversaries may interact with the Windows Registry as part of a variety of other techniques to aid in defense evasion, persistence, and execution.\nAccess to specific areas of the Registry depends on account permissions, with some keys requiring administrator-level access. The built-in Windows command-line utility Reg may be used for local or remote Registry modification. Other tools, such as remote access tools, may also contain functionality to interact with the Registry through the Windows API.\nThe Registry may be modified in order to hide configuration information or malicious payloads via Obfuscated Files or Information. The Registry may also be modified to Impair Defenses, such as by enabling macros for all Microsoft Office products, allowing privilege escalation without alerting the user, increasing the maximum number of allowed outbound requests, and/or modifying systems to store plaintext credentials in memory.\nThe Registry of a remote system may be modified to aid in execution of files as part of lateral movement. It requires the remote Registry service to be running on the target system. Often Valid Accounts are required, along with access to the remote system's SMB/Windows Admin Shares for RPC communication.\nFinally, Registry modifications may also include actions to hide keys, such as prepending key names with a null character, which will cause an error and/or be ignored when read via Reg or other utilities using the Win32 API. Adversaries may abuse these pseudo-hidden keys to conceal payloads/commands used to maintain persistence.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Attempts to modify UAC prompt behavior"
                },
                {
                  "severity": "MEDIUM",
                  "description": "Installs itself for autorun at Windows startup",
                  "match_data": [
                    "pid: 4124",
                    "pid: 624"
                  ]
                }
              ]
            },
            {
              "id": "T1547",
              "name": "Boot or Logon Autostart Execution",
              "link": "https://attack.mitre.org/techniques/T1547/",
              "description": "Adversaries may configure system settings to automatically execute a program during system boot or logon to maintain persistence or gain higher-level privileges on compromised systems. Operating systems may have mechanisms for automatically running a program on system boot or account logon. These mechanisms may include automatically executing programs that are placed in specially designated directories or are referenced by repositories that store configuration information, such as the Windows Registry. An adversary may achieve the same goal by modifying or extending features of the kernel.\nSince some boot or logon autostart programs run with higher privileges, an adversary may leverage these to elevate privileges.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Installs itself for autorun at Windows startup",
                  "match_data": [
                    "pid: 4124",
                    "pid: 624"
                  ]
                }
              ]
            },
            {
              "id": "T1547.001",
              "name": "Registry Run Keys / Startup Folder",
              "link": "https://attack.mitre.org/techniques/T1547/001/",
              "description": "Adversaries may achieve persistence by adding a program to a startup folder or referencing it with a Registry run key. Adding an entry to the \"run keys\" in the Registry or startup folder will cause the program referenced to be executed when a user logs in. These programs will be executed under the context of the user and will have the account's associated permissions level.\nThe following run keys are created by default on Windows systems:\n\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnce\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnce\n\nRun keys may exist under multiple hives. The HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnceEx is also available but is not created by default on Windows Vista and newer. Registry run key entries can reference programs directly or list them as a dependency. For example, it is possible to load a DLL at logon using a \"Depend\" key with RunOnceEx: reg add HKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\RunOnceEx\\0001\\Depend /v 1 /d \"C:\\temp\\evil[.]dll\" \nPlacing a program within a startup folder will also cause that program to execute when a user logs in. There is a startup folder location for individual user accounts as well as a system-wide startup folder that will be checked regardless of which user account logs in. The startup folder path for the current user is C:\\Users\\[Username]\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup. The startup folder path for all users is C:\\ProgramData\\Microsoft\\Windows\\Start Menu\\Programs\\StartUp.\nThe following Registry keys can be used to set startup folder items for persistence:\n\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell Folders\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Shell Folders\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Shell Folders\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell Folders\n\nThe following Registry keys can control automatic startup of services during boot:\n\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServicesOnce\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServicesOnce\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServices\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServices\n\nUsing policy settings to specify startup programs creates corresponding values in either of two Registry keys:\n\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer\\Run\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer\\Run\n\nPrograms listed in the load value of the registry key HKEY_CURRENT_USER\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Windows run automatically for the currently logged-on user.\nBy default, the multistring BootExecute value of the registry key HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\Session Manager is set to autocheck autochk *. This value causes Windows, at startup, to check the file-system integrity of the hard disks if the system has been shut down abnormally. Adversaries can add other programs or processes to this registry value which will automatically launch at boot.\nAdversaries can use these configuration locations to execute malware, such as remote access tools, to maintain persistence through system reboots. Adversaries may also use Masquerading to make the Registry entries look as if they are associated with legitimate programs.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Installs itself for autorun at Windows startup",
                  "match_data": [
                    "pid: 4124",
                    "pid: 624"
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0009",
          "name": "Collection",
          "link": "https://attack.mitre.org/tactics/TA0009/",
          "description": "The adversary is trying to gather data of interest to their goal.\n\nCollection consists of techniques adversaries may use to gather information and the sources information is collected from that are relevant to following through on the adversary's objectives. Frequently, the next goal after collecting data is to either steal (exfiltrate) the data or to use the data to gain more information about the target environment. Common target sources include various drive types, browsers, audio, video, and email. Common collection methods include capturing screenshots and keyboard input.",
          "techniques": [
            {
              "id": "T1114",
              "name": "Email Collection",
              "link": "https://attack.mitre.org/techniques/T1114/",
              "description": "Adversaries may target user email to collect sensitive information. Emails may contain sensitive data, including trade secrets or personal information, that can prove valuable to adversaries. Emails may also contain details of ongoing incident response operations, which may allow adversaries to adjust their techniques in order to maintain persistence or evade defenses. Adversaries can collect or forward email from mail servers or clients. ",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Harvests information related to installed mail clients",
                  "match_data": [
                    "HKEY_CURRENT_USER\\SOFTWARE\\Microsoft\\Office\\16.0\\Outlook\\Profiles\\Outlook\\9375CFF0413111d3B88A00104B2A6676\\00000001\\IMAP User",
                    "HKEY_CURRENT_USER\\SOFTWARE\\Microsoft\\Office\\16.0\\Outlook\\Profiles\\Outlook\\9375CFF0413111d3B88A00104B2A6676\\00000002",
                    "HKEY_CURRENT_USER\\SOFTWARE\\Microsoft\\Office\\16.0\\Outlook\\Profiles\\Outlook\\9375CFF0413111d3B88A00104B2A6676\\00000001\\HTTP User",
                    "HKEY_CURRENT_USER\\SOFTWARE\\Microsoft\\Office\\16.0\\Outlook\\Profiles\\Outlook\\de71dff268f8c642af4d271939e94eba",
                    "HKEY_CURRENT_USER\\SOFTWARE\\Microsoft\\Office\\16.0\\Outlook\\Profiles\\Outlook\\3517490d76624c419a828607e2a54604"
                  ]
                }
              ]
            },
            {
              "id": "T1005",
              "name": "Data from Local System",
              "link": "https://attack.mitre.org/techniques/T1005/",
              "description": "Adversaries may search local system sources, such as file systems, configuration files, local databases, virtual machine files, or process memory, to find files of interest and sensitive data prior to Exfiltration.\nAdversaries may do this using a Command and Scripting Interpreter, such as cmd as well as a Network Device CLI, which have functionality to interact with the file system to gather information. Adversaries may also use Automated Collection on the local system.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Harvests information related to installed instant messenger clients",
                  "match_data": [
                    "C:\\Users\\Bruno\\AppData\\Roaming\\Digsby\\digsby.dat",
                    "C:\\Users\\Bruno\\AppData\\Roaming\\MySpace\\IM\\users.txt",
                    "HKEY_CURRENT_USER\\Software\\Paltalk"
                  ]
                },
                {
                  "severity": "MEDIUM",
                  "description": "Steals private information from local Internet browsers",
                  "match_data": [
                    "pid: 4124"
                  ]
                },
                {
                  "severity": "MEDIUM",
                  "description": "Harvests information related to installed mail clients",
                  "match_data": [
                    "HKEY_CURRENT_USER\\SOFTWARE\\Microsoft\\Office\\16.0\\Outlook\\Profiles\\Outlook\\9375CFF0413111d3B88A00104B2A6676\\00000001\\IMAP User",
                    "HKEY_CURRENT_USER\\SOFTWARE\\Microsoft\\Office\\16.0\\Outlook\\Profiles\\Outlook\\9375CFF0413111d3B88A00104B2A6676\\00000002",
                    "HKEY_CURRENT_USER\\SOFTWARE\\Microsoft\\Office\\16.0\\Outlook\\Profiles\\Outlook\\9375CFF0413111d3B88A00104B2A6676\\00000001\\HTTP User",
                    "HKEY_CURRENT_USER\\SOFTWARE\\Microsoft\\Office\\16.0\\Outlook\\Profiles\\Outlook\\de71dff268f8c642af4d271939e94eba",
                    "HKEY_CURRENT_USER\\SOFTWARE\\Microsoft\\Office\\16.0\\Outlook\\Profiles\\Outlook\\3517490d76624c419a828607e2a54604"
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0007",
          "name": "Discovery",
          "link": "https://attack.mitre.org/tactics/TA0007/",
          "description": "The adversary is trying to figure out your environment.\n\nDiscovery consists of techniques an adversary may use to gain knowledge about the system and internal network. These techniques help adversaries observe the environment and orient themselves before deciding how to act. They also allow adversaries to explore what they can control and what’s around their entry point in order to discover how it could benefit their current objective. Native operating system tools are often used toward this post-compromise information-gathering objective. ",
          "techniques": [
            {
              "id": "T1082",
              "name": "System Information Discovery",
              "link": "https://attack.mitre.org/techniques/T1082/",
              "description": "An adversary may attempt to get detailed information about the operating system and hardware, including version, patches, hotfixes, service packs, and architecture. Adversaries may use this information to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions. This behavior is distinct from Local Storage Discovery which is an adversary's discovery of local drive, disks and/or volumes.\nTools such as Systeminfo can be used to gather detailed system information. If running with privileged access, a breakdown of system data can be gathered through the systemsetup configuration tool on macOS. Adversaries may leverage a Network Device CLI on network devices to gather detailed system information (e.g. show version). On ESXi servers, threat actors may gather system information from various esxcli utilities, such as system hostname get and system version get.\nInfrastructure as a Service (IaaS) cloud providers such as AWS, GCP, and Azure allow access to instance and virtual machine information via APIs. Successful authenticated API calls can return data such as the operating system platform and status of a particular instance or the model view of a virtual machine.\nSystem Information Discovery combined with information gathered from other forms of discovery and reconnaissance can drive payload development and concealment. ",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Checks available memory",
                  "match_data": [
                    "pid: 5308"
                  ]
                }
              ]
            },
            {
              "id": "T1057",
              "name": "Process Discovery",
              "link": "https://attack.mitre.org/techniques/T1057/",
              "description": "Adversaries may attempt to get information about running processes on a system. Information obtained could be used to gain an understanding of common software/applications running on systems within the network. Administrator or otherwise elevated access may provide better process details. Adversaries may use the information from Process Discovery during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\nIn Windows environments, adversaries could obtain details on running processes using the Tasklist utility via cmd or Get-Process via PowerShell. Information about processes can also be extracted from the output of Native API calls such as CreateToolhelp32Snapshot. In Mac and Linux, this is accomplished with the ps command. Adversaries may also opt to enumerate processes via /proc. ESXi also supports use of the ps command, as well as esxcli system process list.\nOn network devices, Network Device CLI commands such as show processes can be used to display current running processes.",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Enumerates running processes",
                  "match_data": [
                    "System with pid 4",
                    "pid: 4124",
                    "Registry with pid 100",
                    "smss.exe with pid 340"
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0011",
          "name": "Command and Control",
          "link": "https://attack.mitre.org/tactics/TA0011/",
          "description": "The adversary is trying to communicate with compromised systems to control them.\n\nCommand and Control consists of techniques that adversaries may use to communicate with systems under their control within a victim network. Adversaries commonly attempt to mimic normal, expected traffic to avoid detection. There are many ways an adversary can establish command and control with various levels of stealth depending on the victim’s network structure and defenses.",
          "techniques": [
            {
              "id": "T1071",
              "name": "Application Layer Protocol",
              "link": "https://attack.mitre.org/techniques/T1071/",
              "description": "Adversaries may communicate using OSI application layer protocols to avoid detection/network filtering by blending in with existing traffic. Commands to the remote system, and often the results of those commands, will be embedded within the protocol traffic between the client and server. \nAdversaries may utilize many different protocols, including those used for web browsing, transferring files, electronic mail, DNS, or publishing/subscribing. For connections that occur internally within an enclave (such as those between a proxy or pivot node and other nodes), commonly used protocols are SMB, SSH, or RDP. ",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Anomalous binary characteristics",
                  "match_data": [
                    "Entrypoint of binary is located outside of any mapped sections"
                  ]
                },
                {
                  "severity": "MEDIUM",
                  "description": "Yara detections observed in process dumps, payloads or dropped files",
                  "match_data": [
                    "PID 4376 triggered the Yara rule 'shellcode_get_eip' with data '['{ E8 00 00 00 00 58 }', '{ E8 00 00 00 00 5F }']'",
                    "PID 4376 triggered the Yara rule 'shellcode_stack_strings' with data '['{ C6 45 EC 4E C6 45 ED 74 C6 45 F7 65 C6 45 F8 61 C6 45 F2 74 C6 45 F3 65 C6 45 EE 43 C6 45 F6 72 C6 45 F9 64 C6 45 EF 72 C6 45 FA 45 C6 45 FB 78 C6 45 F0 65 C6 45 F1 61 C6 45 F4 54 C6 45 F5 68 C6 45 FC 00 }', '{ C6 45 ED 74 C6 45 F7 65 C6 45 F8 61 C6 45 F2 74 C6 45 F3 65 C6 45 EE 43 C6 45 F6 72 C6 45 F9 64 C6 45 EF 72 C6 45 FA 45 C6 45 FB 78 C6 45 F0 65 C6 45 F1 61 C6 45 F4 54 C6 45 F5 68 C6 45 FC 00 }', '{ C6 45 F7 65 C6 45 F8 61 C6 45 F2 74 C6 45 F3 65 C6 45 EE 43 C6 45 F6 72 C6 45 F9 64 C6 45 EF 72 C6 45 FA 45 C6 45 FB 78 C6 45 F0 65 C6 45 F1 61 C6 45 F4 54 C6 45 F5 68 C6 45 FC 00 }', '{ C6 45 F8 61 C6 45 F2 74 C6 45 F3 65 C6 45 EE 43 C6 45 F6 72 C6 45 F9 64 C6 45 EF 72 C6 45 FA 45 C6 45 FB 78 C6 45 F0 65 C6 45 F1 61 C6 45 F4 54 C6 45 F5 68 C6 45 FC 00 }', '{ C6 45 F2 74 C6 45 F3 65 C6 45 EE 43 C6 45 F6 72 C6 45 F9 64 C6 45 EF 72 C6 45 FA 45 C6 45 FB 78 C6 45 F0 65 C6 45 F1 61 C6 45 F4 54 C6 45 F5 68 C6 45 FC 00 }', '{ C6 45 F3 65 C6 45 EE 43 C6 45 F6 72 C6 45 F9 64 C6 45 EF 72 C6 45 FA 45 C6 45 FB 78 C6 45 F0 65 C6 45 F1 61 C6 45 F4 54 C6 45 F5 68 C6 45 FC 00 }', '{ C6 45 EE 43 C6 45 F6 72 C6 45 F9 64 C6 45 EF 72 C6 45 FA 45 C6 45 FB 78 C6 45 F0 65 C6 45 F1 61 C6 45 F4 54 C6 45 F5 68 C6 45 FC 00 }', '{ C6 45 F6 72 C6 45 F9 64 C6 45 EF 72 C6 45 FA 45 C6 45 FB 78 C6 45 F0 65 C6 45 F1 61 C6 45 F4 54 C6 45 F5 68 C6 45 FC 00 }', '{ C6 45 F9 64 C6 45 EF 72 C6 45 FA 45 C6 45 FB 78 C6 45 F0 65 C6 45 F1 61 C6 45 F4 54 C6 45 F5 68 C6 45 FC 00 }', '{ C6 45 EF 72 C6 45 FA 45 C6 45 FB 78 C6 45 F0 65 C6 45 F1 61 C6 45 F4 54 C6 45 F5 68 C6 45 FC 00 }', '{ C6 45 FA 45 C6 45 FB 78 C6 45 F0 65 C6 45 F1 61 C6 45 F4 54 C6 45 F5 68 C6 45 FC 00 }', '{ C6 45 FB 78 C6 45 F0 65 C6 45 F1 61 C6 45 F4 54 C6 45 F5 68 C6 45 FC 00 }', '{ C6 45 F0 65 C6 45 F1 61 C6 45 F4 54 C6 45 F5 68 C6 45 FC 00 }']'",
                    "PID 624 triggered the Yara rule 'shellcode_get_eip' with data '['{ E8 00 00 00 00 58 }']'",
                    "PID 4124 triggered the Yara rule 'shellcode_get_eip' with data '['{ E8 00 00 00 00 58 }']'",
                    "PID 5156 triggered the Yara rule 'shellcode_get_eip' with data '['{ E8 00 00 00 00 59 }']'"
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "Performs some HTTP requests",
                  "match_data": [
                    "http://ocsp.digicert.com/MFEwTzBNMEswSTAJBgUrDgMCGgUABBQ50otx%2Fh0Ztl%2Bz8SiPI7wEWVxDlQQUTiJUIBiV5uNu5g%2F6%2BrkS7QYXjzkCEApDqVCbATUviZV57HIIulA%3D",
                    "http://geoplugin.net/json.gp",
                    "http://x1.c.lencr.org/"
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "Looks up the external IP address",
                  "match_data": [
                    "geoplugin.net"
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "Performs HTTP requests potentially not found in PCAP.",
                  "match_data": [
                    "pid: 5308",
                    "http://geoplugin.net/json.gp"
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "HTTP traffic contains suspicious features which may be indicative of malware related traffic",
                  "match_data": [
                    "HTTP traffic contains a GET request with no user-agent header",
                    "http://geoplugin.net/json.gp",
                    "http://x1.c.lencr.org/"
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0040",
          "name": "Impact",
          "link": "https://attack.mitre.org/tactics/TA0040/",
          "description": "The adversary is trying to manipulate, interrupt, or destroy your systems and data.\n \nImpact consists of techniques that adversaries use to disrupt availability or compromise integrity by manipulating business and operational processes. Techniques used for impact can include destroying or tampering with data. In some cases, business processes can look fine, but may have been altered to benefit the adversaries’ goals. These techniques might be used by adversaries to follow through on their end goal or to provide cover for a confidentiality breach.",
          "techniques": [
            {
              "id": "T1496",
              "name": "Resource Hijacking",
              "link": "https://attack.mitre.org/techniques/T1496/",
              "description": "Adversaries may leverage the resources of co-opted systems to complete resource-intensive tasks, which may impact system and/or hosted service availability. \nResource hijacking may take a number of different forms. For example, adversaries may:\n\nLeverage compute resources in order to mine cryptocurrency\nSell network bandwidth to proxy networks\nGenerate SMS traffic for profit\nAbuse cloud-based messaging services to send large quantities of spam messages\n\nIn some cases, adversaries may leverage multiple types of Resource Hijacking at once.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Connects to crypto currency mining pool"
                }
              ]
            },
            {
              "id": "T1485",
              "name": "Data Destruction",
              "link": "https://attack.mitre.org/techniques/T1485/",
              "description": "Adversaries may destroy data and files on specific systems or in large numbers on a network to interrupt availability to systems, services, and network resources. Data destruction is likely to render stored data irrecoverable by forensic techniques through overwriting files or data on local and remote drives. Common operating system file deletion commands such as del and rm often only remove pointers to files without wiping the contents of the files themselves, making the files recoverable by proper forensic methodology. This behavior is distinct from Disk Content Wipe and Disk Structure Wipe because individual files are destroyed rather than sections of a storage disk or the disk's logical structure.\nAdversaries may attempt to overwrite files and directories with randomly generated data to make it irrecoverable. In some cases politically oriented image files have been used to overwrite data.\nTo maximize impact on the target organization in operations where network-wide availability interruption is the goal, malware designed for destroying data may have worm-like features to propagate across a network by leveraging additional techniques like Valid Accounts, OS Credential Dumping, and SMB/Windows Admin Shares..\nIn cloud environments, adversaries may leverage access to delete cloud storage objects, machine images, database instances, and other infrastructure crucial to operations to damage an organization or their customers. Similarly, they may delete virtual machines from on-prem virtualized environments.",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Anomalous file deletion behavior detected (10+)",
                  "match_data": [
                    "C:\\Users\\Bruno\\AppData\\Local\\Chromium\\User Data\\Default\\Web Data-shm",
                    "pid: 4124",
                    "C:\\Users\\Bruno\\AppData\\Local\\Chromium\\User Data\\Default\\Web Data-wal"
                  ]
                }
              ]
            }
          ]
        }
      ]
    },
    "VMRay": {
      "tactics": [
        {
          "id": "TA0009",
          "name": "Collection",
          "link": "https://attack.mitre.org/tactics/TA0009/",
          "description": "The adversary is trying to gather data of interest to their goal.\n\nCollection consists of techniques adversaries may use to gather information and the sources information is collected from that are relevant to following through on the adversary's objectives. Frequently, the next goal after collecting data is to either steal (exfiltrate) the data or to use the data to gain more information about the target environment. Common target sources include various drive types, browsers, audio, video, and email. Common collection methods include capturing screenshots and keyboard input.",
          "techniques": [
            {
              "id": "T1005",
              "name": "Data from Local System",
              "link": "https://attack.mitre.org/techniques/T1005/",
              "description": "Adversaries may search local system sources, such as file systems, configuration files, local databases, virtual machine files, or process memory, to find files of interest and sensitive data prior to Exfiltration.\nAdversaries may do this using a Command and Scripting Interpreter, such as cmd as well as a Network Device CLI, which have functionality to interact with the file system to gather information. Adversaries may also use Automated Collection on the local system.",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Searches for sensitive browser data",
                  "match_data": [
                    "(Process #9) explore.exe searches for sensitive data of web browser \"Mozilla Firefox\" by file.",
                    "(Process #9) explore.exe searches for sensitive data of web browser \"Opera\" by file.",
                    "(Process #17) rmclient.exe searches for sensitive data of web browser \"Internet Explorer / Edge\" by file.",
                    "(Process #19) rmclient.exe searches for sensitive data of web browser \"Internet Explorer / Edge\" by file.",
                    "(Process #19) rmclient.exe searches for sensitive data of web browser \"Mozilla Firefox\" by file.",
                    "(Process #19) rmclient.exe tries to access sensitive data of web browser \"Internet Explorer / Edge\" by registry.",
                    "(Process #17) rmclient.exe tries to access sensitive data of web browser \"Internet Explorer / Edge\" by registry.",
                    "(Process #20) rmclient.exe searches for sensitive data of web browser \"Internet Explorer / Edge\" by file.",
                    "(Process #22) rmclient.exe searches for sensitive data of web browser \"Internet Explorer / Edge\" by file.",
                    "(Process #22) rmclient.exe searches for sensitive data of web browser \"Mozilla Firefox\" by file."
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "Reads sensitive browser data",
                  "match_data": [
                    "(Process #17) rmclient.exe tries to read sensitive data of web browser \"Internet Explorer / Edge\" by file.",
                    "(Process #20) rmclient.exe tries to read sensitive data of web browser \"Internet Explorer / Edge\" by file.",
                    "(Process #20) rmclient.exe tries to read credentials of web browser \"Internet Explorer\" by reading from the system's credential vault.",
                    "(Process #17) rmclient.exe tries to read credentials of web browser \"Internet Explorer\" by reading from the system's credential vault."
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "Searches for sensitive application data",
                  "match_data": [
                    "(Process #19) rmclient.exe tries to access sensitive data of application \"Google Talk\" by registry.",
                    "(Process #19) rmclient.exe tries to access sensitive data of application \"Google Desktop\" by registry.",
                    "(Process #22) rmclient.exe tries to access sensitive data of application \"Google Talk\" by registry.",
                    "(Process #22) rmclient.exe tries to access sensitive data of application \"Google Desktop\" by registry.",
                    "(Process #21) rmclient.exe tries to access sensitive data of application \"Google Talk\" by registry.",
                    "(Process #21) rmclient.exe tries to access sensitive data of application \"Google Desktop\" by registry.",
                    "(Process #21) rmclient.exe searches for sensitive data of application \"jDownloader\" by file.",
                    "(Process #18) rmclient.exe tries to access sensitive data of application \"Google Talk\" by registry.",
                    "(Process #18) rmclient.exe tries to access sensitive data of application \"Google Desktop\" by registry.",
                    "(Process #18) rmclient.exe searches for sensitive data of application \"jDownloader\" by file."
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "Searches for sensitive mail data",
                  "match_data": [
                    "(Process #21) rmclient.exe tries to access sensitive data of mail application \"Microsoft Outlook\" by registry.",
                    "(Process #21) rmclient.exe tries to access sensitive data of mail application \"IncrediMail\" by registry.",
                    "(Process #18) rmclient.exe tries to access sensitive data of mail application \"Microsoft Outlook\" by registry.",
                    "(Process #18) rmclient.exe tries to access sensitive data of mail application \"IncrediMail\" by registry."
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "Reads sensitive mail data",
                  "match_data": [
                    "(Process #21) rmclient.exe tries to read sensitive data of mail application \"Microsoft Outlook\" by registry.",
                    "(Process #21) rmclient.exe tries to read sensitive data of mail application \"Windows Mail\" by file.",
                    "(Process #18) rmclient.exe tries to read sensitive data of mail application \"Microsoft Outlook\" by registry.",
                    "(Process #18) rmclient.exe tries to read sensitive data of mail application \"Windows Mail\" by file."
                  ]
                },
                {
                  "severity": "HIGH",
                  "description": "Tries to read cached credentials of various applications",
                  "match_data": [
                    "Tries to read sensitive data of: Internet Explorer, Internet Explorer / Edge, Microsoft Outlook, Windows Mail."
                  ]
                }
              ]
            },
            {
              "id": "T1056",
              "name": "Input Capture",
              "link": "https://attack.mitre.org/techniques/T1056/",
              "description": "Adversaries may use methods of capturing user input to obtain credentials or collect information. During normal system usage, users often provide credentials to various different locations, such as login pages/portals or system dialog boxes. Input capture mechanisms may be transparent to the user (e.g. Credential API Hooking) or rely on deceiving the user into providing input into what they believe to be a genuine service (e.g. Web Portal Capture).",
              "signatures": [
                {
                  "severity": "HIGH",
                  "description": "Combination of other detections shows multiple input capture behaviors",
                  "match_data": [
                    "(Process #2) explore.exe logs keys and captures keyboard.",
                    "(Process #9) explore.exe logs keys, captures keyboard, queries foreground window and potentially exfiltrates data."
                  ]
                }
              ]
            },
            {
              "id": "T1056.001",
              "name": "Keylogging",
              "link": "https://attack.mitre.org/techniques/T1056/001/",
              "description": "Adversaries may log user keystrokes to intercept credentials as the user types them. Keylogging is likely to be used to acquire credentials for new access opportunities when OS Credential Dumping efforts are not effective, and may require an adversary to intercept keystrokes on a system for a substantial period of time before credentials can be successfully captured. In order to increase the likelihood of capturing credentials quickly, an adversary may also perform actions such as clearing browser cookies to force users to reauthenticate to systems.\nKeylogging is the most prevalent type of input capture, with many different ways of intercepting keystrokes. Some methods include:\n\nHooking API callbacks used for processing keystrokes. Unlike Credential API Hooking, this focuses solely on API functions intended for processing keystroke data.\nReading raw keystroke data from the hardware buffer.\nWindows Registry modifications.\nCustom drivers.\nModify System Image may provide adversaries with hooks into the operating system of network devices to read raw keystrokes for login sessions. \n",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Monitors keyboard input",
                  "match_data": [
                    "(Process #2) explore.exe installs system wide \"WH_KEYBOARD_LL\" hook(s) to monitor keystrokes.",
                    "(Process #9) explore.exe installs system wide \"WH_KEYBOARD_LL\" hook(s) to monitor keystrokes."
                  ]
                }
              ]
            },
            {
              "id": "T1056.002",
              "name": "GUI Input Capture",
              "link": "https://attack.mitre.org/techniques/T1056/002/",
              "description": "Adversaries may mimic common operating system GUI components to prompt users for credentials with a seemingly legitimate prompt. When programs are executed that need additional privileges than are present in the current user context, it is common for the operating system to prompt the user for proper credentials to authorize the elevated privileges for the task (ex: Bypass User Account Control).\nAdversaries may mimic this functionality to prompt users for credentials with a seemingly legitimate prompt for a number of reasons that mimic normal usage, such as a fake installer requiring additional access or a fake malware removal suite. This type of prompt can be used to collect credentials via various languages such as AppleScript and PowerShell. On Linux systems adversaries may launch dialog boxes prompting users for credentials from malicious shell scripts or the command line (i.e. Unix Shell).\nAdversaries may also mimic common software authentication requests, such as those from browsers or email clients. This may also be paired with user activity monitoring (i.e., Browser Information Discovery and/or Application Window Discovery) to spoof prompts when users are naturally accessing sensitive sites/data.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Monitors user input",
                  "match_data": [
                    "(Process #9) explore.exe reads the text contents of the foreground window by API (possible keylogging attempt)."
                  ]
                }
              ]
            },
            {
              "id": "T1056.004",
              "name": "Credential API Hooking",
              "link": "https://attack.mitre.org/techniques/T1056/004/",
              "description": "Adversaries may hook into Windows application programming interface (API) functions and Linux system functions to collect user credentials. Malicious hooking mechanisms may capture API or function calls that include parameters that reveal user authentication credentials. Unlike Keylogging, this technique focuses specifically on API functions that include parameters that reveal user credentials. \nIn Windows, hooking involves redirecting calls to these functions and can be implemented via:\n\nHooks procedures, which intercept and execute designated code in response to events such as messages, keystrokes, and mouse inputs.\nImport address table (IAT) hooking, which use modifications to a process’s IAT, where pointers to imported API functions are stored.\nInline hooking, which overwrites the first bytes in an API function to redirect code flow.\n\nIn Linux and macOS, adversaries may hook into system functions via the LD_PRELOAD (Linux) or DYLD_INSERT_LIBRARIES (macOS) environment variables, which enables loading shared libraries into a program’s address space. For example, an adversary may capture credentials by hooking into the libc read function leveraged by SSH or SCP.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Monitors keyboard input",
                  "match_data": [
                    "(Process #2) explore.exe installs system wide \"WH_KEYBOARD_LL\" hook(s) to monitor keystrokes.",
                    "(Process #9) explore.exe installs system wide \"WH_KEYBOARD_LL\" hook(s) to monitor keystrokes."
                  ]
                }
              ]
            },
            {
              "id": "T1115",
              "name": "Clipboard Data",
              "link": "https://attack.mitre.org/techniques/T1115/",
              "description": "Adversaries may collect data stored in the clipboard from users copying information within or between applications. \nFor example, on Windows adversaries can access clipboard data by using clip.exe or Get-Clipboard. Additionally, adversaries may monitor then replace users’ clipboard with their data (e.g., Transmitted Data Manipulation).\nmacOS and Linux also have commands, such as pbpaste, to grab clipboard contents.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Captures clipboard data",
                  "match_data": [
                    "(Process #2) explore.exe reads data from clipboard.",
                    "(Process #9) explore.exe reads data from clipboard."
                  ]
                }
              ]
            },
            {
              "id": "T1119",
              "name": "Automated Collection",
              "link": "https://attack.mitre.org/techniques/T1119/",
              "description": "Once established within a system or network, an adversary may use automated techniques for collecting internal data. Methods for performing this technique could include use of a Command and Scripting Interpreter to search for and copy information fitting set criteria such as file type, location, or name at specific time intervals. \nIn cloud-based environments, adversaries may also use cloud APIs, data pipelines, command line interfaces, or extract, transform, and load (ETL) services to automatically collect data. \nThis functionality could also be built into remote access tools. \nThis technique may incorporate use of other techniques such as File and Directory Discovery and Lateral Tool Transfer to identify and move files, as well as Cloud Service Dashboard and Cloud Storage Object Discovery to identify resources in cloud environments.",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Searches for sensitive browser data",
                  "match_data": [
                    "(Process #9) explore.exe searches for sensitive data of web browser \"Mozilla Firefox\" by file.",
                    "(Process #9) explore.exe searches for sensitive data of web browser \"Opera\" by file.",
                    "(Process #17) rmclient.exe searches for sensitive data of web browser \"Internet Explorer / Edge\" by file.",
                    "(Process #19) rmclient.exe searches for sensitive data of web browser \"Internet Explorer / Edge\" by file.",
                    "(Process #19) rmclient.exe searches for sensitive data of web browser \"Mozilla Firefox\" by file.",
                    "(Process #19) rmclient.exe tries to access sensitive data of web browser \"Internet Explorer / Edge\" by registry.",
                    "(Process #17) rmclient.exe tries to access sensitive data of web browser \"Internet Explorer / Edge\" by registry.",
                    "(Process #20) rmclient.exe searches for sensitive data of web browser \"Internet Explorer / Edge\" by file.",
                    "(Process #22) rmclient.exe searches for sensitive data of web browser \"Internet Explorer / Edge\" by file.",
                    "(Process #22) rmclient.exe searches for sensitive data of web browser \"Mozilla Firefox\" by file."
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "Reads sensitive browser data",
                  "match_data": [
                    "(Process #17) rmclient.exe tries to read sensitive data of web browser \"Internet Explorer / Edge\" by file.",
                    "(Process #20) rmclient.exe tries to read sensitive data of web browser \"Internet Explorer / Edge\" by file.",
                    "(Process #20) rmclient.exe tries to read credentials of web browser \"Internet Explorer\" by reading from the system's credential vault.",
                    "(Process #17) rmclient.exe tries to read credentials of web browser \"Internet Explorer\" by reading from the system's credential vault."
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "Searches for sensitive application data",
                  "match_data": [
                    "(Process #19) rmclient.exe tries to access sensitive data of application \"Google Talk\" by registry.",
                    "(Process #19) rmclient.exe tries to access sensitive data of application \"Google Desktop\" by registry.",
                    "(Process #22) rmclient.exe tries to access sensitive data of application \"Google Talk\" by registry.",
                    "(Process #22) rmclient.exe tries to access sensitive data of application \"Google Desktop\" by registry.",
                    "(Process #21) rmclient.exe tries to access sensitive data of application \"Google Talk\" by registry.",
                    "(Process #21) rmclient.exe tries to access sensitive data of application \"Google Desktop\" by registry.",
                    "(Process #21) rmclient.exe searches for sensitive data of application \"jDownloader\" by file.",
                    "(Process #18) rmclient.exe tries to access sensitive data of application \"Google Talk\" by registry.",
                    "(Process #18) rmclient.exe tries to access sensitive data of application \"Google Desktop\" by registry.",
                    "(Process #18) rmclient.exe searches for sensitive data of application \"jDownloader\" by file."
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "Searches for sensitive mail data",
                  "match_data": [
                    "(Process #21) rmclient.exe tries to access sensitive data of mail application \"Microsoft Outlook\" by registry.",
                    "(Process #21) rmclient.exe tries to access sensitive data of mail application \"IncrediMail\" by registry.",
                    "(Process #18) rmclient.exe tries to access sensitive data of mail application \"Microsoft Outlook\" by registry.",
                    "(Process #18) rmclient.exe tries to access sensitive data of mail application \"IncrediMail\" by registry."
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "Reads sensitive mail data",
                  "match_data": [
                    "(Process #21) rmclient.exe tries to read sensitive data of mail application \"Microsoft Outlook\" by registry.",
                    "(Process #21) rmclient.exe tries to read sensitive data of mail application \"Windows Mail\" by file.",
                    "(Process #18) rmclient.exe tries to read sensitive data of mail application \"Microsoft Outlook\" by registry.",
                    "(Process #18) rmclient.exe tries to read sensitive data of mail application \"Windows Mail\" by file."
                  ]
                },
                {
                  "severity": "HIGH",
                  "description": "Tries to read cached credentials of various applications",
                  "match_data": [
                    "Tries to read sensitive data of: Internet Explorer, Internet Explorer / Edge, Microsoft Outlook, Windows Mail."
                  ]
                },
                {
                  "severity": "HIGH",
                  "description": "Combination of other detections shows multiple input capture behaviors",
                  "match_data": [
                    "(Process #2) explore.exe logs keys and captures keyboard.",
                    "(Process #9) explore.exe logs keys, captures keyboard, queries foreground window and potentially exfiltrates data."
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0007",
          "name": "Discovery",
          "link": "https://attack.mitre.org/tactics/TA0007/",
          "description": "The adversary is trying to figure out your environment.\n\nDiscovery consists of techniques an adversary may use to gain knowledge about the system and internal network. These techniques help adversaries observe the environment and orient themselves before deciding how to act. They also allow adversaries to explore what they can control and what’s around their entry point in order to discover how it could benefit their current objective. Native operating system tools are often used toward this post-compromise information-gathering objective. ",
          "techniques": [
            {
              "id": "T1010",
              "name": "Application Window Discovery",
              "link": "https://attack.mitre.org/techniques/T1010/",
              "description": "Adversaries may attempt to get a listing of open application windows. Window listings could convey information about how the system is used. For example, information about application windows could be used identify potential data to collect as well as identifying security tooling (Security Software Discovery) to evade.\nAdversaries typically abuse system features for this type of enumeration. For example, they may gather information through native system features such as Command and Scripting Interpreter commands and Native API functions.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Monitors user input",
                  "match_data": [
                    "(Process #9) explore.exe repeatedly requests the foreground window by API (possible keylogging attempt).",
                    "(Process #9) explore.exe reads the text contents of the foreground window by API (possible keylogging attempt)."
                  ]
                }
              ]
            },
            {
              "id": "T1012",
              "name": "Query Registry",
              "link": "https://attack.mitre.org/techniques/T1012/",
              "description": "Adversaries may interact with the Windows Registry to gather information about the system, configuration, and installed software.\nThe Registry contains a significant amount of information about the operating system, configuration, software, and security. Information can easily be queried using the Reg utility, though other means to access the Registry exist. Some of the information may help adversaries to further their operation within a network. Adversaries may use the information from Query Registry during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Query OS Information",
                  "match_data": [
                    "(Process #1) rfq chip 1 new project bom 090725.exe reads product name from registry.",
                    "(Process #2) explore.exe reads product name from registry.",
                    "(Process #9) explore.exe reads product name from registry."
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "Possibly does reconnaissance",
                  "match_data": [
                    "(Process #19) rmclient.exe tries to gather information about application \"MSN Messenger\" by registry.",
                    "(Process #19) rmclient.exe tries to gather information about application \"Microsoft MessengerService\" by registry.",
                    "(Process #18) rmclient.exe tries to gather information about application \"Qualcomm Eudora\" by registry.",
                    "(Process #19) rmclient.exe tries to gather information about application \"Microsoft Identity Control\" by registry.",
                    "(Process #19) rmclient.exe tries to gather information about application \"Yahoo Pager\" by registry.",
                    "(Process #19) rmclient.exe tries to gather information about application \"Paltalk\" by registry.",
                    "(Process #21) rmclient.exe tries to gather information about application \"Qualcomm Eudora\" by registry.",
                    "(Process #22) rmclient.exe tries to gather information about application \"MSN Messenger\" by registry.",
                    "(Process #22) rmclient.exe tries to gather information about application \"Microsoft MessengerService\" by registry.",
                    "(Process #22) rmclient.exe tries to gather information about application \"Microsoft Identity Control\" by registry."
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "Searches for sensitive application data",
                  "match_data": [
                    "(Process #19) rmclient.exe tries to access sensitive data of application \"Google Talk\" by registry.",
                    "(Process #19) rmclient.exe tries to access sensitive data of application \"Google Desktop\" by registry.",
                    "(Process #22) rmclient.exe tries to access sensitive data of application \"Google Talk\" by registry.",
                    "(Process #22) rmclient.exe tries to access sensitive data of application \"Google Desktop\" by registry.",
                    "(Process #21) rmclient.exe tries to access sensitive data of application \"Google Talk\" by registry.",
                    "(Process #21) rmclient.exe tries to access sensitive data of application \"Google Desktop\" by registry.",
                    "(Process #18) rmclient.exe tries to access sensitive data of application \"Google Talk\" by registry.",
                    "(Process #18) rmclient.exe tries to access sensitive data of application \"Google Desktop\" by registry."
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "Searches for sensitive browser data",
                  "match_data": [
                    "(Process #19) rmclient.exe tries to access sensitive data of web browser \"Internet Explorer / Edge\" by registry.",
                    "(Process #17) rmclient.exe tries to access sensitive data of web browser \"Internet Explorer / Edge\" by registry.",
                    "(Process #22) rmclient.exe tries to access sensitive data of web browser \"Internet Explorer / Edge\" by registry.",
                    "(Process #21) rmclient.exe tries to access sensitive data of web browser \"Internet Explorer / Edge\" by registry.",
                    "(Process #20) rmclient.exe tries to access sensitive data of web browser \"Internet Explorer / Edge\" by registry.",
                    "(Process #18) rmclient.exe tries to access sensitive data of web browser \"Internet Explorer / Edge\" by registry."
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "Searches for sensitive mail data",
                  "match_data": [
                    "(Process #21) rmclient.exe tries to access sensitive data of mail application \"Microsoft Outlook\" by registry.",
                    "(Process #21) rmclient.exe tries to access sensitive data of mail application \"IncrediMail\" by registry.",
                    "(Process #18) rmclient.exe tries to access sensitive data of mail application \"Microsoft Outlook\" by registry.",
                    "(Process #18) rmclient.exe tries to access sensitive data of mail application \"IncrediMail\" by registry."
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "Reads sensitive mail data",
                  "match_data": [
                    "(Process #21) rmclient.exe tries to read sensitive data of mail application \"Microsoft Outlook\" by registry.",
                    "(Process #18) rmclient.exe tries to read sensitive data of mail application \"Microsoft Outlook\" by registry."
                  ]
                }
              ]
            },
            {
              "id": "T1057",
              "name": "Process Discovery",
              "link": "https://attack.mitre.org/techniques/T1057/",
              "description": "Adversaries may attempt to get information about running processes on a system. Information obtained could be used to gain an understanding of common software/applications running on systems within the network. Administrator or otherwise elevated access may provide better process details. Adversaries may use the information from Process Discovery during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\nIn Windows environments, adversaries could obtain details on running processes using the Tasklist utility via cmd or Get-Process via PowerShell. Information about processes can also be extracted from the output of Native API calls such as CreateToolhelp32Snapshot. In Mac and Linux, this is accomplished with the ps command. Adversaries may also opt to enumerate processes via /proc. ESXi also supports use of the ps command, as well as esxcli system process list.\nOn network devices, Network Device CLI commands such as show processes can be used to display current running processes.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Enumerates running processes",
                  "match_data": [
                    "(Process #20) rmclient.exe enumerates running processes.",
                    "(Process #17) rmclient.exe enumerates running processes."
                  ]
                }
              ]
            },
            {
              "id": "T1082",
              "name": "System Information Discovery",
              "link": "https://attack.mitre.org/techniques/T1082/",
              "description": "An adversary may attempt to get detailed information about the operating system and hardware, including version, patches, hotfixes, service packs, and architecture. Adversaries may use this information to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions. This behavior is distinct from Local Storage Discovery which is an adversary's discovery of local drive, disks and/or volumes.\nTools such as Systeminfo can be used to gather detailed system information. If running with privileged access, a breakdown of system data can be gathered through the systemsetup configuration tool on macOS. Adversaries may leverage a Network Device CLI on network devices to gather detailed system information (e.g. show version). On ESXi servers, threat actors may gather system information from various esxcli utilities, such as system hostname get and system version get.\nInfrastructure as a Service (IaaS) cloud providers such as AWS, GCP, and Azure allow access to instance and virtual machine information via APIs. Successful authenticated API calls can return data such as the operating system platform and status of a particular instance or the model view of a virtual machine.\nSystem Information Discovery combined with information gathered from other forms of discovery and reconnaissance can drive payload development and concealment. ",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Query OS Information",
                  "match_data": [
                    "(Process #1) rfq chip 1 new project bom 090725.exe reads product name from registry.",
                    "(Process #2) explore.exe reads product name from registry.",
                    "(Process #9) explore.exe reads product name from registry."
                  ]
                }
              ]
            },
            {
              "id": "T1083",
              "name": "File and Directory Discovery",
              "link": "https://attack.mitre.org/techniques/T1083/",
              "description": "Adversaries may enumerate files and directories or may search in specific locations of a host or network share for certain information within a file system. Adversaries may use the information from File and Directory Discovery during automated discovery to shape follow-on behaviors, including whether or not the adversary fully infects the target and/or attempts specific actions.\nMany command shell utilities can be used to obtain this information. Examples include dir, tree, ls, find, and locate. Custom tools may also be used to gather file and directory information and interact with the Native API. Adversaries may also leverage a Network Device CLI on network devices to gather file and directory information (e.g. dir, show flash, and/or nvram).\nSome files and directories may require elevated or specific user permissions to access.",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Searches for sensitive browser data",
                  "match_data": [
                    "(Process #9) explore.exe searches for sensitive data of web browser \"Mozilla Firefox\" by file.",
                    "(Process #9) explore.exe searches for sensitive data of web browser \"Opera\" by file.",
                    "(Process #17) rmclient.exe searches for sensitive data of web browser \"Internet Explorer / Edge\" by file.",
                    "(Process #19) rmclient.exe searches for sensitive data of web browser \"Internet Explorer / Edge\" by file.",
                    "(Process #19) rmclient.exe searches for sensitive data of web browser \"Mozilla Firefox\" by file.",
                    "(Process #20) rmclient.exe searches for sensitive data of web browser \"Internet Explorer / Edge\" by file.",
                    "(Process #22) rmclient.exe searches for sensitive data of web browser \"Internet Explorer / Edge\" by file.",
                    "(Process #22) rmclient.exe searches for sensitive data of web browser \"Mozilla Firefox\" by file.",
                    "(Process #20) rmclient.exe searches for sensitive data of web browser \"Mozilla Firefox\" by file.",
                    "(Process #20) rmclient.exe searches for sensitive data of web browser \"Yandex Browser\" by file."
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "Possibly does reconnaissance",
                  "match_data": [
                    "(Process #19) rmclient.exe tries to gather information about application \"Pidgin\" by file.",
                    "(Process #18) rmclient.exe tries to gather information about application \"Mozilla Thunderbird\" by file.",
                    "(Process #19) rmclient.exe tries to gather information about application \"Mozilla Firefox\" by file.",
                    "(Process #21) rmclient.exe tries to gather information about application \"Mozilla Thunderbird\" by file.",
                    "(Process #22) rmclient.exe tries to gather information about application \"Pidgin\" by file.",
                    "(Process #22) rmclient.exe tries to gather information about application \"Mozilla Firefox\" by file.",
                    "(Process #20) rmclient.exe tries to gather information about application \"Mozilla Firefox\" by file.",
                    "(Process #20) rmclient.exe tries to gather information about application \"SeaMonkey\" by file.",
                    "(Process #17) rmclient.exe tries to gather information about application \"Mozilla Firefox\" by file.",
                    "(Process #17) rmclient.exe tries to gather information about application \"SeaMonkey\" by file."
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "Reads sensitive browser data",
                  "match_data": [
                    "(Process #17) rmclient.exe tries to read sensitive data of web browser \"Internet Explorer / Edge\" by file.",
                    "(Process #20) rmclient.exe tries to read sensitive data of web browser \"Internet Explorer / Edge\" by file."
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "Reads sensitive mail data",
                  "match_data": [
                    "(Process #21) rmclient.exe tries to read sensitive data of mail application \"Windows Mail\" by file.",
                    "(Process #18) rmclient.exe tries to read sensitive data of mail application \"Windows Mail\" by file."
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "Searches for sensitive application data",
                  "match_data": [
                    "(Process #21) rmclient.exe searches for sensitive data of application \"jDownloader\" by file.",
                    "(Process #18) rmclient.exe searches for sensitive data of application \"jDownloader\" by file."
                  ]
                }
              ]
            },
            {
              "id": "T1217",
              "name": "Browser Information Discovery",
              "link": "https://attack.mitre.org/techniques/T1217/",
              "description": "Adversaries may enumerate information about browsers to learn more about compromised environments. Data saved by browsers (such as bookmarks, accounts, and browsing history) may reveal a variety of personal information about users (e.g., banking sites, relationships/interests, social media, etc.) as well as details about internal network resources such as servers, tools/dashboards, or other related infrastructure.\nBrowser information may also highlight additional targets after an adversary has access to valid credentials, especially Credentials In Files associated with logins cached by a browser.\nSpecific storage locations vary based on platform and/or application, but browser information is typically stored in local files and databases (e.g., %APPDATA%/Google/Chrome).",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Searches for sensitive browser data",
                  "match_data": [
                    "(Process #19) rmclient.exe tries to access sensitive data of web browser \"Internet Explorer / Edge\" by registry.",
                    "(Process #17) rmclient.exe tries to access sensitive data of web browser \"Internet Explorer / Edge\" by registry.",
                    "(Process #22) rmclient.exe tries to access sensitive data of web browser \"Internet Explorer / Edge\" by registry.",
                    "(Process #21) rmclient.exe tries to access sensitive data of web browser \"Internet Explorer / Edge\" by registry.",
                    "(Process #20) rmclient.exe tries to access sensitive data of web browser \"Internet Explorer / Edge\" by registry.",
                    "(Process #18) rmclient.exe tries to access sensitive data of web browser \"Internet Explorer / Edge\" by registry."
                  ]
                }
              ]
            },
            {
              "id": "T1497",
              "name": "Virtualization/Sandbox Evasion",
              "link": "https://attack.mitre.org/techniques/T1497/",
              "description": "Adversaries may employ various means to detect and avoid virtualization and analysis environments. This may include changing behaviors based on the results of checks for the presence of artifacts indicative of a virtual machine environment (VME) or sandbox. If the adversary detects a VME, they may alter their malware to disengage from the victim or conceal the core functions of the implant. They may also search for VME artifacts before dropping secondary or additional payloads. Adversaries may use the information learned from Virtualization/Sandbox Evasion during automated discovery to shape follow-on behaviors.\nAdversaries may use several methods to accomplish Virtualization/Sandbox Evasion such as checking for security monitoring tools (e.g., Sysinternals, Wireshark, etc.) or other system artifacts associated with analysis or virtualization. Adversaries may also check for legitimate user activity to help determine if it is in an analysis environment. Additional methods include use of sleep timers or loops within malware code to avoid operating within a temporary sandbox."
            },
            {
              "id": "T1497.003",
              "name": "Time Based Checks",
              "link": "https://attack.mitre.org/techniques/T1497/003/",
              "description": "Adversaries may employ various time-based methods to detect virtualization and analysis environments, particularly those that attempt to manipulate time mechanisms to simulate longer elapses of time. This may include enumerating time-based properties, such as uptime or the system clock. \nAdversaries may use calls like GetTickCount and GetSystemTimeAsFileTime to discover if they are operating within a virtual machine or sandbox, or may be able to identify a sandbox accelerating time by sampling and calculating the expected value for an environment's timestamp before and after execution of a sleep function.",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Delays execution",
                  "match_data": [
                    "(Process #9) explore.exe has a thread which sleeps more than 5 minutes."
                  ]
                }
              ]
            },
            {
              "id": "T1622",
              "name": "Debugger Evasion",
              "link": "https://attack.mitre.org/techniques/T1622/",
              "description": "Adversaries may employ various means to detect and avoid debuggers. Debuggers are typically used by defenders to trace and/or analyze the execution of potential malware payloads.\nDebugger evasion may include changing behaviors based on the results of the checks for the presence of artifacts indicative of a debugged environment. Similar to Virtualization/Sandbox Evasion, if the adversary detects a debugger, they may alter their malware to disengage from the victim or conceal the core functions of the implant. They may also search for debugger artifacts before dropping secondary or additional payloads.\nSpecific checks will vary based on the target and/or adversary. On Windows, this may involve Native API function calls such as IsDebuggerPresent() and  NtQueryInformationProcess(), or manually checking the BeingDebugged flag of the Process Environment Block (PEB). On Linux, this may involve querying /proc/self/status for the TracerPID field, which indicates whether or not the process is being traced by dynamic analysis tools. Other checks for debugging artifacts may also seek to enumerate hardware breakpoints, interrupt assembly opcodes, time checks, or measurements if exceptions are raised in the current process (assuming a present debugger would “swallow” or handle the potential error).\nMalware may also leverage Structured Exception Handling (SEH) to detect debuggers by throwing an exception and detecting whether the process is suspended. SEH handles both hardware and software expectations, providing control over the exceptions including support for debugging. If a debugger is present, the program’s control will be transferred to the debugger, and the execution of the code will be suspended. If the debugger is not present, control will be transferred to the SEH handler, which will automatically handle the exception and allow the program’s execution to continue.\nAdversaries may use the information learned from these debugger checks during automated discovery to shape follow-on behaviors. Debuggers can also be evaded by detaching the process or flooding debug logs with meaningless data via messages produced by looping Native API function calls such as OutputDebugStringW().",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Tries to detect debugger",
                  "match_data": [
                    "(Process #19) rmclient.exe tries to detect a debugger via API \"IsDebuggerPresent\"."
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0005",
          "name": "Defense Evasion",
          "link": "https://attack.mitre.org/tactics/TA0005/",
          "description": "The adversary is trying to avoid being detected.\n\nDefense Evasion consists of techniques that adversaries use to avoid detection throughout their compromise. Techniques used for defense evasion include uninstalling/disabling security software or obfuscating/encrypting data and scripts. Adversaries also leverage and abuse trusted processes to hide and masquerade their malware. Other tactics’ techniques are cross-listed here when those techniques include the added benefit of subverting defenses. ",
          "techniques": [
            {
              "id": "T1027",
              "name": "Obfuscated Files or Information",
              "link": "https://attack.mitre.org/techniques/T1027/",
              "description": "Adversaries may attempt to make an executable or file difficult to discover or analyze by encrypting, encoding, or otherwise obfuscating its contents on the system or in transit. This is common behavior that can be used across different platforms and the network to evade defenses. \nPayloads may be compressed, archived, or encrypted in order to avoid detection. These payloads may be used during Initial Access or later to mitigate detection. Sometimes a user's action may be required to open and Deobfuscate/Decode Files or Information for User Execution. The user may also be required to input a password to open a password protected compressed/encrypted file that was provided by the adversary.  Adversaries may also use compressed or archived scripts, such as JavaScript. \nPortions of files can also be encoded to hide the plain-text strings that would otherwise help defenders with discovery.  Payloads may also be split into separate, seemingly benign files that only reveal malicious functionality when reassembled. \nAdversaries may also abuse Command Obfuscation to obscure commands executed from payloads or directly via Command and Scripting Interpreter. Environment variables, aliases, characters, and other platform/language specific semantics can be used to evade signature based detections and application control mechanisms.   "
            },
            {
              "id": "T1027.002",
              "name": "Software Packing",
              "link": "https://attack.mitre.org/techniques/T1027/002/",
              "description": "Adversaries may perform software packing or virtual machine software protection to conceal their code. Software packing is a method of compressing or encrypting an executable. Packing an executable changes the file signature in an attempt to avoid signature-based detection. Most decompression techniques decompress the executable code in memory. Virtual machine software protection translates an executable's original code into a special format that only a special virtual machine can run. A virtual machine is then called to run this code. \nUtilities used to perform software packing are called packers. Example packers are MPRESS and UPX. A more comprehensive list of known packers is available, but adversaries may create their own packing techniques that do not leave the same artifacts as well-known packers to evade defenses.  ",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Creates a page with write and execute permissions",
                  "match_data": [
                    "(Process #9) explore.exe changes the protection of a page from writable (\"PAGE_READWRITE\") to executable (\"PAGE_EXECUTE_READ\").",
                    "(Process #9) explore.exe changes the protection of a page from writable (\"PAGE_READWRITE\") to executable (\"PAGE_EXECUTE_READWRITE\")."
                  ]
                },
                {
                  "severity": "INFO",
                  "description": "Resolves API functions dynamically",
                  "match_data": [
                    "(Process #1) rfq chip 1 new project bom 090725.exe resolves 64 API functions by name.",
                    "(Process #2) explore.exe resolves 67 API functions by name.",
                    "(Process #9) explore.exe resolves 257 API functions by name.",
                    "(Process #8) explore.exe resolves 64 API functions by name.",
                    "(Process #19) rmclient.exe resolves 240 API functions by name.",
                    "(Process #18) rmclient.exe resolves 258 API functions by name.",
                    "(Process #17) rmclient.exe resolves 32 API functions by name.",
                    "(Process #20) rmclient.exe resolves 32 API functions by name.",
                    "(Process #22) rmclient.exe resolves 240 API functions by name.",
                    "(Process #21) rmclient.exe resolves 258 API functions by name."
                  ]
                }
              ]
            },
            {
              "id": "T1055",
              "name": "Process Injection",
              "link": "https://attack.mitre.org/techniques/T1055/",
              "description": "Adversaries may inject code into processes in order to evade process-based defenses as well as possibly elevate privileges. Process injection is a method of executing arbitrary code in the address space of a separate live process. Running code in the context of another process may allow access to the process's memory, system/network resources, and possibly elevated privileges. Execution via process injection may also evade detection from security products since the execution is masked under a legitimate process. \nThere are many different ways to inject code into a process, many of which abuse legitimate functionalities. These implementations exist for every major OS but are typically platform specific. \nMore sophisticated samples may perform multiple process injections to segment modules and further evade detection, utilizing named pipes or other inter-process communication (IPC) mechanisms as a communication channel. ",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Injects a file into another process",
                  "match_data": [
                    "(Process #2) explore.exe injects file into (process #3) explorer.exe.",
                    "(Process #9) explore.exe injects file into (process #10) dwm.exe."
                  ]
                },
                {
                  "severity": "HIGH",
                  "description": "Writes into the memory of another process",
                  "match_data": [
                    "(Process #9) explore.exe modifies memory of (process #17) rmclient.exe.",
                    "(Process #9) explore.exe modifies memory of (process #18) rmclient.exe.",
                    "(Process #9) explore.exe modifies memory of (process #19) rmclient.exe.",
                    "(Process #9) explore.exe modifies memory of (process #20) rmclient.exe.",
                    "(Process #9) explore.exe modifies memory of (process #21) rmclient.exe.",
                    "(Process #9) explore.exe modifies memory of (process #22) rmclient.exe."
                  ]
                }
              ]
            },
            {
              "id": "T1112",
              "name": "Modify Registry",
              "link": "https://attack.mitre.org/techniques/T1112/",
              "description": "Adversaries may interact with the Windows Registry as part of a variety of other techniques to aid in defense evasion, persistence, and execution.\nAccess to specific areas of the Registry depends on account permissions, with some keys requiring administrator-level access. The built-in Windows command-line utility Reg may be used for local or remote Registry modification. Other tools, such as remote access tools, may also contain functionality to interact with the Registry through the Windows API.\nThe Registry may be modified in order to hide configuration information or malicious payloads via Obfuscated Files or Information. The Registry may also be modified to Impair Defenses, such as by enabling macros for all Microsoft Office products, allowing privilege escalation without alerting the user, increasing the maximum number of allowed outbound requests, and/or modifying systems to store plaintext credentials in memory.\nThe Registry of a remote system may be modified to aid in execution of files as part of lateral movement. It requires the remote Registry service to be running on the target system. Often Valid Accounts are required, along with access to the remote system's SMB/Windows Admin Shares for RPC communication.\nFinally, Registry modifications may also include actions to hide keys, such as prepending key names with a null character, which will cause an error and/or be ignored when read via Reg or other utilities using the Win32 API. Adversaries may abuse these pseudo-hidden keys to conceal payloads/commands used to maintain persistence.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Installs system startup script or application",
                  "match_data": [
                    "(Process #1) rfq chip 1 new project bom 090725.exe adds \"\"C:\\ProgramData\\local\\explore.exe\"\" to Windows startup via registry.",
                    "(Process #2) explore.exe adds \"\"C:\\ProgramData\\local\\explore.exe\"\" to Windows startup via registry.",
                    "(Process #9) explore.exe adds \"\"C:\\ProgramData\\local\\explore.exe\"\" to Windows startup via registry."
                  ]
                }
              ]
            },
            {
              "id": "T1134",
              "name": "Access Token Manipulation",
              "link": "https://attack.mitre.org/techniques/T1134/",
              "description": "Adversaries may modify access tokens to operate under a different user or system security context to perform actions and bypass access controls. Windows uses access tokens to determine the ownership of a running process. A user can manipulate access tokens to make a running process appear as though it is the child of a different process or belongs to someone other than the user that started the process. When this occurs, the process also takes on the security context associated with the new token.\nAn adversary can use built-in Windows API functions to copy access tokens from existing processes; this is known as token stealing. These token can then be applied to an existing process (i.e. Token Impersonation/Theft) or used to spawn a new process (i.e. Create Process with Token). An adversary must already be in a privileged user context (i.e. administrator) to steal a token. However, adversaries commonly use token stealing to elevate their security context from the administrator level to the SYSTEM level. An adversary can then use a token to authenticate to a remote system as the account for that token if the account has appropriate permissions on the remote system.\nAny standard user can use the runas command, and the Windows API functions, to create impersonation tokens; it does not require access to an administrator account. There are also other mechanisms, such as Active Directory fields, that can be used to modify access tokens.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Enables process privileges",
                  "match_data": [
                    "(Process #19) rmclient.exe enables process privilege \"SeDebugPrivilege\".",
                    "(Process #22) rmclient.exe enables process privilege \"SeDebugPrivilege\"."
                  ]
                }
              ]
            },
            {
              "id": "T1497",
              "name": "Virtualization/Sandbox Evasion",
              "link": "https://attack.mitre.org/techniques/T1497/",
              "description": "Adversaries may employ various means to detect and avoid virtualization and analysis environments. This may include changing behaviors based on the results of checks for the presence of artifacts indicative of a virtual machine environment (VME) or sandbox. If the adversary detects a VME, they may alter their malware to disengage from the victim or conceal the core functions of the implant. They may also search for VME artifacts before dropping secondary or additional payloads. Adversaries may use the information learned from Virtualization/Sandbox Evasion during automated discovery to shape follow-on behaviors.\nAdversaries may use several methods to accomplish Virtualization/Sandbox Evasion such as checking for security monitoring tools (e.g., Sysinternals, Wireshark, etc.) or other system artifacts associated with analysis or virtualization. Adversaries may also check for legitimate user activity to help determine if it is in an analysis environment. Additional methods include use of sleep timers or loops within malware code to avoid operating within a temporary sandbox."
            },
            {
              "id": "T1497.003",
              "name": "Time Based Checks",
              "link": "https://attack.mitre.org/techniques/T1497/003/",
              "description": "Adversaries may employ various time-based methods to detect virtualization and analysis environments, particularly those that attempt to manipulate time mechanisms to simulate longer elapses of time. This may include enumerating time-based properties, such as uptime or the system clock. \nAdversaries may use calls like GetTickCount and GetSystemTimeAsFileTime to discover if they are operating within a virtual machine or sandbox, or may be able to identify a sandbox accelerating time by sampling and calculating the expected value for an environment's timestamp before and after execution of a sleep function.",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Delays execution",
                  "match_data": [
                    "(Process #9) explore.exe has a thread which sleeps more than 5 minutes."
                  ]
                }
              ]
            },
            {
              "id": "T1564",
              "name": "Hide Artifacts",
              "link": "https://attack.mitre.org/techniques/T1564/",
              "description": "Adversaries may attempt to hide artifacts associated with their behaviors to evade detection. Operating systems may have features to hide various artifacts, such as important system files and administrative task execution, to avoid disrupting user work environments and prevent users from changing files or features on the system. Adversaries may abuse these features to hide artifacts such as files, directories, user accounts, or other system activity to evade detection.\nAdversaries may also attempt to hide artifacts associated with malicious behavior by creating computing regions that are isolated from common security instrumentation, such as through the use of virtualization technology."
            },
            {
              "id": "T1564.003",
              "name": "Hidden Window",
              "link": "https://attack.mitre.org/techniques/T1564/003/",
              "description": "Adversaries may use hidden windows to conceal malicious activity from the plain sight of users. In some cases, windows that would typically be displayed when an application carries out an operation can be hidden. This may be utilized by system administrators to avoid disrupting user work environments when carrying out administrative tasks. \nAdversaries may abuse these functionalities to hide otherwise visible windows from users so as not to alert the user to adversary activity on the system.\nOn macOS, the configurations for how applications run are listed in property list (plist) files. One of the tags in these files can be apple.awt.UIElement, which allows for Java applications to prevent the application's icon from appearing in the Dock. A common use for this is when applications run in the system tray, but don't also want to show up in the Dock.\nSimilarly, on Windows there are a variety of features in scripting languages, such as PowerShell, Jscript, and Visual Basic to make windows hidden. One example of this is powershell.exe -WindowStyle Hidden.\nThe Windows Registry can also be edited to hide application windows from the current user. For example, by setting the WindowPosition subkey in the HKEY_CURRENT_USER\\Console\\%SystemRoot%_System32_WindowsPowerShell_v1.0_PowerShell.exe Registry key to a maximum value, PowerShell windows will open off screen and be hidden.\nIn addition, Windows supports the CreateDesktop() API that can create a hidden desktop window with its own corresponding explorer.exe process.  All applications running on the hidden desktop window, such as a hidden VNC (hVNC) session, will be invisible to other desktops windows.\nAdversaries may also leverage cmd.exe as a parent process, and then utilize a LOLBin, such as DeviceCredentialDeployment.exe, to hide windows.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Creates process with hidden window",
                  "match_data": [
                    "(Process #9) explore.exe starts (process #17) rmclient.exe with a hidden window.",
                    "(Process #9) explore.exe starts (process #18) rmclient.exe with a hidden window.",
                    "(Process #9) explore.exe starts (process #19) rmclient.exe with a hidden window.",
                    "(Process #9) explore.exe starts (process #20) rmclient.exe with a hidden window.",
                    "(Process #9) explore.exe starts (process #21) rmclient.exe with a hidden window.",
                    "(Process #9) explore.exe starts (process #22) rmclient.exe with a hidden window."
                  ]
                }
              ]
            },
            {
              "id": "T1622",
              "name": "Debugger Evasion",
              "link": "https://attack.mitre.org/techniques/T1622/",
              "description": "Adversaries may employ various means to detect and avoid debuggers. Debuggers are typically used by defenders to trace and/or analyze the execution of potential malware payloads.\nDebugger evasion may include changing behaviors based on the results of the checks for the presence of artifacts indicative of a debugged environment. Similar to Virtualization/Sandbox Evasion, if the adversary detects a debugger, they may alter their malware to disengage from the victim or conceal the core functions of the implant. They may also search for debugger artifacts before dropping secondary or additional payloads.\nSpecific checks will vary based on the target and/or adversary. On Windows, this may involve Native API function calls such as IsDebuggerPresent() and  NtQueryInformationProcess(), or manually checking the BeingDebugged flag of the Process Environment Block (PEB). On Linux, this may involve querying /proc/self/status for the TracerPID field, which indicates whether or not the process is being traced by dynamic analysis tools. Other checks for debugging artifacts may also seek to enumerate hardware breakpoints, interrupt assembly opcodes, time checks, or measurements if exceptions are raised in the current process (assuming a present debugger would “swallow” or handle the potential error).\nMalware may also leverage Structured Exception Handling (SEH) to detect debuggers by throwing an exception and detecting whether the process is suspended. SEH handles both hardware and software expectations, providing control over the exceptions including support for debugging. If a debugger is present, the program’s control will be transferred to the debugger, and the execution of the code will be suspended. If the debugger is not present, control will be transferred to the SEH handler, which will automatically handle the exception and allow the program’s execution to continue.\nAdversaries may use the information learned from these debugger checks during automated discovery to shape follow-on behaviors. Debuggers can also be evaded by detaching the process or flooding debug logs with meaningless data via messages produced by looping Native API function calls such as OutputDebugStringW().",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Tries to detect debugger",
                  "match_data": [
                    "(Process #19) rmclient.exe tries to detect a debugger via API \"IsDebuggerPresent\"."
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0004",
          "name": "Privilege Escalation",
          "link": "https://attack.mitre.org/tactics/TA0004/",
          "description": "The adversary is trying to gain higher-level permissions.\n\nPrivilege Escalation consists of techniques that adversaries use to gain higher-level permissions on a system or network. Adversaries can often enter and explore a network with unprivileged access but require elevated permissions to follow through on their objectives. Common approaches are to take advantage of system weaknesses, misconfigurations, and vulnerabilities. Examples of elevated access include: \n\n* SYSTEM/root level\n* local administrator\n* user account with admin-like access \n* user accounts with access to specific system or perform specific function\n\nThese techniques often overlap with Persistence techniques, as OS features that let an adversary persist can execute in an elevated context.  ",
          "techniques": [
            {
              "id": "T1055",
              "name": "Process Injection",
              "link": "https://attack.mitre.org/techniques/T1055/",
              "description": "Adversaries may inject code into processes in order to evade process-based defenses as well as possibly elevate privileges. Process injection is a method of executing arbitrary code in the address space of a separate live process. Running code in the context of another process may allow access to the process's memory, system/network resources, and possibly elevated privileges. Execution via process injection may also evade detection from security products since the execution is masked under a legitimate process. \nThere are many different ways to inject code into a process, many of which abuse legitimate functionalities. These implementations exist for every major OS but are typically platform specific. \nMore sophisticated samples may perform multiple process injections to segment modules and further evade detection, utilizing named pipes or other inter-process communication (IPC) mechanisms as a communication channel. ",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Injects a file into another process",
                  "match_data": [
                    "(Process #2) explore.exe injects file into (process #3) explorer.exe.",
                    "(Process #9) explore.exe injects file into (process #10) dwm.exe."
                  ]
                },
                {
                  "severity": "HIGH",
                  "description": "Writes into the memory of another process",
                  "match_data": [
                    "(Process #9) explore.exe modifies memory of (process #17) rmclient.exe.",
                    "(Process #9) explore.exe modifies memory of (process #18) rmclient.exe.",
                    "(Process #9) explore.exe modifies memory of (process #19) rmclient.exe.",
                    "(Process #9) explore.exe modifies memory of (process #20) rmclient.exe.",
                    "(Process #9) explore.exe modifies memory of (process #21) rmclient.exe.",
                    "(Process #9) explore.exe modifies memory of (process #22) rmclient.exe."
                  ]
                }
              ]
            },
            {
              "id": "T1134",
              "name": "Access Token Manipulation",
              "link": "https://attack.mitre.org/techniques/T1134/",
              "description": "Adversaries may modify access tokens to operate under a different user or system security context to perform actions and bypass access controls. Windows uses access tokens to determine the ownership of a running process. A user can manipulate access tokens to make a running process appear as though it is the child of a different process or belongs to someone other than the user that started the process. When this occurs, the process also takes on the security context associated with the new token.\nAn adversary can use built-in Windows API functions to copy access tokens from existing processes; this is known as token stealing. These token can then be applied to an existing process (i.e. Token Impersonation/Theft) or used to spawn a new process (i.e. Create Process with Token). An adversary must already be in a privileged user context (i.e. administrator) to steal a token. However, adversaries commonly use token stealing to elevate their security context from the administrator level to the SYSTEM level. An adversary can then use a token to authenticate to a remote system as the account for that token if the account has appropriate permissions on the remote system.\nAny standard user can use the runas command, and the Windows API functions, to create impersonation tokens; it does not require access to an administrator account. There are also other mechanisms, such as Active Directory fields, that can be used to modify access tokens.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Enables process privileges",
                  "match_data": [
                    "(Process #19) rmclient.exe enables process privilege \"SeDebugPrivilege\".",
                    "(Process #22) rmclient.exe enables process privilege \"SeDebugPrivilege\"."
                  ]
                }
              ]
            },
            {
              "id": "T1547",
              "name": "Boot or Logon Autostart Execution",
              "link": "https://attack.mitre.org/techniques/T1547/",
              "description": "Adversaries may configure system settings to automatically execute a program during system boot or logon to maintain persistence or gain higher-level privileges on compromised systems. Operating systems may have mechanisms for automatically running a program on system boot or account logon. These mechanisms may include automatically executing programs that are placed in specially designated directories or are referenced by repositories that store configuration information, such as the Windows Registry. An adversary may achieve the same goal by modifying or extending features of the kernel.\nSince some boot or logon autostart programs run with higher privileges, an adversary may leverage these to elevate privileges."
            },
            {
              "id": "T1547.001",
              "name": "Registry Run Keys / Startup Folder",
              "link": "https://attack.mitre.org/techniques/T1547/001/",
              "description": "Adversaries may achieve persistence by adding a program to a startup folder or referencing it with a Registry run key. Adding an entry to the \"run keys\" in the Registry or startup folder will cause the program referenced to be executed when a user logs in. These programs will be executed under the context of the user and will have the account's associated permissions level.\nThe following run keys are created by default on Windows systems:\n\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnce\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnce\n\nRun keys may exist under multiple hives. The HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnceEx is also available but is not created by default on Windows Vista and newer. Registry run key entries can reference programs directly or list them as a dependency. For example, it is possible to load a DLL at logon using a \"Depend\" key with RunOnceEx: reg add HKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\RunOnceEx\\0001\\Depend /v 1 /d \"C:\\temp\\evil[.]dll\" \nPlacing a program within a startup folder will also cause that program to execute when a user logs in. There is a startup folder location for individual user accounts as well as a system-wide startup folder that will be checked regardless of which user account logs in. The startup folder path for the current user is C:\\Users\\[Username]\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup. The startup folder path for all users is C:\\ProgramData\\Microsoft\\Windows\\Start Menu\\Programs\\StartUp.\nThe following Registry keys can be used to set startup folder items for persistence:\n\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell Folders\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Shell Folders\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Shell Folders\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell Folders\n\nThe following Registry keys can control automatic startup of services during boot:\n\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServicesOnce\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServicesOnce\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServices\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServices\n\nUsing policy settings to specify startup programs creates corresponding values in either of two Registry keys:\n\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer\\Run\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer\\Run\n\nPrograms listed in the load value of the registry key HKEY_CURRENT_USER\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Windows run automatically for the currently logged-on user.\nBy default, the multistring BootExecute value of the registry key HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\Session Manager is set to autocheck autochk *. This value causes Windows, at startup, to check the file-system integrity of the hard disks if the system has been shut down abnormally. Adversaries can add other programs or processes to this registry value which will automatically launch at boot.\nAdversaries can use these configuration locations to execute malware, such as remote access tools, to maintain persistence through system reboots. Adversaries may also use Masquerading to make the Registry entries look as if they are associated with legitimate programs.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Installs system startup script or application",
                  "match_data": [
                    "(Process #1) rfq chip 1 new project bom 090725.exe adds \"\"C:\\ProgramData\\local\\explore.exe\"\" to Windows startup via registry.",
                    "(Process #2) explore.exe adds \"\"C:\\ProgramData\\local\\explore.exe\"\" to Windows startup via registry.",
                    "(Process #9) explore.exe adds \"\"C:\\ProgramData\\local\\explore.exe\"\" to Windows startup via registry."
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0006",
          "name": "Credential Access",
          "link": "https://attack.mitre.org/tactics/TA0006/",
          "description": "The adversary is trying to steal account names and passwords.\n\nCredential Access consists of techniques for stealing credentials like account names and passwords. Techniques used to get credentials include keylogging or credential dumping. Using legitimate credentials can give adversaries access to systems, make them harder to detect, and provide the opportunity to create more accounts to help achieve their goals.",
          "techniques": [
            {
              "id": "T1056",
              "name": "Input Capture",
              "link": "https://attack.mitre.org/techniques/T1056/",
              "description": "Adversaries may use methods of capturing user input to obtain credentials or collect information. During normal system usage, users often provide credentials to various different locations, such as login pages/portals or system dialog boxes. Input capture mechanisms may be transparent to the user (e.g. Credential API Hooking) or rely on deceiving the user into providing input into what they believe to be a genuine service (e.g. Web Portal Capture).",
              "signatures": [
                {
                  "severity": "HIGH",
                  "description": "Combination of other detections shows multiple input capture behaviors",
                  "match_data": [
                    "(Process #2) explore.exe logs keys and captures keyboard.",
                    "(Process #9) explore.exe logs keys, captures keyboard, queries foreground window and potentially exfiltrates data."
                  ]
                }
              ]
            },
            {
              "id": "T1056.001",
              "name": "Keylogging",
              "link": "https://attack.mitre.org/techniques/T1056/001/",
              "description": "Adversaries may log user keystrokes to intercept credentials as the user types them. Keylogging is likely to be used to acquire credentials for new access opportunities when OS Credential Dumping efforts are not effective, and may require an adversary to intercept keystrokes on a system for a substantial period of time before credentials can be successfully captured. In order to increase the likelihood of capturing credentials quickly, an adversary may also perform actions such as clearing browser cookies to force users to reauthenticate to systems.\nKeylogging is the most prevalent type of input capture, with many different ways of intercepting keystrokes. Some methods include:\n\nHooking API callbacks used for processing keystrokes. Unlike Credential API Hooking, this focuses solely on API functions intended for processing keystroke data.\nReading raw keystroke data from the hardware buffer.\nWindows Registry modifications.\nCustom drivers.\nModify System Image may provide adversaries with hooks into the operating system of network devices to read raw keystrokes for login sessions. \n",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Monitors keyboard input",
                  "match_data": [
                    "(Process #2) explore.exe installs system wide \"WH_KEYBOARD_LL\" hook(s) to monitor keystrokes.",
                    "(Process #9) explore.exe installs system wide \"WH_KEYBOARD_LL\" hook(s) to monitor keystrokes."
                  ]
                }
              ]
            },
            {
              "id": "T1056.002",
              "name": "GUI Input Capture",
              "link": "https://attack.mitre.org/techniques/T1056/002/",
              "description": "Adversaries may mimic common operating system GUI components to prompt users for credentials with a seemingly legitimate prompt. When programs are executed that need additional privileges than are present in the current user context, it is common for the operating system to prompt the user for proper credentials to authorize the elevated privileges for the task (ex: Bypass User Account Control).\nAdversaries may mimic this functionality to prompt users for credentials with a seemingly legitimate prompt for a number of reasons that mimic normal usage, such as a fake installer requiring additional access or a fake malware removal suite. This type of prompt can be used to collect credentials via various languages such as AppleScript and PowerShell. On Linux systems adversaries may launch dialog boxes prompting users for credentials from malicious shell scripts or the command line (i.e. Unix Shell).\nAdversaries may also mimic common software authentication requests, such as those from browsers or email clients. This may also be paired with user activity monitoring (i.e., Browser Information Discovery and/or Application Window Discovery) to spoof prompts when users are naturally accessing sensitive sites/data.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Monitors user input",
                  "match_data": [
                    "(Process #9) explore.exe reads the text contents of the foreground window by API (possible keylogging attempt)."
                  ]
                }
              ]
            },
            {
              "id": "T1056.004",
              "name": "Credential API Hooking",
              "link": "https://attack.mitre.org/techniques/T1056/004/",
              "description": "Adversaries may hook into Windows application programming interface (API) functions and Linux system functions to collect user credentials. Malicious hooking mechanisms may capture API or function calls that include parameters that reveal user authentication credentials. Unlike Keylogging, this technique focuses specifically on API functions that include parameters that reveal user credentials. \nIn Windows, hooking involves redirecting calls to these functions and can be implemented via:\n\nHooks procedures, which intercept and execute designated code in response to events such as messages, keystrokes, and mouse inputs.\nImport address table (IAT) hooking, which use modifications to a process’s IAT, where pointers to imported API functions are stored.\nInline hooking, which overwrites the first bytes in an API function to redirect code flow.\n\nIn Linux and macOS, adversaries may hook into system functions via the LD_PRELOAD (Linux) or DYLD_INSERT_LIBRARIES (macOS) environment variables, which enables loading shared libraries into a program’s address space. For example, an adversary may capture credentials by hooking into the libc read function leveraged by SSH or SCP.",
              "signatures": [
                {
                  "severity": "MEDIUM",
                  "description": "Monitors keyboard input",
                  "match_data": [
                    "(Process #2) explore.exe installs system wide \"WH_KEYBOARD_LL\" hook(s) to monitor keystrokes.",
                    "(Process #9) explore.exe installs system wide \"WH_KEYBOARD_LL\" hook(s) to monitor keystrokes."
                  ]
                }
              ]
            },
            {
              "id": "T1552",
              "name": "Unsecured Credentials",
              "link": "https://attack.mitre.org/techniques/T1552/",
              "description": "Adversaries may search compromised systems to find and obtain insecurely stored credentials. These credentials can be stored and/or misplaced in many locations on a system, including plaintext files (e.g. Shell History), operating system or application-specific repositories (e.g. Credentials in Registry),  or other specialized files/artifacts (e.g. Private Keys)."
            },
            {
              "id": "T1552.001",
              "name": "Credentials In Files",
              "link": "https://attack.mitre.org/techniques/T1552/001/",
              "description": "Adversaries may search local file systems and remote file shares for files containing insecurely stored credentials. These can be files created by users to store their own credentials, shared credential stores for a group of individuals, configuration files containing passwords for a system or service, or source code/binary files containing embedded passwords.\nIt is possible to extract passwords from backups or saved virtual machines through OS Credential Dumping. Passwords may also be obtained from Group Policy Preferences stored on the Windows Domain Controller.\nIn cloud and/or containerized environments, authenticated user and service account credentials are often stored in local configuration and credential files. They may also be found as parameters to deployment commands in container logs. In some cases, these files can be copied and reused on another machine or the contents can be read and then used to authenticate without needing to copy any files.",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Searches for sensitive browser data",
                  "match_data": [
                    "(Process #9) explore.exe searches for sensitive data of web browser \"Mozilla Firefox\" by file.",
                    "(Process #9) explore.exe searches for sensitive data of web browser \"Opera\" by file.",
                    "(Process #17) rmclient.exe searches for sensitive data of web browser \"Internet Explorer / Edge\" by file.",
                    "(Process #19) rmclient.exe searches for sensitive data of web browser \"Internet Explorer / Edge\" by file.",
                    "(Process #19) rmclient.exe searches for sensitive data of web browser \"Mozilla Firefox\" by file.",
                    "(Process #20) rmclient.exe searches for sensitive data of web browser \"Internet Explorer / Edge\" by file.",
                    "(Process #22) rmclient.exe searches for sensitive data of web browser \"Internet Explorer / Edge\" by file.",
                    "(Process #22) rmclient.exe searches for sensitive data of web browser \"Mozilla Firefox\" by file.",
                    "(Process #20) rmclient.exe searches for sensitive data of web browser \"Mozilla Firefox\" by file.",
                    "(Process #20) rmclient.exe searches for sensitive data of web browser \"Yandex Browser\" by file."
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "Reads sensitive browser data",
                  "match_data": [
                    "(Process #17) rmclient.exe tries to read sensitive data of web browser \"Internet Explorer / Edge\" by file.",
                    "(Process #20) rmclient.exe tries to read sensitive data of web browser \"Internet Explorer / Edge\" by file."
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "Reads sensitive mail data",
                  "match_data": [
                    "(Process #21) rmclient.exe tries to read sensitive data of mail application \"Windows Mail\" by file.",
                    "(Process #18) rmclient.exe tries to read sensitive data of mail application \"Windows Mail\" by file."
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "Searches for sensitive application data",
                  "match_data": [
                    "(Process #21) rmclient.exe searches for sensitive data of application \"jDownloader\" by file.",
                    "(Process #18) rmclient.exe searches for sensitive data of application \"jDownloader\" by file."
                  ]
                }
              ]
            },
            {
              "id": "T1552.002",
              "name": "Credentials in Registry",
              "link": "https://attack.mitre.org/techniques/T1552/002/",
              "description": "Adversaries may search the Registry on compromised systems for insecurely stored credentials. The Windows Registry stores configuration information that can be used by the system or other programs. Adversaries may query the Registry looking for credentials and passwords that have been stored for use by other programs or services. Sometimes these credentials are used for automatic logons.\nExample commands to find Registry keys related to password information: \n\nLocal Machine Hive: reg query HKLM /f password /t REG_SZ /s\nCurrent User Hive: reg query HKCU /f password /t REG_SZ /s\n",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Searches for sensitive application data",
                  "match_data": [
                    "(Process #19) rmclient.exe tries to access sensitive data of application \"Google Talk\" by registry.",
                    "(Process #19) rmclient.exe tries to access sensitive data of application \"Google Desktop\" by registry.",
                    "(Process #22) rmclient.exe tries to access sensitive data of application \"Google Talk\" by registry.",
                    "(Process #22) rmclient.exe tries to access sensitive data of application \"Google Desktop\" by registry.",
                    "(Process #21) rmclient.exe tries to access sensitive data of application \"Google Talk\" by registry.",
                    "(Process #21) rmclient.exe tries to access sensitive data of application \"Google Desktop\" by registry.",
                    "(Process #18) rmclient.exe tries to access sensitive data of application \"Google Talk\" by registry.",
                    "(Process #18) rmclient.exe tries to access sensitive data of application \"Google Desktop\" by registry."
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "Searches for sensitive browser data",
                  "match_data": [
                    "(Process #19) rmclient.exe tries to access sensitive data of web browser \"Internet Explorer / Edge\" by registry.",
                    "(Process #17) rmclient.exe tries to access sensitive data of web browser \"Internet Explorer / Edge\" by registry.",
                    "(Process #22) rmclient.exe tries to access sensitive data of web browser \"Internet Explorer / Edge\" by registry.",
                    "(Process #21) rmclient.exe tries to access sensitive data of web browser \"Internet Explorer / Edge\" by registry.",
                    "(Process #20) rmclient.exe tries to access sensitive data of web browser \"Internet Explorer / Edge\" by registry.",
                    "(Process #18) rmclient.exe tries to access sensitive data of web browser \"Internet Explorer / Edge\" by registry."
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "Searches for sensitive mail data",
                  "match_data": [
                    "(Process #21) rmclient.exe tries to access sensitive data of mail application \"Microsoft Outlook\" by registry.",
                    "(Process #21) rmclient.exe tries to access sensitive data of mail application \"IncrediMail\" by registry.",
                    "(Process #18) rmclient.exe tries to access sensitive data of mail application \"Microsoft Outlook\" by registry.",
                    "(Process #18) rmclient.exe tries to access sensitive data of mail application \"IncrediMail\" by registry."
                  ]
                },
                {
                  "severity": "LOW",
                  "description": "Reads sensitive mail data",
                  "match_data": [
                    "(Process #21) rmclient.exe tries to read sensitive data of mail application \"Microsoft Outlook\" by registry.",
                    "(Process #18) rmclient.exe tries to read sensitive data of mail application \"Microsoft Outlook\" by registry."
                  ]
                }
              ]
            },
            {
              "id": "T1555",
              "name": "Credentials from Password Stores",
              "link": "https://attack.mitre.org/techniques/T1555/",
              "description": "Adversaries may search for common password storage locations to obtain user credentials. Passwords are stored in several places on a system, depending on the operating system or application holding the credentials. There are also specific applications and services that store passwords to make them easier for users to manage and maintain, such as password managers and cloud secrets vaults. Once credentials are obtained, they can be used to perform lateral movement and access restricted information."
            },
            {
              "id": "T1555.003",
              "name": "Credentials from Web Browsers",
              "link": "https://attack.mitre.org/techniques/T1555/003/",
              "description": "Adversaries may acquire credentials from web browsers by reading files specific to the target browser. Web browsers commonly save credentials such as website usernames and passwords so that they do not need to be entered manually in the future. Web browsers typically store the credentials in an encrypted format within a credential store; however, methods exist to extract plaintext credentials from web browsers.\nFor example, on Windows systems, encrypted credentials may be obtained from Google Chrome by reading a database file, AppData\\Local\\Google\\Chrome\\User Data\\Default\\Login Data and executing a SQL query: SELECT action_url, username_value, password_value FROM logins;. The plaintext password can then be obtained by passing the encrypted credentials to the Windows API function CryptUnprotectData, which uses the victim’s cached logon credentials as the decryption key.\nAdversaries have executed similar procedures for common web browsers such as FireFox, Safari, Edge, etc. Windows stores Internet Explorer and Microsoft Edge credentials in Credential Lockers managed by the Windows Credential Manager.\nAdversaries may also acquire credentials by searching web browser process memory for patterns that commonly match credentials.\nAfter acquiring credentials from web browsers, adversaries may attempt to recycle the credentials across different systems and/or accounts in order to expand access. This can result in significantly furthering an adversary's objective in cases where credentials gained from web browsers overlap with privileged accounts (e.g. domain administrator).",
              "signatures": [
                {
                  "severity": "LOW",
                  "description": "Reads sensitive browser data",
                  "match_data": [
                    "(Process #20) rmclient.exe tries to read credentials of web browser \"Internet Explorer\" by reading from the system's credential vault.",
                    "(Process #17) rmclient.exe tries to read credentials of web browser \"Internet Explorer\" by reading from the system's credential vault."
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0011",
          "name": "Command and Control",
          "link": "https://attack.mitre.org/tactics/TA0011/",
          "description": "The adversary is trying to communicate with compromised systems to control them.\n\nCommand and Control consists of techniques that adversaries may use to communicate with systems under their control within a victim network. Adversaries commonly attempt to mimic normal, expected traffic to avoid detection. There are many ways an adversary can establish command and control with various levels of stealth depending on the victim’s network structure and defenses.",
          "techniques": [
            {
              "id": "T1071",
              "name": "Application Layer Protocol",
              "link": "https://attack.mitre.org/techniques/T1071/",
              "description": "Adversaries may communicate using OSI application layer protocols to avoid detection/network filtering by blending in with existing traffic. Commands to the remote system, and often the results of those commands, will be embedded within the protocol traffic between the client and server. \nAdversaries may utilize many different protocols, including those used for web browsing, transferring files, electronic mail, DNS, or publishing/subscribing. For connections that occur internally within an enclave (such as those between a proxy or pivot node and other nodes), commonly used protocols are SMB, SSH, or RDP. "
            },
            {
              "id": "T1071.004",
              "name": "DNS",
              "link": "https://attack.mitre.org/techniques/T1071/004/",
              "description": "Adversaries may communicate using the Domain Name System (DNS) application layer protocol to avoid detection/network filtering by blending in with existing traffic. Commands to the remote system, and often the results of those commands, will be embedded within the protocol traffic between the client and server. \nThe DNS protocol serves an administrative function in computer networking and thus may be very common in environments. DNS traffic may also be allowed even before network authentication is completed. DNS packets contain many fields and headers in which data can be concealed. Often known as DNS tunneling, adversaries may abuse DNS to communicate with systems under their control within a victim network while also mimicking normal, expected traffic.\nDNS beaconing may be used to send commands to remote systems via DNS queries. A DNS beacon is created by tunneling DNS traffic (i.e. Protocol Tunneling). The commands may be embedded into different DNS records, for example, TXT or A records. DNS beacons may be difficult to detect because the beacons infrequently communicate with infected devices. Infrequent communication conceals the malicious DNS traffic with normal DNS traffic. ",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Performs DNS request",
                  "match_data": [
                    "(Process #2) explore.exe fails to resolve hostname \"officedesk.4nmn.com\"",
                    "(Process #9) explore.exe resolves hostname \"officedesk.4nmn.com\" to IP \"196.251.84.228\".",
                    "(Process #2) explore.exe resolves hostname \"officedesk.4nmn.com\" to IP \"196.251.84.228\"."
                  ]
                }
              ]
            },
            {
              "id": "T1095",
              "name": "Non-Application Layer Protocol",
              "link": "https://attack.mitre.org/techniques/T1095/",
              "description": "Adversaries may use an OSI non-application layer protocol for communication between host and C2 server or among infected hosts within a network. The list of possible protocols is extensive. Specific examples include use of network layer protocols, such as the Internet Control Message Protocol (ICMP), transport layer protocols, such as the User Datagram Protocol (UDP), session layer protocols, such as Socket Secure (SOCKS), as well as redirected/tunneled protocols, such as Serial over LAN (SOL).\nICMP communication between hosts is one example. Because ICMP is part of the Internet Protocol Suite, it is required to be implemented by all IP-compatible hosts. However, it is not as commonly monitored as other Internet Protocols such as TCP or UDP and may be used by adversaries to hide communications.\nIn ESXi environments, adversaries may leverage the Virtual Machine Communication Interface (VMCI) for communication between guest virtual machines and the ESXi host. This traffic is similar to client-server communications on traditional network sockets but is localized to the physical machine running the ESXi host, meaning it does not traverse external networks (routers, switches). This results in communications that are invisible to external monitoring and standard networking tools like tcpdump, netstat, nmap, and Wireshark. By adding a VMCI backdoor to a compromised ESXi host, adversaries may persistently regain access from any guest VM to the compromised ESXi host’s backdoor, regardless of network segmentation or firewall rules in place.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Connects to remote host",
                  "match_data": [
                    "(Process #9) explore.exe opens an outgoing TCP connection to host \"196.251.84.228:1860\"."
                  ]
                }
              ]
            },
            {
              "id": "T1571",
              "name": "Non-Standard Port",
              "link": "https://attack.mitre.org/techniques/T1571/",
              "description": "Adversaries may communicate using a protocol and port pairing that are typically not associated. For example, HTTPS over port 8088 or port 587 as opposed to the traditional port 443. Adversaries may make changes to the standard port used by a protocol to bypass filtering or muddle analysis/parsing of network data.\nAdversaries may also make changes to victim systems to abuse non-standard ports. For example, Registry keys and other configuration settings can be used to modify protocol and port pairings.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Tries to connect using an uncommon port",
                  "match_data": [
                    "(Process #9) explore.exe tries to connect to TCP port 1860 at 196.251.84.228."
                  ]
                }
              ]
            }
          ]
        },
        {
          "id": "TA0003",
          "name": "Persistence",
          "link": "https://attack.mitre.org/tactics/TA0003/",
          "description": "The adversary is trying to maintain their foothold.\n\nPersistence consists of techniques that adversaries use to keep access to systems across restarts, changed credentials, and other interruptions that could cut off their access. Techniques used for persistence include any access, action, or configuration changes that let them maintain their foothold on systems, such as replacing or hijacking legitimate code or adding startup code. ",
          "techniques": [
            {
              "id": "T1112",
              "name": "Modify Registry",
              "link": "https://attack.mitre.org/techniques/T1112/",
              "description": "Adversaries may interact with the Windows Registry as part of a variety of other techniques to aid in defense evasion, persistence, and execution.\nAccess to specific areas of the Registry depends on account permissions, with some keys requiring administrator-level access. The built-in Windows command-line utility Reg may be used for local or remote Registry modification. Other tools, such as remote access tools, may also contain functionality to interact with the Registry through the Windows API.\nThe Registry may be modified in order to hide configuration information or malicious payloads via Obfuscated Files or Information. The Registry may also be modified to Impair Defenses, such as by enabling macros for all Microsoft Office products, allowing privilege escalation without alerting the user, increasing the maximum number of allowed outbound requests, and/or modifying systems to store plaintext credentials in memory.\nThe Registry of a remote system may be modified to aid in execution of files as part of lateral movement. It requires the remote Registry service to be running on the target system. Often Valid Accounts are required, along with access to the remote system's SMB/Windows Admin Shares for RPC communication.\nFinally, Registry modifications may also include actions to hide keys, such as prepending key names with a null character, which will cause an error and/or be ignored when read via Reg or other utilities using the Win32 API. Adversaries may abuse these pseudo-hidden keys to conceal payloads/commands used to maintain persistence.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Installs system startup script or application",
                  "match_data": [
                    "(Process #1) rfq chip 1 new project bom 090725.exe adds \"\"C:\\ProgramData\\local\\explore.exe\"\" to Windows startup via registry.",
                    "(Process #2) explore.exe adds \"\"C:\\ProgramData\\local\\explore.exe\"\" to Windows startup via registry.",
                    "(Process #9) explore.exe adds \"\"C:\\ProgramData\\local\\explore.exe\"\" to Windows startup via registry."
                  ]
                }
              ]
            },
            {
              "id": "T1547",
              "name": "Boot or Logon Autostart Execution",
              "link": "https://attack.mitre.org/techniques/T1547/",
              "description": "Adversaries may configure system settings to automatically execute a program during system boot or logon to maintain persistence or gain higher-level privileges on compromised systems. Operating systems may have mechanisms for automatically running a program on system boot or account logon. These mechanisms may include automatically executing programs that are placed in specially designated directories or are referenced by repositories that store configuration information, such as the Windows Registry. An adversary may achieve the same goal by modifying or extending features of the kernel.\nSince some boot or logon autostart programs run with higher privileges, an adversary may leverage these to elevate privileges."
            },
            {
              "id": "T1547.001",
              "name": "Registry Run Keys / Startup Folder",
              "link": "https://attack.mitre.org/techniques/T1547/001/",
              "description": "Adversaries may achieve persistence by adding a program to a startup folder or referencing it with a Registry run key. Adding an entry to the \"run keys\" in the Registry or startup folder will cause the program referenced to be executed when a user logs in. These programs will be executed under the context of the user and will have the account's associated permissions level.\nThe following run keys are created by default on Windows systems:\n\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnce\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Run\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnce\n\nRun keys may exist under multiple hives. The HKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunOnceEx is also available but is not created by default on Windows Vista and newer. Registry run key entries can reference programs directly or list them as a dependency. For example, it is possible to load a DLL at logon using a \"Depend\" key with RunOnceEx: reg add HKLM\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\RunOnceEx\\0001\\Depend /v 1 /d \"C:\\temp\\evil[.]dll\" \nPlacing a program within a startup folder will also cause that program to execute when a user logs in. There is a startup folder location for individual user accounts as well as a system-wide startup folder that will be checked regardless of which user account logs in. The startup folder path for the current user is C:\\Users\\[Username]\\AppData\\Roaming\\Microsoft\\Windows\\Start Menu\\Programs\\Startup. The startup folder path for all users is C:\\ProgramData\\Microsoft\\Windows\\Start Menu\\Programs\\StartUp.\nThe following Registry keys can be used to set startup folder items for persistence:\n\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell Folders\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Shell Folders\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\Shell Folders\nHKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows\\CurrentVersion\\Explorer\\User Shell Folders\n\nThe following Registry keys can control automatic startup of services during boot:\n\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServicesOnce\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServicesOnce\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServices\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\RunServices\n\nUsing policy settings to specify startup programs creates corresponding values in either of two Registry keys:\n\nHKEY_LOCAL_MACHINE\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer\\Run\nHKEY_CURRENT_USER\\Software\\Microsoft\\Windows\\CurrentVersion\\Policies\\Explorer\\Run\n\nPrograms listed in the load value of the registry key HKEY_CURRENT_USER\\Software\\Microsoft\\Windows NT\\CurrentVersion\\Windows run automatically for the currently logged-on user.\nBy default, the multistring BootExecute value of the registry key HKEY_LOCAL_MACHINE\\System\\CurrentControlSet\\Control\\Session Manager is set to autocheck autochk *. This value causes Windows, at startup, to check the file-system integrity of the hard disks if the system has been shut down abnormally. Adversaries can add other programs or processes to this registry value which will automatically launch at boot.\nAdversaries can use these configuration locations to execute malware, such as remote access tools, to maintain persistence through system reboots. Adversaries may also use Masquerading to make the Registry entries look as if they are associated with legitimate programs.",
              "signatures": [
                {
                  "severity": "INFO",
                  "description": "Installs system startup script or application",
                  "match_data": [
                    "(Process #1) rfq chip 1 new project bom 090725.exe adds \"\"C:\\ProgramData\\local\\explore.exe\"\" to Windows startup via registry.",
                    "(Process #2) explore.exe adds \"\"C:\\ProgramData\\local\\explore.exe\"\" to Windows startup via registry.",
                    "(Process #9) explore.exe adds \"\"C:\\ProgramData\\local\\explore.exe\"\" to Windows startup via registry."
                  ]
                }
              ]
            }
          ]
        }
      ]
    }
  },
  "links": {
    "self": "https://www.virustotal.com/api/v3/files/e24d9afbc2ed01e348ef6946672ef5f310940dd57a5216d0f1edbe31c919374b/behaviour_mitre_trees"
  }
}